@extends('app.layouts.master')

@section('head-tag')
    <title>قوانین مرتبط با اختلافات در معاملات</title>
    <link rel="stylesheet" href="{{ asset('app-assets/OwlCarousel/owl.carousel.min.css') }}">
    <link rel="stylesheet" href="{{ asset('app-assets/OwlCarousel/owl.theme.default.min.css') }}">
    <link rel="stylesheet" href="{{ asset('app-assets/css/owl-carousel-navs-modification.css') }}">
@endsection

@section('content')
    <section class="bg-white border rounded-md p-4">
        <section class="flex justify-between items-baseline border-b">
            <section class="title text-xl">
                قوانین مرتبط با اختلافات در معاملات
            </section>

            <section>
                <a class="bg-blue-200 px-4 py-2 text-gray-600 rounded-md">بازگشت به راهنما</a>
            </section>
        </section>

        <section class="py-5">
            <p>توضیحات کلی در مورد آشنایی با فعالیت سایت
خدمات معاملاتی و بازرگانی وب سایت ایسام به دو بخش تقسیم می شود. بخش اول فروشندگان که به عنوان عرضه کننده فعالیت می نمایند و بخش دوم خریداران که با استفاده از خدمات سایت ایسام ، محصولات عرضه شده را خریداری می نمایند. خدمات مدیریت مالی و حسابداری سایت توسط واحد مالی حمایت می گردد، تا بتوانیم محیطی امن برای تجارت شما ایجاد نموده و همچنین میزان سود دهی افراد در معاملات را افزایش داده و از حقوق خریدار و فروشنده محافظت نماییم.

چنانچه در یک معامله، اختلافی بین خریدار و فروشنده به وجود آید، دو طرف برای حل اختلاف به مذاکره با یکدیگر فراخوانده می شوند. درصورت درخواست هریک از طرفین، سایت نیز برای رسیدن به یک تفاهم طرفین را یاری خواهد کرد. با این وجود، چنانچه یک هفته پس از طرح شکایت و یا 7 روز پس از درخواست برای استرداد مبلغ مبادله، همچنان دو طرف به توافقی نرسیده باشند، موضوع برای تصمیم گیری به خود سایت ارجاع داده شده سپس از طرفین درخواست می شود تا مدارک خود را ارایه نمایند. طرفین موظف خواهند بود که برای رسیدگی به موارد اختلاف، تابع قوانین سایت باشند.
موافقت طرفین بدین معنا می باشد که سایت ایسام با توجه به نقش خود به عنوان داور مرضی الطرفین (طبق آیین دادرسی مدنی- کتاب اول، بابت هفتم، داوری / مواد ۴۵۴ الی ۵۰۱) و بر پایه قوانین سایت، حق تصمیم گیری برای حل اختلاف به وجود آمده را دارا می باشد. سایت مسئولیتی در قبال حل اختلاف در خارج از این چهارچوب تعیین شده نخواهد داشت.
همینطور در صورتی که بخش حل اختلاف سایت ایسام نتواند بر اساس مستندات موجود تصمیم گیری کند این حق را دارد تا مراجعه طرفین دعوی به مراجع ذی صلاح قضایی و طرح شکایت از طرف مقابل، وجه دریافت شده کالا را به عنوان امانت نزد خود نگاه دارد.

تبصره 1- در صورتی که قسمت حل اختلاف سایت نظر نهایی، در مورد حل یک اختلاف را اعلام نموده و لیکن طرفین آن نظر را اجرا ننمایند، دیگر حق طرح هیچ گونه شکایتی در این مورد را نخواهند داشت.
این قوانین شامل فعالیت های غیر قانونی اعضاء نبوده و در صورتی که محصولی برخلاف قوانین و مقررات به فروش برسد، سایت ایسام حق لغو و یا تعلیق هر معامله ای را برای خود محفوظ داشته و طبق توافق نامه میتواند حساب کاربری اشخاص خاطی را مسدود نماید.

1-1 محل تحویل کالا به خریدار
کالا به آدرس ثبت شده خریدار در سایت ارسال خواهد شد. چنانچه در هنگام خرید، آدرس جدیدی قید نشده باشد، آدرسی که خریدار در سایت عنوان نموده، به عنوان محل تحویل در نظر گرفته خواهد شد. هنگام مرجوع شدن کالا، آدرس تحویل فروشنده، همان آدرسی که در حساب کاربری ذکر شده، در نظر گرفته خواهد شد. </p>
        </section>
    </section>

    <section class="bg-white border rounded-md p-7 mt-4">

        <section>
            <h6 class="font-bold text-base text-gray-800"> لینکهای مرتبط  </h6>

            <div class="flex flex-col mt-3">
                <a href="" class="a-hover py-4 first:border-t-0 border-t text-gray-600 text-sm">چگونه خرید کنم و در مزایدات شرکت کنم؟</a>
                <a href="" class="a-hover py-4 first:border-t-0 border-t text-gray-600 text-sm">چگونه خرید کنم و در مزایدات شرکت کنم؟</a>
                <a href="" class="a-hover py-4 first:border-t-0 border-t text-gray-600 text-sm">چگونه خرید کنم و در مزایدات شرکت کنم؟</a>
                <a href="" class="a-hover py-4 first:border-t-0 border-t text-gray-600 text-sm">چگونه خرید کنم و در مزایدات شرکت کنم؟</a>
            </div>
        </section>
    </section>
@endsection

