-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jun 24, 2022 at 07:49 PM
-- Server version: 10.5.15-MariaDB-0ubuntu0.21.10.1
-- PHP Version: 8.0.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `esam`
--

-- --------------------------------------------------------

--
-- Table structure for table `addresses`
--

CREATE TABLE `addresses` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `city_id` bigint(20) UNSIGNED NOT NULL,
  `province_id` bigint(20) UNSIGNED NOT NULL,
  `postal_code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `no` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `unit` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `recipient_first_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `recipient_last_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `amazing_sales`
--

CREATE TABLE `amazing_sales` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `percentage` int(11) NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `start_date` timestamp NULL DEFAULT NULL,
  `end_date` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `amazing_sales`
--

INSERT INTO `amazing_sales` (`id`, `product_id`, `percentage`, `status`, `start_date`, `end_date`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 2, 30, 1, '2022-06-24 19:40:35', '2022-07-28 19:40:35', '2022-06-24 19:40:53', '2022-06-24 19:40:57', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `auctions`
--

CREATE TABLE `auctions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `start_price` decimal(20,3) NOT NULL,
  `reserved_price` decimal(20,3) DEFAULT NULL COMMENT 'if prices not reached to this, seller can don''t send product',
  `urgent_price` decimal(20,3) DEFAULT NULL COMMENT 'if user pay this can buy product',
  `start_date` timestamp NULL DEFAULT NULL,
  `end_date` timestamp NULL DEFAULT NULL,
  `period_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `auctions`
--

INSERT INTO `auctions` (`id`, `product_id`, `start_price`, `reserved_price`, `urgent_price`, `start_date`, `end_date`, `period_id`, `created_at`, `updated_at`) VALUES
(1, 1, '1000000.000', '200000000.000', NULL, '2022-06-28 19:33:07', '2022-07-05 19:33:07', 7, '2022-06-24 19:35:02', '2022-06-24 19:35:02');

-- --------------------------------------------------------

--
-- Table structure for table `auction_follower`
--

CREATE TABLE `auction_follower` (
  `auction_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `auction_periods`
--

CREATE TABLE `auction_periods` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `period` int(11) NOT NULL,
  `unit` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `fa` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `auction_periods`
--

INSERT INTO `auction_periods` (`id`, `period`, `unit`, `fa`, `created_at`, `updated_at`) VALUES
(1, 1, 'day', '۱ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(2, 2, 'day', '۲ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(3, 3, 'day', '۳ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(4, 4, 'day', '۴ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(5, 5, 'day', '۵ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(6, 6, 'day', '۶ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(7, 7, 'day', '۷ روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29');

-- --------------------------------------------------------

--
-- Table structure for table `auction_suggestions`
--

CREATE TABLE `auction_suggestions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `auction_id` bigint(20) UNSIGNED NOT NULL,
  `suggested_amount` decimal(20,3) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `banners`
--

CREATE TABLE `banners` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `url` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `banner` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `banners`
--

INSERT INTO `banners` (`id`, `url`, `banner`, `created_at`, `updated_at`) VALUES
(1, 'http://essam.test/item/1/%D9%86%DB%8C%D8%B3%D8%A7%D9%86-%D8%A2%D8%A8%DB%8C-%D8%A2%D9%82%D8%A7-%D8%AC%D9%85%D8%B4%DB%8C%D8%AF-%D8%AF%D8%B1-%D8%B3%D8%B1%DB%8C%D8%A7%D9%84-%D9%86%DB%8C%D8%B3%D8%A7%D9%86-%D8%A2%D8%A8%DB%8C', 'images/banners/2022/06/24/1656083316_823_0.jpeg', '2022-06-24 15:08:36', '2022-06-24 19:47:20');

-- --------------------------------------------------------

--
-- Table structure for table `cart_items`
--

CREATE TABLE `cart_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `number` int(11) NOT NULL DEFAULT 1,
  `variant_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cash_payments`
--

CREATE TABLE `cash_payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `amount` bigint(20) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `pay_date` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `category_selectable_attribute_value`
--

CREATE TABLE `category_selectable_attribute_value` (
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `attribute_value_id` bigint(20) UNSIGNED NOT NULL,
  `attribute_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `category_selectable_attribute_value`
--

INSERT INTO `category_selectable_attribute_value` (`category_id`, `attribute_value_id`, `attribute_id`) VALUES
(9, 1, 1),
(9, 2, 1),
(9, 3, 1),
(9, 4, 1),
(9, 5, 2),
(9, 6, 2),
(9, 7, 2),
(9, 8, 2),
(9, 9, 2),
(9, 10, 2),
(9, 11, 2),
(9, 12, 2),
(9, 13, 2),
(9, 14, 2),
(9, 15, 2),
(13, 1, 1),
(13, 2, 1),
(13, 3, 1),
(13, 4, 1),
(16, 1, 1),
(16, 2, 1),
(16, 3, 1),
(16, 4, 1),
(16, 16, 3),
(16, 17, 3),
(16, 18, 3),
(16, 19, 3),
(16, 20, 3),
(16, 21, 3),
(17, 1, 1),
(17, 2, 1),
(17, 3, 1),
(17, 4, 1),
(17, 16, 3),
(17, 17, 3),
(17, 18, 3),
(17, 19, 3),
(17, 20, 3),
(17, 21, 3),
(18, 1, 1),
(18, 2, 1),
(18, 3, 1),
(18, 4, 1),
(18, 16, 3),
(18, 17, 3),
(18, 18, 3),
(18, 19, 3),
(18, 20, 3),
(18, 21, 3),
(19, 1, 1),
(19, 2, 1),
(19, 3, 1),
(19, 4, 1),
(19, 16, 3),
(19, 17, 3),
(19, 18, 3),
(19, 19, 3),
(19, 20, 3),
(19, 21, 3),
(20, 1, 1),
(20, 2, 1),
(20, 3, 1),
(20, 4, 1),
(20, 16, 3),
(20, 17, 3),
(20, 18, 3),
(20, 19, 3),
(20, 20, 3),
(20, 21, 3),
(21, 1, 1),
(21, 2, 1),
(21, 3, 1),
(21, 4, 1),
(21, 16, 3),
(21, 17, 3),
(21, 18, 3),
(21, 19, 3),
(21, 20, 3),
(21, 21, 3),
(23, 1, 1),
(23, 2, 1),
(23, 3, 1),
(23, 4, 1),
(23, 16, 3),
(23, 17, 3),
(23, 18, 3),
(23, 19, 3),
(23, 20, 3),
(23, 21, 3),
(32, 1, 1),
(32, 2, 1),
(32, 3, 1),
(32, 4, 1),
(34, 1, 1),
(34, 2, 1),
(34, 3, 1),
(34, 4, 1),
(35, 1, 1),
(35, 2, 1),
(35, 3, 1),
(35, 4, 1),
(48, 1, 1),
(48, 2, 1),
(48, 3, 1),
(48, 4, 1),
(48, 16, 3),
(48, 17, 3),
(48, 18, 3),
(48, 19, 3),
(49, 1, 1),
(49, 2, 1),
(49, 3, 1),
(49, 4, 1),
(49, 16, 3),
(49, 17, 3),
(49, 18, 3),
(49, 19, 3),
(49, 20, 3),
(49, 21, 3);

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `province_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `en_name` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `latitude` decimal(10,8) DEFAULT NULL,
  `longitude` decimal(11,8) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `province_id`, `name`, `en_name`, `latitude`, `longitude`) VALUES
(1, 1, 'آذرشهر', 'Azarshahr', '37.75601290', '45.95409340'),
(2, 1, 'تیمورلو', 'Teymourlou', '37.81040850', '45.88154540'),
(3, 1, 'گوگان', 'Gogan', '37.78153460', '45.89832550'),
(4, 1, 'ممقان', 'Mamaqan', '37.85616440', '45.92748410'),
(5, 1, 'اسکو', 'Osku', '37.90414240', '46.10855880'),
(6, 1, 'ایلخچی', 'Ilkhichi', '37.93748590', '45.94332160'),
(7, 1, 'سهند', 'Sahand', '37.94212840', '46.11317040'),
(8, 1, 'اهر', 'Ahar', '38.48012310', '47.03671870'),
(9, 1, 'هوراند', 'Hurand', '38.85916700', '47.36861100'),
(10, 1, 'بستان آباد', 'Bostan Abad', '37.83949300', '46.80963270'),
(11, 1, 'تیکمه داش', 'Tekmeh Dash', '37.73535540', '46.93088980'),
(12, 1, 'بناب', 'Bonab', '37.34366720', '46.02642720'),
(13, 1, 'باسمنج', 'Basmenj', '38.00133160', '46.44624690'),
(14, 1, 'تبریز', 'Tabriz', '38.08055550', '46.15364130'),
(15, 1, 'خسروشاه', 'Khosrowshah', '37.96330460', '46.01503310'),
(16, 1, 'سردرود', 'Sardroud', '38.03123850', '46.12973630'),
(17, 1, 'جلفا', 'Jolfa', '38.81616850', '45.63339480'),
(18, 1, 'سیه رود', 'Siahrood', '38.86877450', '45.99665520'),
(19, 1, 'هادیشهر', 'Hadishahr', '38.82833100', '45.62179980'),
(20, 1, 'قره آغاج', 'Qareh Aghaj', '37.12856190', '46.96478250'),
(21, 1, 'خمارلو', 'Khomarlu', '39.15455660', '47.02483170'),
(22, 1, 'دوزدوزان', 'Duzduzan', '37.94875740', '47.11409570'),
(23, 1, 'سراب', 'Sarab', '37.93997700', '47.51543730'),
(24, 1, 'شربیان', 'Sharabian', '37.88192420', '47.09549190'),
(25, 1, 'مهربان', 'Mehraban', '38.08148170', '47.12825770'),
(26, 1, 'تسوج', 'Tasuj', '38.31615040', '45.33654190'),
(27, 1, 'خامنه', 'Khamaneh', '38.18523560', '45.61308840'),
(28, 1, 'سیس', 'Sis', '38.19685870', '45.81075660'),
(29, 1, 'شبستر', 'Shabestar', '38.18273990', '45.68192460'),
(30, 1, 'شرفخانه', 'Sharafkhaneh', '38.17865710', '45.46786290'),
(31, 1, 'شندآباد', 'Shendabad', '38.14561010', '45.61905390'),
(32, 1, 'صوفیان', 'Soufian', '38.27831360', '45.97709660'),
(33, 1, 'کوزه کنان', 'Koozehkonan', '38.19320240', '45.54328630'),
(34, 1, 'وایقان', 'Vaighan', '38.12844590', '45.70490600'),
(35, 1, 'جوان قلعه', 'Javan Qala', '37.49714170', '45.97186080'),
(36, 1, 'عجب شیر', 'Ajabshir', '37.48258470', '45.87358460'),
(37, 1, 'آبش احمد', 'Abeshahmad', '39.04976740', '47.30755790'),
(38, 1, 'کلیبر', 'Kaleybar', '38.86672580', '47.02453120'),
(39, 1, 'خداجو', 'Kharajoo', '37.30978140', '46.52171360'),
(40, 1, 'مراغه', 'Maragheh', '37.38088190', '46.19068570'),
(41, 1, 'بناب مرند', 'Benab e Marand', '38.42810110', '45.90225220'),
(42, 1, 'زنوز', 'Zonouz', '38.58949510', '45.82614190'),
(43, 1, 'کشکسرای', 'Koshksaray', '38.45962010', '45.55695530'),
(44, 1, 'مرند', 'Marand', '38.42387830', '45.73307930'),
(45, 1, 'یامچی', 'Yamchi', '38.52447740', '45.63416480'),
(46, 1, 'لیلان', 'Leilan', '37.01165090', '46.19523520'),
(47, 1, 'مبارک شهر', 'Mobarak Abad', '37.18030400', '46.05071780'),
(48, 1, 'ملکان', 'Malekan', '37.14644750', '46.08625150'),
(49, 1, 'آقکند', 'Aqkend', '37.25776990', '48.06143040'),
(50, 1, 'اچاچی', 'Achachi', '37.39543380', '47.79039870'),
(51, 1, 'ترک', 'Tark', '37.61736710', '47.76673070'),
(52, 1, 'ترکمانچای', 'Turkman Chay', '37.58178980', '47.37021430'),
(53, 1, 'میانه', 'Mianeh', '37.42728620', '47.69117780'),
(54, 1, 'خاروانا', 'Kharvana', '38.68560950', '46.15987300'),
(55, 1, 'ورزقان', 'Varzeqān', '38.58136590', '46.17000800'),
(56, 1, 'بخشایش', 'Bakhshāyesh', '38.13113810', '46.93808910'),
(57, 1, 'خواجه', 'Khaje', '38.15275670', '46.58237460'),
(58, 1, 'زرنق', 'Zarnaq', '38.09240870', '47.07680230'),
(59, 1, 'کلوانق', 'Kelvanaq', '38.10249790', '46.98483460'),
(60, 1, 'هریس', 'Heris', '38.24952090', '47.10787290'),
(61, 1, 'نظر کهریزی', 'Nazarkahrizi', '37.34737060', '46.75960420'),
(62, 1, 'هشترود', 'Hashtrood', '37.47750290', '47.03698730'),
(63, 2, 'ارومیه', 'Urmia', '37.55201030', '44.98662980'),
(64, 2, 'سرو', 'Serow', '37.72750000', '44.64277800'),
(65, 2, 'سیلوانه', 'Silvana', '37.42226160', '44.84996790'),
(66, 2, 'قوشچی', 'Qushchi', '37.98963410', '45.02705810'),
(67, 2, 'نوشین', 'Noshin', '37.73209770', '45.03828030'),
(68, 2, 'اشنویه', 'Oshnavieh', '37.03578700', '45.08183940'),
(69, 2, 'نالوس', 'Nalous', '36.98381150', '45.13960360'),
(70, 2, 'بوکان', 'Bukan', '36.52160280', '46.13030180'),
(71, 2, 'سیمینه', 'Simmineh', '36.72972200', '46.15111100'),
(72, 2, 'پلدشت', 'Poldasht', '39.34841750', '45.04958850'),
(73, 2, 'نازک علیا', 'Nazok-e Olya', '39.01023010', '45.05091900'),
(74, 2, 'پیرانشهر', 'Piranshahr', '36.69644210', '45.11104280'),
(75, 2, 'گردکشانه', 'Gerd Kashaneh', '36.81136290', '45.24764300'),
(76, 2, 'تکاب', 'Takab', '36.40080960', '47.07879720'),
(77, 2, 'آواجیق', 'Avajiq', '39.31388900', '44.16472200'),
(78, 2, 'سیه چشمه', 'Siah Cheshmeh', '39.06467800', '44.36944470'),
(79, 2, 'قره ضیاءالدین', 'Qarahziyaeddin', '38.89017830', '45.00811080'),
(80, 2, 'ایواوغلی', 'Evogli', '38.71139920', '45.19790410'),
(81, 2, 'خوی', 'Khoy', '38.54849230', '44.91661490'),
(82, 2, 'دیزج دیز', 'Dizaj Diz', '38.46128210', '45.00725250'),
(83, 2, 'زرآباد', 'Zurabad', '38.80220050', '44.57706910'),
(84, 2, 'فیرورق', 'Firuraq', '38.58061010', '44.84035480'),
(85, 2, 'قطور', 'Qotur', '38.46538040', '44.38811290'),
(86, 2, 'ربط', 'Rabat', '36.20833300', '45.55000000'),
(87, 2, 'سردشت', 'Sardasht', '36.16079500', '45.45807820'),
(88, 2, 'میرآباد', 'Mirabad', '36.40591310', '45.36209820'),
(89, 2, 'تازه شهر', 'Taze Shar', '38.17668750', '44.68377820'),
(90, 2, 'سلماس', 'Salmas', '38.20158900', '44.73173560'),
(91, 2, 'شاهین دژ', 'Shahin Dej', '36.67755380', '46.55053120'),
(92, 2, 'کشاورز', 'Keshavarz', '36.83486050', '46.35009520'),
(93, 2, 'محمودآباد', 'Mahmoodabad', '36.71413790', '46.49164870'),
(94, 2, 'شوط', 'Showt', '39.22094680', '44.74915970'),
(95, 2, 'مرگنلر', 'Marganlar', '39.14313890', '44.92987620'),
(96, 2, 'بازرگان', 'Bazargan', '39.39093260', '44.37321590'),
(97, 2, 'ماکو', 'Maku', '39.28785460', '44.46433000'),
(98, 2, 'خلیفان', 'Khalifan', '36.50681600', '45.79090840'),
(99, 2, 'مهاباد', 'Mahabad', '36.76604130', '45.69484370'),
(100, 2, 'باروق', 'Baruq', '36.95302880', '46.31413220'),
(101, 2, 'چهاربرج', 'Charburj', '37.12187920', '45.95898600'),
(102, 2, 'میاندوآب', 'Miandoab', '36.96620470', '46.07108060'),
(103, 2, 'محمدیار', 'Mohammadyar', '36.98351100', '45.51034930'),
(104, 2, 'نقده', 'Naqadeh', '36.95763840', '45.37065980'),
(105, 3, 'اردبیل', 'Ardabil', '38.26683090', '48.27099330'),
(106, 3, 'هیر', 'Hir', '38.07953040', '48.48940360'),
(107, 3, 'بیله سوار', 'Bileh Savar', '39.38055020', '48.32574100'),
(108, 3, 'جعفرآباد', 'Jafarabad', '39.42213160', '48.07888930'),
(109, 3, 'اسلام اباد', 'Eslāmābād', '38.13110480', '47.93918600'),
(110, 3, 'اصلاندوز', 'Aslan Duz', '39.44298680', '47.40042690'),
(111, 3, 'پارس آباد', 'Parsabad', '39.62802190', '47.86657270'),
(112, 3, 'تازه کند', 'Tazakand', '39.10450420', '44.89902010'),
(113, 3, 'خلخال', 'Khalkhal', '37.62210100', '48.50142000'),
(114, 3, 'کلور', 'Kolor', '37.38848590', '48.71668330'),
(115, 3, 'هشتجین', 'Hashjin', '37.36980870', '48.31333280'),
(116, 3, 'سرعین', 'Sarein', '38.14643470', '48.05716020'),
(117, 3, 'گیوی', 'Kivi', '37.69312310', '48.32075700'),
(118, 3, 'تازه کند اونگوت', 'Tazakand', '39.04374380', '47.73446910'),
(119, 3, 'گرمی', 'Germi', '38.99880110', '47.63427990'),
(120, 3, 'رضی', 'Razi', '38.62486600', '48.08286670'),
(121, 3, 'فخرآباد', 'Fakhrabad', '38.52260140', '47.85339830'),
(122, 3, 'قصابه', 'Qasabeh', '38.38781300', '47.53829230'),
(123, 3, 'لاهرود', 'Lahroud', '38.50801930', '47.82212370'),
(124, 3, 'مرادلو', 'Moradlu', '38.74800000', '47.74016620'),
(125, 3, 'مشگین شهر', 'Meshgin Shahr', '38.38632870', '47.63834890'),
(126, 3, 'آبی بیگلو', 'Abibeiglou', '38.28362000', '48.54482890'),
(127, 3, 'عنبران', 'Anbaran', '38.48843440', '48.41767760'),
(128, 3, 'نمین', 'Namin', '38.42350150', '48.46283910'),
(129, 3, 'کوراییم', 'Kuraim', '37.95500000', '48.23555600'),
(130, 3, 'نیر', 'Nir', '38.03338760', '47.99772250'),
(131, 4, 'آران وبیدگل', 'Aran va Bidgol', '34.05926830', '51.46047580'),
(132, 4, 'ابوزیدآباد', 'Abouzeidabad', '33.90165760', '51.74337370'),
(133, 4, 'سفیدشهر', 'Sefid Shahr', '34.12406120', '51.34705070'),
(134, 4, 'نوش آباد', 'Nushabad', '34.07957060', '51.42786020'),
(135, 4, 'اردستان', 'Ardestan', '33.38064560', '52.34307230'),
(136, 4, 'زواره', 'Zavareh', '33.44411680', '52.46542430'),
(137, 4, 'مهاباد', 'Mahabad', '33.52890960', '52.21336130'),
(138, 4, 'اژیه', 'Ezhieh', '32.44236700', '52.37182610'),
(139, 4, 'اصفهان', 'Isfahan', '32.66221110', '51.54694060'),
(140, 4, 'بهارستان', 'Baharestan', '32.48391000', '51.73393190'),
(141, 4, 'تودشک', 'Toodeshk', '32.72089190', '52.65622610'),
(142, 4, 'حسن اباد', 'Hassan Abad', '32.13927970', '52.62129300'),
(143, 4, 'زیار', 'Ziar', '32.51124460', '51.92680470'),
(144, 4, 'سجزی', 'Sejzi', '32.69866640', '52.06674040'),
(145, 4, 'قهجاورستان', 'Qahjavarestan', '32.70272036', '51.82802440'),
(146, 4, 'کوهپایه', 'Kuhpayeh', '32.70287470', '52.42220820'),
(147, 4, 'محمدآباد', 'Mohammad Abad', '32.31742670', '52.09172950'),
(148, 4, 'نصرآباد', 'Nasr Abad', '32.28016610', '52.05294370'),
(149, 4, 'نیک آباد', 'Nik Abad', '32.30380070', '52.18973630'),
(150, 4, 'ورزنه', 'Varzaneh', '32.41767450', '52.63817870'),
(151, 4, 'هرند', 'Harand', '32.57486500', '52.39937730'),
(152, 4, 'حبیب آباد', 'Habibabad', '32.83124240', '51.76599030'),
(153, 4, 'خورزوق', 'Khorzugh', '32.78003800', '51.62544240'),
(154, 4, 'دستگرد', 'Dastgerd', '32.80222710', '51.65711400'),
(155, 4, 'دولت آباد', 'Dolatabad', '32.80826470', '51.67975170'),
(156, 4, 'سین', 'Sin', '32.85028040', '51.64761890'),
(157, 4, 'شاپورآباد', 'Shapur Abad', '32.84337640', '51.73918970'),
(158, 4, 'کمشچه', 'Komshecheh', '32.90664920', '51.80178170'),
(159, 4, 'افوس', 'Afus', '33.02495550', '50.08812900'),
(160, 4, 'بویین و میاندشت', 'Buin va Miandasht', '33.07449490', '50.13231020'),
(161, 4, 'تیران', 'Tiran', '32.70383760', '51.13618590'),
(162, 4, 'رضوانشهر', 'Rezvanshahr', '32.66581050', '51.02359710'),
(163, 4, 'عسگران', 'Askaran', '32.86623280', '50.84719420'),
(164, 4, 'چادگان', 'Chadegan', '32.78079730', '50.54719210'),
(165, 4, 'رزوه', 'Rezveh', '32.83687710', '50.56521890'),
(166, 4, 'اصغرآباد', 'Asghar Abad', '32.65260910', '51.47119400'),
(167, 4, 'خمینی شهر', 'Khomeyni Shahr', '32.68329340', '51.48639620'),
(168, 4, 'درچه', 'Dorcheh', '32.61500960', '51.53461450'),
(169, 4, 'کوشک', 'Kooshk', '32.63866920', '51.49090280'),
(170, 4, 'خوانسار', 'Khansar', '33.26748190', '50.24871590'),
(171, 4, 'جندق', 'Jandaq', '34.04261310', '54.40511230'),
(172, 4, 'خور', 'Khur', '33.77630920', '55.07478460'),
(173, 4, 'فرخی', 'Farrokhi', '33.84195750', '54.94378560'),
(174, 4, 'دهاقان', 'Dehaghan', '31.93724900', '51.64522640'),
(175, 4, 'گلشن', 'Golshan', '31.92651440', '51.72279540'),
(176, 4, 'حنا', 'Hanna', '31.19744850', '51.71396600'),
(177, 4, 'سمیرم', 'Semirom', '31.39792330', '51.54441770'),
(178, 4, 'کمه', 'Komeh', '31.06320870', '51.58456560'),
(179, 4, 'ونک', 'Vanak', '31.52755750', '51.32147620'),
(180, 4, 'شاهین شهر', 'Shahin Shahr', '32.87811320', '51.48302510'),
(181, 4, 'گرگاب', 'Gorgab', '32.86625040', '51.58879270'),
(182, 4, 'گزبرخوار', 'Gazborkhar', '32.80222200', '51.62111100'),
(183, 4, 'لای بید', 'Laybid', '33.45682060', '50.68666930'),
(184, 4, 'میمه', 'Meymeh', '33.44504910', '51.16345880'),
(185, 4, 'وزوان', 'Vazvan', '33.41799110', '51.17397300'),
(186, 4, 'شهرضا', 'Shahreza', '31.99968770', '51.82877480'),
(187, 4, 'منظریه', 'Manzariyeh', '31.94638130', '51.87130450'),
(188, 4, 'داران', 'Daran', '32.98695730', '50.39163790'),
(189, 4, 'دامنه', 'Damaneh', '33.01758740', '50.47904490'),
(190, 4, 'برف انبار', 'Barf Anbar', '32.99523650', '50.17576210'),
(191, 4, 'فریدونشهر', 'Fereydun Shahr', '32.93718600', '50.12029390'),
(192, 4, 'ابریشم', 'Abrisham', '32.57323040', '51.55437450'),
(193, 4, 'ایمانشهر', 'Imanshahr', '32.48392420', '51.43493040'),
(194, 4, 'بهاران شهر', 'Baharan Shahr', '32.65097430', '51.72070930'),
(195, 4, 'پیربکران', 'Pir Bakran', '32.46747760', '51.53905380'),
(196, 4, 'زازران', 'Zazeran', '32.59599600', '51.48399340'),
(197, 4, 'فلاورجان', 'Falavarjan', '32.55578140', '51.48961530'),
(198, 4, 'قهدریجان', 'Ghahderijan', '32.56889540', '51.40953480'),
(199, 4, 'کلیشاد و سودرجان', 'Kelishad and Soderjaan', '32.55185850', '51.52158730'),
(200, 4, 'برزک', 'Barzok', '33.77699410', '51.19740420'),
(201, 4, 'جوشقان قالی', 'Josheqaneqali', '33.55601380', '51.13534680'),
(202, 4, 'قمصر', 'Ghamsar', '33.74066420', '51.41000730'),
(203, 4, 'کاشان', 'Kashan', '33.98154900', '51.34271390'),
(204, 4, 'جوشقان وكامو', 'Jowsheqan va Kamu', '33.60000000', '51.23333300'),
(205, 4, 'مشکات', 'Mashkat', '34.18385200', '51.25709940'),
(206, 4, 'نیاسر', 'Niasar', '33.97745700', '51.14122850'),
(207, 4, 'گلپایگان', 'Golpayegan', '33.45724970', '50.23390160'),
(208, 4, 'گلشهر', 'Golshahr', '33.50595700', '50.45278070'),
(209, 4, 'گوگد', 'Googad', '33.47637670', '50.34423700'),
(210, 4, 'باغ بهادران', 'Baghbahadoran', '32.37872850', '51.18191240'),
(211, 4, 'باغشاد', 'Baghshad', '32.38226100', '51.22944130'),
(212, 4, 'چرمهین', 'Chermahin', '32.32433430', '51.14324500'),
(213, 4, 'چمگردان', 'Chamgordan', '32.39291670', '51.33082860'),
(214, 4, 'زاینده رود', 'Zayandehrod', '32.38257720', '51.25747000'),
(215, 4, 'زرین شهر', 'Zarinshahr', '32.41176360', '51.36318620'),
(216, 4, 'سده لنجان', 'Sedeh Lenjan', '32.37447790', '51.30912400'),
(217, 4, 'فولادشهر', 'Fooladshahr', '32.52549510', '51.29630090'),
(218, 4, 'ورنامخواست', 'Varnamkhast', '32.35522120', '51.37205960'),
(219, 4, 'دیزیچه', 'Diziche', '32.40433490', '51.48476550'),
(220, 4, 'زیباشهر', 'Zibashahr', '32.38680810', '51.54482590'),
(221, 4, 'طالخونچه', 'Talkhooncheh', '32.24999310', '51.51884030'),
(222, 4, 'کرکوند', 'Karkevand', '32.34227880', '51.43751610'),
(223, 4, 'مبارکه', 'Mobarakeh', '32.34952150', '51.47882160'),
(224, 4, 'مجلسی', 'Majlesi', '32.19536780', '51.48369300'),
(225, 4, 'انارک', 'Anarak', '33.30702060', '53.68767500'),
(226, 4, 'بافران', 'Bafrān', '32.83938320', '53.13662050'),
(227, 4, 'نایین', 'Naein', '32.86148940', '53.07443600'),
(228, 4, 'جوزدان', 'Jowzdan', '32.55601720', '51.35696400'),
(229, 4, 'دهق', 'Dehagh', '33.10728330', '50.93896840'),
(230, 4, 'علویجه', 'Alavijeh', '33.05169010', '51.05992540'),
(231, 4, 'کهریزسنگ', 'Kahrizsang', '32.63252520', '51.46807190'),
(232, 4, 'گلدشت', 'Goldasht', '32.62173270', '51.42737730'),
(233, 4, 'نجف آباد', 'Najafabad', '32.64416590', '51.31490650'),
(234, 4, 'بادرود', 'Badroud', '33.68939670', '51.99780820'),
(235, 4, 'خالدآباد', 'Khaled Abad', '33.70071610', '51.98288430'),
(236, 4, 'طرق رود', 'Tarq Rud', '33.34682690', '51.79114390'),
(237, 4, 'نطنز', 'Natanz', '33.50926440', '51.89392080'),
(238, 5, 'اشتهارد', 'Eshtehard', '35.72122790', '50.34824950'),
(239, 5, 'چهارباغ', 'Charbagh', '35.84060280', '50.83944800'),
(240, 5, 'شهرجدیدهشتگرد', 'Hashtgerd New City', '35.98327270', '50.68520960'),
(241, 5, 'کوهسار', 'Koohsar', '35.96242640', '50.77578280'),
(242, 5, 'گلسار', 'Golsar', '35.90777800', '50.78250000'),
(243, 5, 'هشتگرد', 'Hashtgerd', '35.96194400', '50.68000000'),
(244, 5, 'طالقان', 'Taleqan', '36.21424690', '50.50651640'),
(245, 5, 'فردیس', 'Fardis', '35.72472200', '50.98833300'),
(246, 5, 'مشکین دشت', 'Fardis', '35.72472200', '50.98833300'),
(247, 5, 'آسارا', 'Asara', '36.03913120', '51.19087090'),
(248, 5, 'کرج', 'Karaj', '35.81096890', '50.87729700'),
(249, 5, 'کمال شهر', 'Kamalshahr', '35.88239360', '50.84343850'),
(250, 5, 'گرمدره', 'Garmdareh', '35.75371760', '51.04707220'),
(251, 5, 'ماهدشت', 'Mahdasht', '35.72040800', '50.76636250'),
(252, 5, 'محمدشهر', 'Mohammad Shahr', '35.74468970', '50.87227770'),
(253, 5, 'تنکمان', 'Tankaman', '35.89154410', '50.60591340'),
(254, 5, 'نظرآباد', 'Nazarabad', '35.96767790', '50.56942410'),
(255, 6, 'آبدانان', 'Abdanan', '32.99354450', '47.40373120'),
(256, 6, 'سراب باغ', 'Sarabbagh', '32.89856040', '47.57032870'),
(257, 6, 'مورموری', 'Murmuri ', '32.72546810', '47.66744610'),
(258, 6, 'ایلام', 'Ilam', '33.63691930', '46.39649800'),
(259, 6, 'چوار', 'Chovar', '33.69522650', '46.29299630'),
(260, 6, 'ایوان', 'Eyvan', '33.82824890', '46.29031400'),
(261, 6, 'زرنه', 'Zarneh', '33.92863690', '46.17875560'),
(262, 6, 'بدره', 'Bedreh', '33.30662610', '47.02968120'),
(263, 6, 'آسمان آباد', 'Aseman Abad', '33.85182450', '46.44400060'),
(264, 6, 'بلاوه', 'Balavah Tareh', '33.66690070', '46.80243500'),
(265, 6, 'توحید', 'Tohid', '33.72550000', '47.06850000'),
(266, 6, 'سرابله', 'Sarableh', '33.76577730', '46.54643580'),
(267, 6, 'شباب', 'Shabab', '33.74878600', '46.63228510'),
(268, 6, 'دره شهر', 'Darreh Shahr', '33.14329670', '47.36806860'),
(269, 6, 'ماژین', 'Mazhin', '32.95297150', '47.78095720'),
(270, 6, 'پهله', 'Pahleh', '33.01059760', '46.87927360'),
(271, 6, 'دهلران', 'Dehloran', '32.69107090', '47.25262630'),
(272, 6, 'موسیان', 'Mousiyan', '32.51868160', '47.36810080'),
(273, 6, 'میمه', 'Maymeh', '33.22788250', '46.91291920'),
(274, 6, 'لومار', 'Loumar', '33.56787760', '46.80513740'),
(275, 6, 'ارکواز', 'Arkavaz', '33.38544050', '46.57578680'),
(276, 6, 'دلگشا', 'Delgosha', '33.40633120', '46.58975600'),
(277, 6, 'مهر', 'Mehr', '33.43694400', '46.46111100'),
(278, 6, 'صالح آباد', 'Saleh Abad', '33.47157940', '46.18184570'),
(279, 6, 'مهران', 'Mehran', '33.12167330', '46.15626800'),
(280, 7, 'بوشهر', 'Bandar Bushehr', '28.91090220', '50.83002130'),
(281, 7, 'چغادک', 'Choghadak', '28.98004950', '51.00757680'),
(282, 7, 'خارک', 'Kharg', '29.24059200', '50.27422810'),
(283, 7, 'عالی شهر', 'Alishahr', '28.93079290', '51.05608460'),
(284, 7, 'آباد', 'Abad', '29.02994140', '51.23435480'),
(285, 7, 'اهرم', 'Ahram', '28.88148350', '51.25673510'),
(286, 7, 'دلوار', 'Delvar', '28.75279600', '51.05192160'),
(287, 7, 'انارستان', 'Anarestan', '28.03242110', '52.05895180'),
(288, 7, 'جم', 'Jam', '27.81572560', '52.30998450'),
(289, 7, 'ریز', 'Riz', '28.05156760', '52.06435920'),
(290, 7, 'آب پخش', 'Ab Pakhsh', '29.36788550', '51.05140670'),
(291, 7, 'برازجان', 'Borazjan', '29.26868510', '51.18010940'),
(292, 7, 'بوشکان', 'Boshkan', '28.83166590', '51.69114580'),
(293, 7, 'تنگ ارم', 'Tang Eram', '29.15332260', '51.51832580'),
(294, 7, 'دالکی', 'Dalaki', '29.43023450', '51.28279560'),
(295, 7, 'سعد آباد', 'Sadabad', '29.38580150', '51.11174580'),
(296, 7, 'شبانکاره', 'Shaban Kareh', '29.47081580', '50.97548950'),
(297, 7, 'کلمه', 'Kalameh', '28.94047610', '51.45177470'),
(298, 7, 'وحدتیه', 'Vahdatiyeh', '29.48645140', '51.21830440'),
(299, 7, 'بادوله', 'Baduleh', '28.39721360', '51.49332760'),
(300, 7, 'خورموج', 'Khormoj', '28.64840690', '51.35095520'),
(301, 7, 'شنبه', 'Shonbeh', '28.39593970', '51.75433880'),
(302, 7, 'کاکی', 'Kaki', '28.34162750', '51.50626640'),
(303, 7, 'آبدان', 'Konar Torshan', '28.07801520', '51.74254250'),
(304, 7, 'بردخون', 'Bord Khun', '28.06421750', '51.47342790'),
(305, 7, 'بردستان', 'Bardestan', '27.87006400', '51.94125630'),
(306, 7, 'بندردیر', 'Dayyer', '27.84286870', '51.91832720'),
(307, 7, 'دوراهک', 'Dorahak', '27.94859620', '51.95292940'),
(308, 7, 'امام حسن', 'Imam Hassan', '29.84250000', '50.26305600'),
(309, 7, 'بندردیلم', 'Bandar Deylam', '30.06097110', '50.14617180'),
(310, 7, 'عسلویه', 'Asaluyeh', '27.47606400', '52.60389090'),
(311, 7, 'نخل تقی', 'Nakhl Taghi', '27.50035250', '52.57634380'),
(312, 7, 'بندرکنگان', 'Bandar-e Kangan', '27.83288720', '52.03707510'),
(313, 7, 'بنک', 'Banak', '27.86259810', '52.00103740'),
(314, 7, 'سیراف', 'BandarSiraf', '27.66442800', '52.32552030'),
(315, 7, 'بندرریگ', 'Bandar Rig', '29.48417390', '50.61869140'),
(316, 7, 'بندرگناوه', 'Bandar Ganaveh', '29.58385910', '50.47629770'),
(317, 8, 'احمد آباد مستوفي', 'Ahmadabad-E Mostowfi', '35.63518510', '51.20369200'),
(318, 8, 'اسلامشهر', 'Eslamshahr', '35.58260210', '51.12182160'),
(319, 8, 'چهاردانگه', 'Chahar Dangeh', '35.59615900', '51.31556500'),
(320, 8, 'صالحيه', 'salehie', '35.59992120', '51.28272270'),
(321, 8, 'گلستان', 'Golestan', '35.52074490', '51.17017500'),
(322, 8, 'نسيم شهر', 'Nasimshahr', '35.56385880', '51.13968360'),
(323, 8, 'پاکدشت', 'Pakdasht', '35.44498050', '51.61959670'),
(324, 8, 'شريف آباد', 'Sharifabad', '35.42731310', '51.76860800'),
(325, 8, 'فرون اباد', 'Ferunabad', '35.51456310', '51.61007320'),
(326, 8, 'بومهن', 'Bumehen', '35.73364600', '51.86812400'),
(327, 8, 'پرديس', 'Pardis', '35.74170100', '51.78080100'),
(328, 8, 'پيشوا', 'Pishva', '35.30778500', '51.73087200'),
(329, 8, 'تهران', 'Tehran', '35.68919800', '51.38897400'),
(330, 8, 'آبسرد', 'Absard', '35.62931440', '52.13407450'),
(331, 8, 'آبعلي', 'Abali', '35.76759600', '51.94129930'),
(332, 8, 'دماوند', 'Damavand', '35.70866150', '52.01006240'),
(333, 8, 'رودهن', 'Rudehen', '35.73381290', '51.89812650'),
(334, 8, 'کيلان', 'Kilan', '35.55267040', '52.11622180'),
(335, 8, 'پرند', 'Parand', '35.49026110', '50.91815410'),
(336, 8, 'رباطکريم', 'Robat Karim', '35.47523440', '51.04732930'),
(337, 8, 'نصيرشهر', 'Nasirshahr', '35.49031160', '51.13230230'),
(338, 8, 'باقرشهر', 'Baghershahr', '35.53356180', '51.39546910'),
(339, 8, 'حسن آباد', 'Hasanabad', '35.36952280', '51.22152310'),
(340, 8, 'شهرري', 'Shahr-e-Rey', '35.57258130', '51.42336480'),
(341, 8, 'کهريزک', 'Kahrizak', '35.51683940', '51.35078420'),
(342, 8, 'تجريش', 'Tajrish', '35.80464930', '51.43132060'),
(343, 8, 'شمشک', 'Shemshak', '36.01128670', '51.48654700'),
(344, 8, 'فشم', 'Fasham', '35.93172150', '51.51130900'),
(345, 8, 'لواسان', 'Lavasan', '35.82325020', '51.60526000'),
(346, 8, 'انديشه', 'Andisheh', '35.74689450', '51.26907350'),
(347, 8, 'باغستان', 'Baghestan', '35.64247090', '51.08020080'),
(348, 8, 'شاهدشهر', 'Shahedshahr', '35.57269240', '51.07882980'),
(349, 8, 'شهريار', 'Shahriar', '35.65918130', '51.00680910'),
(350, 8, 'صباشهر', 'Sabashahr', '35.58323760', '51.08146840'),
(351, 8, 'فردوسيه', 'Ferdosiye', '35.59729320', '51.02402630'),
(352, 8, 'وحيديه', 'Vahidieh', '35.60483460', '51.01625910'),
(353, 8, 'ارجمند', 'Arjmand', '35.81400170', '52.50353330'),
(354, 8, 'فيروزکوه', 'Firuzkuh', '35.75702810', '52.75562180'),
(355, 8, 'قدس', 'Qods', '35.71068740', '51.07910810'),
(356, 8, 'قرچک', 'Qarchak', '35.43705200', '51.55806530'),
(357, 8, 'صفادشت', 'Safadasht', '35.68448900', '50.82465800'),
(358, 8, 'ملارد', 'Malard', '35.67940860', '50.94568430'),
(359, 8, 'جوادآباد', 'Javadabad', '35.21020010', '51.67277520'),
(360, 8, 'ورامين', 'Varamin', '35.34487270', '51.60784650'),
(361, 9, 'اردل', 'Ardal', '32.00501060', '50.61478550'),
(362, 9, 'دشتک', 'Dashtak', '32.16260720', '50.44992680'),
(363, 9, 'سرخون', 'SarKhun', '31.74577700', '50.54092890'),
(364, 9, 'کاج', 'Kaj', '32.05868180', '50.57817940'),
(365, 9, 'بروجن', 'Boroujen', '31.97268680', '51.27156200'),
(366, 9, 'بلداجی', 'Boldaji', '31.93677560', '51.04458330'),
(367, 9, 'سفیددشت', 'Sefiddasht', '32.13223020', '51.17423050'),
(368, 9, 'فرادبنه', 'Faradonbeh', '32.00967370', '51.19972210'),
(369, 9, 'گندمان', 'Gandoman', '31.86348680', '51.13710870'),
(370, 9, 'نقنه', 'Naghneh', '31.93395290', '51.32190230'),
(371, 9, 'بن', 'Ben', '32.54250000', '50.74444400'),
(372, 9, 'وردنجان', 'Vardanjan ', '32.47903740', '50.75005520'),
(373, 9, 'سامان', 'Saman', '32.44862340', '50.90259780'),
(374, 9, 'سودجان', 'Sudejan', '32.52143210', '50.39623970'),
(375, 9, 'سورشجان', 'Sureshjan', '32.31709400', '50.67117690'),
(376, 9, 'شهرکرد', 'Shahrekord', '32.34130620', '50.82824660'),
(377, 9, 'طاقانک', 'Taqanak', '32.22333300', '50.83861100'),
(378, 9, 'فرخ شهر', 'Farrokhshahr', '32.27076050', '50.93707970'),
(379, 9, 'کیان', 'ShahrKian', '32.28446520', '50.88317860'),
(380, 9, 'نافچ', 'Nafch', '32.42311540', '50.77988140'),
(381, 9, 'هارونی', 'Haarooni', '32.39291700', '50.56652790'),
(382, 9, 'هفشجان', 'Hafshejan', '32.22555600', '50.79388900'),
(383, 9, 'باباحیدر', 'Babaheydar', '32.33058500', '50.45960420'),
(384, 9, 'پردنجان', 'Pordanjan', '32.25403890', '50.59079640'),
(385, 9, 'جونقان', 'Junqan', '32.15297870', '50.67785030'),
(386, 9, 'چلیچه', 'Choliche', '32.23196940', '50.62066420'),
(387, 9, 'فارسان', 'Farsan', '32.25665000', '50.55221540'),
(388, 9, 'گوجان', 'Gujan', '32.24561880', '50.54045680'),
(389, 9, 'بازفت', 'Bazoft', '32.20000000', '50.05000000'),
(390, 9, 'چلگرد', 'Chelgerd', '32.46261960', '50.12346200'),
(391, 9, 'صمصامی', 'Samsami', '32.16811120', '50.27090540'),
(392, 9, 'دستنا', 'Dastena', '32.05881780', '50.76100940'),
(393, 9, 'شلمزار', 'Shalamzar ', '32.04720560', '50.80899950'),
(394, 9, 'گهرو', 'Gahru', '32.00802020', '50.87719190'),
(395, 9, 'ناغان', 'Naghan', '31.93457630', '50.72042630'),
(396, 9, 'آلونی', 'Aluni', '31.55421910', '51.04972240'),
(397, 9, 'سردشت', 'Kal Geh-ye Sardasht', '31.39583300', '50.83583300'),
(398, 9, 'لردگان', 'Lordegan', '31.51862110', '50.78370680'),
(399, 9, 'مال خلیفه', 'Mal-e Khalifeh', '31.29168000', '51.25682120'),
(400, 9, 'منج', 'Menj', '31.48467380', '50.87308270'),
(401, 10, 'ارسک', 'Eresk', '33.70284870', '57.36251580'),
(402, 10, 'بشرویه', 'Boshrouyeh', '33.86371270', '57.40532390'),
(403, 10, 'بیرجند', 'Birjand', '32.87067490', '59.20690950'),
(404, 10, 'خوسف', 'Khusf', '32.78472970', '58.88036720'),
(405, 10, 'محمدشهر', 'Mohammad Shahr', '35.74475930', '50.87227770'),
(406, 10, 'اسدیه', 'Asadieh', '32.91389070', '60.01498450'),
(407, 10, 'طبس مسینا', 'Tabas Masina', '32.80770990', '60.21503440'),
(408, 10, 'قهستان', 'Ghohestan', '33.15183200', '59.69687450'),
(409, 10, 'گزیک', 'Gazik', '32.99991820', '60.21178420'),
(410, 10, 'حاجی آباد', 'Hajiabad', '33.60327070', '59.99037270'),
(411, 10, 'زهان', 'Zohaan', '33.42331970', '59.80727440'),
(412, 10, 'آیسک', 'Ayask', '33.88666690', '58.36903090'),
(413, 10, 'سرایان', 'Sarayan', '33.39278200', '57.76132510'),
(414, 10, 'سه قلعه', 'Seh Qaleh', '33.66052710', '58.39830620'),
(415, 10, 'سربیشه', 'Sarbishe', '32.49081810', '59.48763620'),
(416, 10, 'مود', 'Mud', '32.70890630', '59.51680120'),
(417, 10, 'دیهوک', 'Deyhuk', '33.29299580', '57.50437250'),
(418, 10, 'طبس', 'Tabas', '33.60960450', '56.91063830'),
(419, 10, 'عشق آباد', 'Eshqabad', '34.36694400', '56.93111100'),
(420, 10, 'اسلامیه', 'Eslamiyeh', '34.04555600', '58.22027800'),
(421, 10, 'فردوس', 'Ferdows', '34.01940280', '58.15411070'),
(422, 10, 'آرین شهر', 'Arian Shahr', '33.33146920', '59.22934410'),
(423, 10, 'اسفدن', 'Esfedan', '33.64611680', '59.77098940'),
(424, 10, 'خضری دشت بیاض', 'Khezri Dashtebayaz', '34.02110000', '58.80779740'),
(425, 10, 'قاین', 'Ghayen', '33.72482540', '59.14322310'),
(426, 10, 'نیمبلوک', 'Nimbolook', '33.91169420', '58.92362600'),
(427, 10, 'شوسف', 'Shusf', '31.80557260', '59.99816170'),
(428, 10, 'نهبندان', 'Nehbandan', '31.46578870', '59.16104840'),
(429, 11, 'باخرز', 'Bakharz', '34.99345750', '60.30584330'),
(430, 11, 'بجستان', 'Bajestan', '34.52359130', '58.13947610'),
(431, 11, 'یونسی', 'Yunesi', '34.80527800', '58.43750000'),
(432, 11, 'انابد', 'Anabad', '35.25017460', '57.80098200'),
(433, 11, 'بردسکن', 'Bardaskan', '35.26005310', '57.95704360'),
(434, 11, 'شهراباد', 'Shahrabad', '32.57384110', '50.99270600'),
(435, 11, 'شاندیز', 'Shandiz', '36.39505690', '59.29064860'),
(436, 11, 'طرقبه', 'Torghabeh', '36.31474250', '59.36767090'),
(437, 11, 'تایباد', 'Taybad', '34.74435930', '60.75448030'),
(438, 11, 'کاریز', 'Kariz', '34.81501620', '60.80636480'),
(439, 11, 'مشهدریزه', 'Mashhad Rizeh', '34.79567270', '60.49771780'),
(440, 11, 'احمداباد صولت', 'Ahmad-abad-e-Solat', '35.11510780', '60.68452830'),
(441, 11, 'تربت جام', 'Torbat-e-Jam', '35.23577360', '60.59668010'),
(442, 11, 'صالح آباد', 'Saleh Abad', '35.69056280', '61.08321190'),
(443, 11, 'نصرآباد', 'Nasrabad', '35.41792500', '60.30567170'),
(444, 11, 'نیل شهر', 'Nil Shahr', '35.12525790', '60.76576360'),
(445, 11, 'بایگ', 'Bayg', '35.37486070', '59.03061380'),
(446, 11, 'تربت حیدریه', 'Torbat Heydariyeh', '35.26417110', '59.18266230'),
(447, 11, 'رباط سنگ', 'Robat-e-Sang', '35.54844590', '59.18669700'),
(448, 11, 'کدکن', 'Kadkan', '35.58739560', '58.87465950'),
(449, 11, 'جغتای', 'Joghatay', '36.64066660', '57.06071360'),
(450, 11, 'نقاب', 'Neghab', '36.70291640', '57.39315730'),
(451, 11, 'چناران', 'Chenaran', '36.64126890', '59.10343590'),
(452, 11, 'گلبهار', 'Golbahar', '36.56365510', '59.13914620'),
(453, 11, 'گلمکان', 'Golmakan', '36.48252780', '59.15481090'),
(454, 11, 'خلیل آباد', 'Khalil Abad', '35.25366100', '58.27916620'),
(455, 11, 'کندر', 'Kondor', '35.21201740', '58.14243800'),
(456, 11, 'خواف', 'Khaf', '34.56989720', '60.09881910'),
(457, 11, 'سلامی', 'Salami', '34.74571990', '59.96912950'),
(458, 11, 'سنگان', 'Sangan', '34.40055260', '60.25382990'),
(459, 11, 'قاسم آباد', 'Qasemabad', '35.91017750', '58.57594740'),
(460, 11, 'نشتیفان', 'Nashtifan', '34.43473260', '60.15978070'),
(461, 11, 'سلطان آباد', 'Soltanabad', '36.14784690', '58.86142020'),
(462, 11, 'داورزن', 'Davarzan', '36.35346380', '56.87169310'),
(463, 11, 'چاپشلو', 'Chapeshlu', '37.35090120', '59.06953800'),
(464, 11, 'درگز', 'Dargaz', '37.44652000', '59.09023650'),
(465, 11, 'لطف آباد', 'Lotfabad', '36.17687250', '58.72503510'),
(466, 11, 'نوخندان', 'Nokhandan', '37.51838840', '58.98018830'),
(467, 11, 'جنگل', 'Jangal', '34.70746780', '59.20638620'),
(468, 11, 'رشتخوار', 'Rashtkhar', '34.97462940', '59.61447710'),
(469, 11, 'دولت آباد', 'Dowlat Abad', '35.28403960', '59.51311110'),
(470, 11, 'روداب', 'Rudab', '36.02367790', '57.30447290'),
(471, 11, 'سبزوار', 'Sabzevar', '36.23968030', '57.57385020'),
(472, 11, 'ششتمد', 'Sheshtamad', '35.96042890', '57.75027730'),
(473, 11, 'سرخس', 'Sarakhs', '36.53967070', '61.13981710'),
(474, 11, 'مزدآوند', 'Mazdavand', '36.15644920', '60.52641750'),
(475, 11, 'سفیدسنگ', 'Sefid Sang', '35.66218570', '60.08599370'),
(476, 11, 'فرهادگرد', 'Farhadgerd', '35.76448180', '59.72416880'),
(477, 11, 'فریمان', 'Fariman', '35.69956090', '59.83111500'),
(478, 11, 'قلندرآباد', 'Qalandarabad', '35.60053760', '59.93625620'),
(479, 11, 'فیروزه', 'Firouzeh', '36.28288760', '58.56768590'),
(480, 11, 'همت آباد', 'Hemmatabad', '36.29790420', '58.45773920'),
(481, 11, 'باجگیران', 'Bajgiran', '37.62134430', '58.41607690'),
(482, 11, 'قوچان', 'Quchan', '37.10970060', '58.42871690'),
(483, 11, 'ریوش', 'Rivash', '35.47893040', '58.43782410'),
(484, 11, 'کاشمر', 'Kashmar', '35.25401630', '58.42863980'),
(485, 11, 'شهرزو', 'Shahrezu', '36.74907150', '59.92741590'),
(486, 11, 'کلات', 'Kalat', '36.99706750', '59.73384600'),
(487, 11, 'بیدخت', 'Beydokht', '34.34779140', '58.74766210'),
(488, 11, 'کاخک', 'Kakhk', '34.14457510', '58.63607160'),
(489, 11, 'گناباد', 'Gonabad', '34.35098630', '58.66312920'),
(490, 11, 'رضویه', 'Razaviye', '36.20932450', '59.76103310'),
(491, 11, 'مشهد', 'Mashhad', '36.29781700', '59.43937330'),
(492, 11, 'ثامن', 'Samen', '36.42600420', '59.38201710'),
(493, 11, 'ملک آباد', 'Molkabad', '35.99376960', '59.56460930'),
(494, 11, 'شادمهر', 'Shadmehr', '35.17244870', '59.03391840'),
(495, 11, 'فیض آباد', 'Feyz Abad', '35.01822080', '58.76292930'),
(496, 11, 'بار', 'Bar', '36.49129220', '58.70953140'),
(497, 11, 'چکنه', 'Chakaneh', '36.81366450', '58.49726210'),
(498, 11, 'خرو', 'Kharv', '36.15200430', '58.98408620'),
(499, 11, 'درود', 'Darrod', '36.13789110', '59.10554410'),
(500, 11, 'عشق آباد', 'Eshqabad', '36.04380680', '58.67441650'),
(501, 11, 'قدمگاه', 'Ghadamgah', '36.11175410', '59.04797300'),
(502, 11, 'نیشابور', 'Neyshabur', '36.23163280', '58.72165380'),
(503, 12, 'اسفراین', 'Esfarayen', '37.06338420', '57.47300090'),
(504, 12, 'صفی آباد', 'Safiabad', '36.69452330', '57.92146670'),
(505, 12, 'بجنورد', 'Bojnurd', '37.48420890', '57.25546170'),
(506, 12, 'چناران شهر', 'Chenaran Shahr', '37.46480280', '57.43791020'),
(507, 12, 'حصارگرمخان', 'Hesar-e Garmkhan', '37.51944400', '57.48250000'),
(508, 12, 'جاجرم', 'Jajarm', '36.96161010', '56.33044430'),
(509, 12, 'سنخواست', 'Sankhast', '37.10227080', '56.85038560'),
(510, 12, 'شوقان', 'Shoqan', '37.34160420', '56.87828070'),
(511, 12, 'راز', 'Raz', '37.93388900', '57.11250000'),
(512, 12, 'زیارت', 'Ziarat', '36.71608360', '58.54554170'),
(513, 12, 'شیروان', 'Shirvan', '37.40904730', '57.89747520'),
(514, 12, 'قوشخانه', 'Qushkhaneh', '37.74660970', '57.70606400'),
(515, 12, 'لوجلی', 'Lujali', '37.60805600', '57.85750000'),
(516, 12, 'تیتکانلو', 'Titkanlu', '37.22889760', '58.29700970'),
(517, 12, 'فاروج', 'Farooj', '37.18743970', '57.53594140'),
(518, 12, 'ایور', 'Ivar', '36.96991740', '56.25472080'),
(519, 12, 'درق', 'Daraq', '36.97032870', '56.20023960'),
(520, 12, 'گرمه', 'Garmeh', '36.98811280', '56.26396410'),
(521, 12, 'آشخانه', 'Ashkhaneh', '37.55917080', '56.90694800'),
(522, 12, 'آوا', 'Ava', '37.47722200', '56.74111100'),
(523, 12, 'پیش قلعه', 'Pish Ghaleh', '37.65006930', '56.98857310'),
(524, 12, 'قاضی', 'Qazi', '37.84754450', '57.31184360'),
(525, 13, 'آبادان', 'Abadan', '30.32758410', '48.25331100'),
(526, 13, 'اروندکنار', 'Arvand Kenar', '30.05886160', '48.43110310'),
(527, 13, 'چویبده', 'Chavibdeh', '30.20361100', '48.55388900'),
(528, 13, 'آغاجاری', 'Aghajari', '30.69847720', '49.79497370'),
(529, 13, 'امیدیه', 'Omidiyeh', '30.75768600', '49.67006900'),
(530, 13, 'جایزان', 'Jayezan', '30.87428460', '49.83620500'),
(531, 13, 'آبژدان', 'Abezhdan', '32.15000000', '49.40000000'),
(532, 13, 'قلعه خواجه', 'Qaleh-ye Khvajeh', '32.20524790', '49.44976320'),
(533, 13, 'آزادی', 'Azadi', '32.40362450', '48.24791910'),
(534, 13, 'اندیمشک', 'Andimeshk', '32.46179470', '48.31033020'),
(535, 13, 'بیدروبه', 'Bidrubeh-ye', '32.76095130', '48.22946550'),
(536, 13, 'چم گلک', 'Chamgolak', '32.44472130', '48.43590970'),
(537, 13, 'حسینیه', 'Hoseyniye', '32.67667910', '48.23694340'),
(538, 13, 'الهایی', 'Elhayi', '31.65388900', '48.59444400'),
(539, 13, 'اهواز', 'Ahvaz', '31.37506920', '48.53050670'),
(540, 13, 'ایذه', 'Izeh', '31.82509700', '49.84926210'),
(541, 13, 'دهدز', 'Dehdez', '31.70198800', '50.28124790'),
(542, 13, 'باغ ملک', 'Baghmalek', '31.52627310', '49.86389610'),
(543, 13, 'صیدون', 'Seydun', '31.36528970', '50.07061950'),
(544, 13, 'قلعه تل', 'Ghale Tol', '31.62757850', '49.86016210'),
(545, 13, 'میداود', 'Midavod', '31.39148800', '49.83969100'),
(546, 13, 'شیبان', 'Sheyban', '31.40816250', '48.78697870'),
(547, 13, 'ملاثانی', 'Mollasani', '31.58593640', '48.87006270'),
(548, 13, 'ویس', 'Veys', '31.48771080', '48.86967650'),
(549, 13, 'بندرامام خمینی', 'Bandar Imam Khomeini', '30.47897630', '49.00476180'),
(550, 13, 'بندرماهشهر', 'Bandar Mahshahr', '30.56303150', '49.14359410'),
(551, 13, 'چمران', 'Chamran Town', '30.70618820', '49.15299300'),
(552, 13, 'بهبهان', 'Behbahan', '30.59347310', '50.20715410'),
(553, 13, 'تشان', 'Tashan', '30.82916700', '50.19833300'),
(554, 13, 'سردشت', 'Sar Dasht', '30.32761920', '50.20910740'),
(555, 13, 'منصوریه', 'Mansuriyeh', '30.62827400', '50.29850000'),
(556, 13, 'حمیدیه', 'Hamidiyeh', '31.47475930', '48.41494540'),
(557, 13, 'خرمشهر', 'Khorramshahr', '30.41144550', '48.11874140'),
(558, 13, 'مقاومت', 'Moqavemat', '30.44583300', '48.17083300'),
(559, 13, 'مینوشهر', 'Minushahr', '30.34436130', '48.18489410'),
(560, 13, 'چغامیش', 'Choghamish', '32.20916700', '48.54611100'),
(561, 13, 'حمزه', 'Hanzeh', '32.39318880', '48.57371090'),
(562, 13, 'دزفول', 'Dezful', '32.40232870', '48.31778110'),
(563, 13, 'سالند', 'Sāland', '32.49901190', '48.82560250'),
(564, 13, 'سیاه منصور', 'SiahMansur', '32.33225340', '48.48953250'),
(565, 13, 'شمس آباد', 'Shamsabad', '32.29616570', '48.42367890'),
(566, 13, 'شهر امام', 'Imam', '32.22777680', '48.41621160'),
(567, 13, 'صفی آباد', 'Safiabad', '32.26002660', '48.40730660'),
(568, 13, 'میانرود', 'Mianrood', '32.15313320', '48.43118900'),
(569, 13, 'ابوحمیظه', 'Abou Homeyzeh', '31.52809530', '48.21535710'),
(570, 13, 'بستان', 'Bostan', '31.71577230', '47.97680280'),
(571, 13, 'سوسنگرد', 'Susangerd', '31.55538610', '48.16843960'),
(572, 13, 'کوت سیدنعیم', 'Kut-e Seyyed Naim', '31.46138900', '48.37833300'),
(573, 13, 'رامشیر', 'Ramshir', '30.89172660', '49.39161280'),
(574, 13, 'مشراگه', 'Moshrageh', '31.01056150', '49.43022070'),
(575, 13, 'رامهرمز', 'Ramhormoz', '31.27524110', '49.57374510'),
(576, 13, 'خنافره', 'Khorusi-ye Jonubi', '30.61666700', '48.61666700'),
(577, 13, 'دارخوین', 'Darkhovin', '30.74371380', '48.41850740'),
(578, 13, 'شادگان', 'Shadegan', '30.65190240', '48.63698940'),
(579, 13, 'الوان', 'Alvan', '32.11138900', '48.46000000'),
(580, 13, 'حر', 'Horr', '32.14472200', '48.39250000'),
(581, 13, 'شاوور', 'Hosseinabad ', '32.05847040', '48.29463110'),
(582, 13, 'شوش', 'Shooshtar', '32.04102720', '48.79976690'),
(583, 13, 'فتح المبین', 'FatholMobin', '32.42388900', '47.81000000'),
(584, 13, 'سرداران', 'Sardarabad', '32.02138900', '48.79277800'),
(585, 13, 'شرافت', 'Sherafat', '32.08775530', '48.75856870'),
(586, 13, 'شوشتر', 'Shooshtar', '32.04102720', '48.79976690'),
(587, 13, 'گوریه', 'Guriyeh', '31.85694400', '48.75666700'),
(588, 13, 'کوت عبداله', 'Kut Abdollah', '31.23525860', '48.64282600'),
(589, 13, 'ترکالکی', 'Torkalaki', '32.24128960', '48.83882040'),
(590, 13, 'جنت مکان', 'Jannat Makan', '32.18523730', '48.80457390'),
(591, 13, 'سماله', 'Semaleh', '32.19756680', '48.85203840'),
(592, 13, 'صالح شهر', 'Salehshahr', '32.21427110', '48.66241680'),
(593, 13, 'گتوند', 'Gotvand', '32.24520520', '48.76513420'),
(594, 13, 'لالی', 'Lali', '32.32931580', '49.08755770'),
(595, 13, 'گلگیر', 'Golgir', '31.96470000', '49.28560000'),
(596, 13, 'مسجدسلیمان', 'Masjed Soleyman', '31.95157490', '49.21942580'),
(597, 13, 'هفتگل', 'Haftkel', '31.45494850', '49.50872880'),
(598, 13, 'زهره', 'Zahreh', '30.46916700', '49.68444400'),
(599, 13, 'هندیجان', 'Hendijan', '30.23448540', '49.69240650'),
(600, 13, 'رفیع', 'Rofayyeh', '31.59772720', '47.88532740'),
(601, 13, 'هویزه', 'Hoveyzeh', '31.46547330', '48.06143040'),
(602, 14, 'ابهر', 'Abhar', '36.15122570', '49.19924440'),
(603, 14, 'صایین قلعه', 'Sain Qaleh', '36.30295080', '49.06384700'),
(604, 14, 'هیدج', 'Hidaj', '36.25513060', '49.12132140'),
(605, 14, 'حلب', 'Halab', '36.29550690', '48.05917740'),
(606, 14, 'زرین آباد', 'Zarrin Abad', '36.42352420', '48.24708800'),
(607, 14, 'زرین رود', 'Zarrin Rood', '35.75856190', '48.47152940'),
(608, 14, 'سجاس', 'Sojas', '36.23940950', '48.54545110'),
(609, 14, 'سهرورد', 'Sohrevard', '36.07305320', '48.43168260'),
(610, 14, 'قیدار', 'Qeydar', '36.12227140', '48.57544890'),
(611, 14, 'کرسف', 'Karasf', '36.04488260', '48.49918840'),
(612, 14, 'گرماب', 'Garmaab', '35.84896910', '48.19004780'),
(613, 14, 'نوربهار', 'Nurbahar', '35.93777800', '48.79472200'),
(614, 14, 'خرمدره', 'Khorramdarreh', '36.21196440', '49.16467600'),
(615, 14, 'ارمغانخانه', 'Armaqankhaneh', '36.97756320', '48.36331840'),
(616, 14, 'زنجان', 'Zanjan', '36.68113770', '48.42318300'),
(617, 14, 'نیک پی', 'Nik Pey', '36.84951730', '48.17332150'),
(618, 14, 'سلطانیه', 'Soltanieh', '36.43486910', '48.78414630'),
(619, 14, 'آب بر', 'Abbar', '36.92958670', '48.93254920'),
(620, 14, 'چورزق', 'Chavarzagh', '36.99800550', '48.77238060'),
(621, 14, 'دندی', 'Dandi', '36.54939420', '47.59371740'),
(622, 14, 'ماه نشان', 'Mahneshan', '36.74263210', '47.66291850'),
(623, 15, 'آرادان', 'Aradan', '35.24814880', '52.48640420'),
(624, 15, 'کهن آباد', 'Kohanabad', '35.22133420', '52.51071700'),
(625, 15, 'امیریه', 'Amiriyeh', '36.02872950', '54.13541820'),
(626, 15, 'دامغان', 'Damghan', '36.16451830', '54.32451710'),
(627, 15, 'دیباج', 'Dibaj', '36.42948280', '54.21929960'),
(628, 15, 'کلاته', 'Kalāteh', '36.35553790', '54.13633340'),
(629, 15, 'سرخه', 'Sorkheh', '35.46800540', '53.20981120'),
(630, 15, 'سمنان', 'Semnan', '35.57773950', '53.34909380'),
(631, 15, 'بسطام', 'Bastam', '36.48439080', '54.99071350'),
(632, 15, 'بیارجمند', 'Biyārjomand', '36.08175860', '55.79998970'),
(633, 15, 'رودیان', 'Rodian', '36.35044740', '55.00128350'),
(634, 15, 'شاهرود', 'Shahroud', '36.40570750', '54.93884820'),
(635, 15, 'کلاته خیج', 'kalāte Khij', '36.67242800', '55.29090640'),
(636, 15, 'مجن', 'Mojen', '36.47922350', '54.63925840'),
(637, 15, 'ایوانکی', 'Eyvanekey', '35.34445670', '52.06075470'),
(638, 15, 'گرمسار', 'Garmsar', '35.20287840', '52.30485560'),
(639, 15, 'درجزین', 'Darjazin', '35.62847530', '53.30819540'),
(640, 15, 'شهمیرزاد', 'Shahmirzad', '35.77010410', '53.31802350'),
(641, 15, 'مهدی شهر', 'Mahdi Shahr', '35.70734520', '53.25079440'),
(642, 15, 'میامی', 'Mayamey', '36.41200920', '55.64133160'),
(643, 16, 'ایرانشهر', 'Iranshahr', '27.21695840', '60.63779300'),
(644, 16, 'بزمان', 'Bazmān', '27.85550560', '60.16714090'),
(645, 16, 'بمپور', 'Bampour', '27.19519200', '60.44720640'),
(646, 16, 'محمدان', 'Mohamadan', '27.20214490', '60.54998870'),
(647, 16, 'چابهار', 'Chabahar', '25.31083140', '60.61017690'),
(648, 16, 'نگور', 'Negour', '25.38974400', '61.13295070'),
(649, 16, 'خاش', 'Khash', '28.22272550', '61.15484910'),
(650, 16, 'نوک آباد', 'Noukābād', '28.54068480', '60.75332160'),
(651, 16, 'گلمورتی', 'Golmorti', '27.48143280', '59.43818080'),
(652, 16, 'بنجار', 'Bonjār', '31.03910860', '61.55765160'),
(653, 16, 'زابل', 'Zabol', '31.04012210', '61.42831310'),
(654, 16, 'زاهدان', 'Zahedan', '29.48308140', '60.80497160'),
(655, 16, 'نصرت آباد', 'Nosrat Abad', '29.85348390', '59.95762810'),
(656, 16, 'زهک', 'Zahak', '30.89135860', '61.66544420'),
(657, 16, 'جالق', 'Jālq', '27.59661720', '62.68275240'),
(658, 16, 'سراوان', 'Saravan', '27.35053220', '62.28381560'),
(659, 16, 'سیرکان', 'Sirkān', '26.82839760', '62.63013830'),
(660, 16, 'گشت', 'Gosht', '27.78433780', '61.92705620'),
(661, 16, 'محمدی', 'Mohammadi', '27.33196300', '62.38783200'),
(662, 16, 'پیشین', 'Pishin', '26.08308740', '61.68561400'),
(663, 16, 'راسک', 'Rāsk', '26.24159410', '61.38488520'),
(664, 16, 'سرباز', 'Sarbaz', '26.63234450', '61.24955180'),
(665, 16, 'سوران', 'Suran', '27.28758420', '61.98044280'),
(666, 16, 'هیدوچ', 'Hidouj', '27.00415440', '62.10665690'),
(667, 16, 'فنوج', 'Fanouj', '26.57336520', '59.62992650'),
(668, 16, 'قصرقند', 'Qasr-e-qand', '26.22711380', '60.71461140'),
(669, 16, 'زرآباد', 'Zarābād', '25.58250060', '59.37785270'),
(670, 16, 'کنارک', 'Konarak', '25.73426710', '59.31003690'),
(671, 16, 'مهرستان', 'Zaboli', '27.13388980', '61.65462950'),
(672, 16, 'میرجاوه', 'Mirjaveh', '29.01806600', '61.43216230'),
(673, 16, 'اسپکه', 'Espakeh', '26.83722420', '60.16413690'),
(674, 16, 'بنت', 'Bent', '26.28883260', '59.50624450'),
(675, 16, 'نیک شهر', 'Nikshahr', '26.23213310', '60.21774860'),
(676, 16, 'ادیمی', 'Adimi', '31.11497090', '61.39258850'),
(677, 16, 'شهرک علی اکبر', 'Hamoon', '30.94034720', '61.31965400'),
(678, 16, 'محمدآباد', 'Mohammadābād', '30.88253960', '61.45724050'),
(679, 16, 'دوست محمد', 'Dust Mohammad', '31.14661850', '61.77382690'),
(680, 17, 'آباده', 'Abadeh', '31.16117410', '52.61279520'),
(681, 17, 'ایزدخواست', 'IzadKhast', '31.51636070', '52.11609370'),
(682, 17, 'بهمن', 'Bahman', '31.19345630', '52.47589580'),
(683, 17, 'سورمق', 'Surmaq', '31.03248980', '52.83048390'),
(684, 17, 'صغاد', 'Soghad', '31.19106770', '52.50031460'),
(685, 17, 'ارسنجان', 'Arsenjan', '29.91892820', '53.28291870'),
(686, 17, 'استهبان', 'Estahban', '29.12827840', '54.00042000'),
(687, 17, 'ایج', 'Eij', '29.02248840', '54.23737580'),
(688, 17, 'رونیز', 'RonizOlya', '29.19133810', '53.76483680'),
(689, 17, 'اقلید', 'Eqlid', '30.90139930', '52.65279230'),
(690, 17, 'حسن اباد', 'HasanAbad', '30.52016170', '52.45160570'),
(691, 17, 'دژکرد', 'Dezhkord', '30.72281950', '51.95147040'),
(692, 17, 'سده', 'Sedeh', '30.70291140', '52.15963050'),
(693, 17, 'بوانات', 'Bavanat', '30.48645770', '53.58721010'),
(694, 17, 'حسامی', 'Hesami', '29.96975010', '53.86682510'),
(695, 17, 'کره ای', 'Korei', '30.03036720', '53.70883220'),
(696, 17, 'مزایجان', 'Mazayejan', '28.05616020', '54.65025550'),
(697, 17, 'سعادت شهر', 'SaadatShahr', '30.08246270', '53.12756530'),
(698, 17, 'مادرسلیمان', 'Pasargad', '30.19138470', '53.17207930'),
(699, 17, 'باب انار', 'BabAnar', '28.96416700', '53.21638900'),
(700, 17, 'جهرم', 'Jahrom', '28.53058250', '53.51852170'),
(701, 17, 'خاوران', 'Khavaran', '28.93684290', '53.31201550'),
(702, 17, 'دوزه', 'Douzeh', '28.70131620', '52.95476670'),
(703, 17, 'قطب آباد', 'QotbAbad', '28.64848720', '53.61144090'),
(704, 17, 'خرامه', 'Kharameh', '29.50038570', '53.30107210'),
(705, 17, 'سلطان شهر', 'SoltanShahr', '29.62961460', '53.23294400'),
(706, 17, 'صفاشهر', 'Safashahr', '30.61431720', '53.17833400'),
(707, 17, 'قادراباد', 'Qaderabad', '30.27834010', '53.25756670'),
(708, 17, 'خنج', 'Khonj', '27.88763700', '53.41157890'),
(709, 17, 'جنت شهر', 'JannatShahr', '28.65398340', '54.67042500'),
(710, 17, 'داراب', 'Darab', '28.75162410', '54.50918140'),
(711, 17, 'دوبرجی', 'DoBorji', '28.30666700', '55.19277800'),
(712, 17, 'فدامی', 'Fadami ', '28.21409230', '55.11737800'),
(713, 17, 'کوپن', 'Kopen', '30.33500890', '51.27854700'),
(714, 17, 'مصیری', 'Masiri', '30.24094560', '51.52066790'),
(715, 17, 'حاجی آباد', 'HajiAbad', '29.65540700', '52.31150870'),
(716, 17, 'دبیران', 'Dabiran', '28.40752830', '54.16883220'),
(717, 17, 'شهرپیر', 'PirCity', '28.31454240', '54.31413150'),
(718, 17, 'اردکان', 'Sepidan', '30.20333330', '51.89679890'),
(719, 17, 'بیضا', 'Beyza', '29.97198120', '52.39688860'),
(720, 17, 'هماشهر', 'Hamashahr', '30.11166700', '52.08277800'),
(721, 17, 'سروستان', 'سروستان', '29.27022530', '53.20730190'),
(722, 17, 'کوهنجان', 'Kouhenjan', '29.23156770', '52.95320030'),
(723, 17, 'خانه زنیان', 'KhaneZenian', '29.67004760', '52.14333620'),
(724, 17, 'داریان', 'Dariun', '29.56255730', '52.91882510'),
(725, 17, 'زرقان', 'Zarghan', '29.76307670', '52.67474350'),
(726, 17, 'شهرصدرا', 'Sadra', '29.80475780', '52.45825710'),
(727, 17, 'شیراز', 'Shiraz', '29.66550160', '52.39293040'),
(728, 17, 'لپویی', 'Lapouyee', '29.79964990', '52.64236450'),
(729, 17, 'دهرم', 'Dehram', '28.49124870', '52.29977130'),
(730, 17, 'فراشبند', 'Farashband', '28.85052890', '52.06103260'),
(731, 17, 'نوجین', 'Nowjein', '29.11848470', '51.98232590'),
(732, 17, 'زاهدشهر', 'Zahedshahr', '28.75180650', '53.78289130'),
(733, 17, 'ششده', 'Sheshdeh', '28.91250530', '53.99227100'),
(734, 17, 'فسا', 'Fasa', '28.94873550', '53.59920430'),
(735, 17, 'قره بلاغ', 'Ghare Bolagh', '28.92810000', '54.05090000'),
(736, 17, 'میانشهر', 'Miyanshahr', '28.71017970', '53.85154720'),
(737, 17, 'نوبندگان', 'No Bandegan', '28.85591230', '53.81496180'),
(738, 17, 'فیروزآباد', 'Firuzabad', '28.84481480', '52.52845030'),
(739, 17, 'میمند', 'Meymand', '28.86776870', '52.73594130'),
(740, 17, 'افزر', 'Efzar', '28.34636970', '52.96109670'),
(741, 17, 'امام شهر', 'Emam Shahr', '28.44682660', '53.14627650'),
(742, 17, 'قیر', 'Ghirokarzin', '28.33638090', '52.66841600'),
(743, 17, 'کارزین (فتح آباد)', 'Karzin', '28.43324410', '53.12390410'),
(744, 17, 'مبارک آباددیز', 'Mobarakabad', '28.35972200', '53.32833300'),
(745, 17, 'بالاده', 'Baladeh ', '29.28302900', '51.92782400'),
(746, 17, 'خشت', 'Khesht', '27.23347270', '53.43067650'),
(747, 17, 'قایمیه', 'Qaemyeh', '29.85091920', '51.57323570'),
(748, 17, 'کازرون', 'City Kazeroon', '29.62712330', '51.64962760'),
(749, 17, 'کنارتخته', 'Konartakhteh', '29.52510620', '51.37342200'),
(750, 17, 'نودان', 'Nowdan', '29.80119540', '51.68421500'),
(751, 17, 'کوار', 'Kavar', '29.21182160', '52.65026020'),
(752, 17, 'گراش', 'Gerash', '27.67498060', '54.07586310'),
(753, 17, 'اوز', 'Evaz', '27.76295710', '53.97943440'),
(754, 17, 'بنارویه', 'Banaruyeh', '28.08653670', '54.03974940'),
(755, 17, 'بیرم', 'Beyram', '27.43173640', '53.50586420'),
(756, 17, 'جویم', 'Juyom', '28.25891410', '53.96016580'),
(757, 17, 'خور', 'Khour', '27.64191680', '54.33750230'),
(758, 17, 'عمادده', 'Emad Deh', '27.44620970', '53.85212660'),
(759, 17, 'لار', 'Lar', '27.66873030', '54.24684520'),
(760, 17, 'لطیفی', 'Latifi', '27.69024090', '54.37713040'),
(761, 17, 'اشکنان', 'Ashkanan', '27.23524440', '53.58667360'),
(762, 17, 'اهل', 'Ahel', '27.21120460', '53.65720510'),
(763, 17, 'علامرودشت', 'Alamarvdasht', '27.62517770', '52.99113750'),
(764, 17, 'لامرد', 'Lamerd', '27.34138050', '53.15432240'),
(765, 17, 'خانیمن', 'Khaniman', '30.34916700', '52.24166700'),
(766, 17, 'رامجرد', 'Koushkak', '30.07373620', '52.58820540'),
(767, 17, 'سیدان', 'Seyedan', '30.00424490', '53.00122260'),
(768, 17, 'کامفیروز', 'Kamfiruz', '30.32309970', '52.18398570'),
(769, 17, 'مرودشت', 'Marvdasht', '29.89027800', '52.78295460'),
(770, 17, 'بابامنیر', 'Baba Monir', '30.07159140', '51.20029090'),
(771, 17, 'خومه زار', 'Khoome Zar', '30.00924290', '51.56660550'),
(772, 17, 'نورآباد', 'Nourabad', '30.11349310', '51.50369100'),
(773, 17, 'اسیر', 'Asir', '27.72481010', '52.66111850'),
(774, 17, 'خوزی', 'Khoozi', '27.44610520', '52.96075340'),
(775, 17, 'گله دار', 'Galehdar', '27.65744580', '52.62983260'),
(776, 17, 'مهر', 'Mohr', '27.55165440', '52.87217620'),
(777, 17, 'وراوی', 'Varavi', '27.46528850', '53.04411650'),
(778, 17, 'آباده طشک', 'Abadeh Tashk', '29.80720880', '53.72005450'),
(779, 17, 'قطرویه', 'Qatruyeh', '29.14584570', '54.69936130'),
(780, 17, 'مشکان', 'Meshkan', '29.47403030', '54.32865840'),
(781, 17, 'نی ریز', 'Neyriz', '29.19041050', '54.28615020'),
(782, 18, 'آبیک', 'Abyek', '36.04711650', '50.51818350'),
(783, 18, 'خاکعلی', 'Khakali', '36.12998890', '50.16708250'),
(784, 18, 'آبگرم', 'Abgarm', '35.75687280', '49.27735090'),
(785, 18, 'آوج', 'Avaj', '35.57771830', '49.21200160'),
(786, 18, 'الوند', 'Alvand', '36.18772950', '50.04088980'),
(787, 18, 'بیدستان', 'Bidestan', '36.23084220', '50.11218300'),
(788, 18, 'شریفیه', 'Sharif Abad', '36.21499430', '50.14273880'),
(789, 18, 'محمدیه', 'Mohammadiyeh ', '36.22255030', '50.17574060'),
(790, 18, 'ارداق', 'Ardagh', '36.05144880', '49.81499430'),
(791, 18, 'بویین زهرا', 'Buin Zahra', '35.76549910', '50.04231670'),
(792, 18, 'دانسفهان', 'Danesfahan', '35.81572280', '49.72441600'),
(793, 18, 'سگزآباد', 'Sagz Abad', '35.76612540', '49.91882790'),
(794, 18, 'شال', 'Shal', '35.89536650', '49.75102890'),
(795, 18, 'اسفرورین', 'Esfarvarin', '35.93684050', '49.74017140'),
(796, 18, 'تاکستان', 'Takestan', '36.07076890', '49.66090630'),
(797, 18, 'خرمدشت', 'Khorramdasht', '35.92802320', '49.50336460'),
(798, 18, 'ضیاڈآباد', 'Ziaabad', '35.99333300', '49.44777800'),
(799, 18, 'نرجه', 'Narjeh', '35.99594070', '49.61054550'),
(800, 18, 'اقبالیه', 'Eqbaliyeh', '36.22817470', '49.90673640'),
(801, 18, 'رازمیان', 'Razmian', '36.54202690', '50.19838920'),
(802, 18, 'سیردان', 'Sirdan', '36.64732350', '49.18877350'),
(803, 18, 'قزوین', 'Qazvin', '36.28119970', '49.94664560'),
(804, 18, 'کوهین', 'Kouhin', '36.37223830', '49.64941610'),
(805, 18, 'محمودآبادنمونه', 'Mahmood Abad nemooneh', '36.29230710', '49.88979310'),
(806, 18, 'معلم کلایه', 'Moallem Kelayeh', '36.44809600', '50.46780100'),
(807, 19, 'جعفریه', 'Jafarie', '34.77450740', '50.50651060'),
(808, 19, 'دستجرد', 'Dastjerd', '34.55380730', '50.23906220'),
(809, 19, 'سلفچگان', 'Salafchegan', '34.47660600', '50.45501230'),
(810, 19, 'قم', 'Qom', '34.68878450', '50.71197920'),
(811, 19, 'قنوات', 'Qanavat', '34.61233580', '51.01366270'),
(812, 19, 'کهک', 'Kahak', '34.39196580', '50.85463990'),
(813, 20, 'آرمرده', 'Armardeh', '35.93224610', '45.79138040'),
(814, 20, 'بانه', 'Baneh', '35.99451430', '45.87030150'),
(815, 20, 'بویین سفلی', 'Boeen-e-Sofla', '35.93821400', '45.93237870'),
(816, 20, 'کانی سور', 'Kani Sur', '36.21481320', '46.81190730'),
(817, 20, 'بابارشانی', 'Babarashani', '35.67817150', '47.79385330'),
(818, 20, 'بیجار', 'Bijar', '35.87277370', '47.58062820'),
(819, 20, 'پیرتاج', 'Pir Taj', '35.77629810', '48.11167520'),
(820, 20, 'توپ آغاج', 'Tup Aghaj', '36.04829630', '47.81754160'),
(821, 20, 'یاسوکند', 'Hasanabad Yasukand', '36.28383610', '47.73750810'),
(822, 20, 'بلبان آباد', 'Bolbanabad ', '35.13864820', '47.30808610'),
(823, 20, 'دهگلان', 'Dehgolan', '35.27980040', '47.41116640'),
(824, 20, 'دیواندره', 'Divandarreh', '35.91590130', '47.00809460'),
(825, 20, 'زرینه', 'Zarrineh ', '36.06053080', '46.91183560');
INSERT INTO `cities` (`id`, `province_id`, `name`, `en_name`, `latitude`, `longitude`) VALUES
(826, 20, 'اورامان تخت', 'Uraman Takht', '35.25282120', '46.25915770'),
(827, 20, 'سروآباد', 'Sarvabad', '35.30955630', '46.35754110'),
(828, 20, 'سقز', 'Saqqez', '36.24118260', '46.24295650'),
(829, 20, 'صاحب', 'Saheb', '36.20290110', '46.45328510'),
(830, 20, 'سنندج', 'Sanandaj', '35.28996860', '46.93934200'),
(831, 20, 'شویشه', 'Shuyesheh', '35.35699600', '46.67322630'),
(832, 20, 'دزج', 'Dezej', '35.06467320', '47.95909890'),
(833, 20, 'دلبران', 'Delbaran', '35.23720820', '47.97538320'),
(834, 20, 'سریش آباد', 'Serish Abad', '35.24963130', '47.76967040'),
(835, 20, 'قروه', 'Qorveh', '35.16587540', '47.79007660'),
(836, 20, 'کامیاران', 'Kamyaran', '34.79666550', '46.92290770'),
(837, 20, 'موچش', 'Muchesh', '35.05822680', '47.14611050'),
(838, 20, 'برده رشه', 'Bardeh Rasheh', '35.59324210', '46.08397320'),
(839, 20, 'چناره', 'Chnare', '35.63244780', '46.30428320'),
(840, 20, 'کانی دینار', 'Kani Dinar', '35.46323020', '46.20749840'),
(841, 20, 'مریوان', 'Marivan', '35.51682810', '46.16090280'),
(842, 21, 'ارزوییه', 'Orzueeyeh', '28.45839080', '56.35321770'),
(843, 21, 'امین شهر', 'Aminshahr ', '30.84221360', '55.33205130'),
(844, 21, 'انار', 'Anar ', '30.86568490', '55.25728220'),
(845, 21, 'بافت', 'Baft', '29.23087260', '56.57920540'),
(846, 21, 'بزنجان', 'Bezanjan', '29.24761330', '56.68898110'),
(847, 21, 'بردسیر', 'Bardsir', '29.92599380', '56.53491440'),
(848, 21, 'دشتکار', 'Dashtkar', '29.90690010', '56.65785420'),
(849, 21, 'گلزار', 'Golzar', '29.70544120', '57.02460030'),
(850, 21, 'لاله زار', 'Laleh zaar', '29.52051620', '56.80753450'),
(851, 21, 'نگار', 'Negar', '29.85702120', '56.79398410'),
(852, 21, 'بروات', 'Baravat', '29.06156180', '58.38503770'),
(853, 21, 'بم', 'Bam', '29.10232890', '58.31135210'),
(854, 21, 'بلوک', 'Boluk', '28.23060410', '57.50465150'),
(855, 21, 'جبالبارز', 'Jebalbarez', '28.90703670', '57.88232800'),
(856, 21, 'جیرفت', 'Jiroft', '28.69194930', '57.64691340'),
(857, 21, 'درب بهشت', 'Darb-e Behesht', '29.23461930', '57.33000760'),
(858, 21, 'رابر', 'Rābor', '29.29081380', '56.89978100'),
(859, 21, 'هنزا', 'Hanza', '29.29845610', '57.17977030'),
(860, 21, 'راور', 'Ravar', '31.26921640', '56.76970420'),
(861, 21, 'هجدک', 'Hojedk', '30.75808180', '56.98747860'),
(862, 21, 'بهرمان', 'Bahreman', '30.90036410', '55.71686260'),
(863, 21, 'رفسنجان', 'Rafsanjan', '30.36719610', '55.92132580'),
(864, 21, 'صفاییه', 'Safaiyeh', '30.82808130', '55.80301480'),
(865, 21, 'کشکوییه', 'Koshkuiyeh', '30.52904570', '55.63227370'),
(866, 21, 'مس سرچشمه', 'Shahrak Mes Sarcheshmeh', '30.00024680', '55.77831730'),
(867, 21, 'رودبار', 'Rudbar', '27.57511300', '58.93533200'),
(868, 21, 'زهکلوت', 'Zeh-e Kalut', '27.79250000', '58.58694400'),
(869, 21, 'گنبکی', 'Gonbaki', '28.71475080', '58.84328830'),
(870, 21, 'محمدآباد', 'Mohammadabad', '28.62839590', '59.11886930'),
(871, 21, 'خانوک', 'Khanook', '30.71558630', '56.75333240'),
(872, 21, 'ریحان', 'Reyhan', '30.73485380', '56.68739260'),
(873, 21, 'زرند', 'Zarand', '30.81357630', '56.54560020'),
(874, 21, 'یزدان شهر', 'Yazdan Shahr', '30.86833240', '56.33342680'),
(875, 21, 'بلورد', 'Balvard', '29.42318820', '56.03645320'),
(876, 21, 'پاریز', 'Pariz', '29.87880940', '55.72693730'),
(877, 21, 'خواجو شهر', 'Khajoo Shahr', '29.27247370', '55.82664020'),
(878, 21, 'زیدآباد', 'Zeydabad', '29.60092330', '55.52683340'),
(879, 21, 'سیرجان', 'Sirjan', '29.48542650', '55.59337680'),
(880, 21, 'نجف شهر', 'Najaf Shahr', '29.39739100', '55.70182060'),
(881, 21, 'هماشهر', 'Homashahr', '29.64449710', '55.80265050'),
(882, 21, 'جوزم', 'Jowzam', '30.51302580', '55.02259970'),
(883, 21, 'خاتون اباد', 'KhatonAbad', '30.00947510', '55.41270020'),
(884, 21, 'خورسند', 'Khursand', '30.15484910', '55.07781030'),
(885, 21, 'دهج', 'Dehaj', '30.69372360', '54.86387720'),
(886, 21, 'شهربابک', 'Shahrbabak', '30.11976770', '55.09231510'),
(887, 21, 'دوساری', 'Dow Sari', '28.42500000', '57.94250000'),
(888, 21, 'عنبرآباد', 'Anbarabad', '28.47785580', '57.82434920'),
(889, 21, 'مردهک', 'Mardehak', '28.35363910', '58.14999100'),
(890, 21, 'فاریاب', 'Faryab', '28.09095550', '57.20915770'),
(891, 21, 'فهرج', 'Fahraj', '28.94585560', '58.87598980'),
(892, 21, 'قلعه گنج', 'Ghalehganj', '27.52440690', '57.85301680'),
(893, 21, 'اختیارآباد', 'Ekhteyarabad', '30.32721010', '56.90308550'),
(894, 21, 'اندوهجرد', 'Andouhjerd', '30.23285440', '57.73551450'),
(895, 21, 'باغین', 'Bagheyn', '30.18547660', '56.80399410'),
(896, 21, 'جوپار', 'Joupar', '30.05605440', '57.09809280'),
(897, 21, 'چترود', 'Chatroud', '30.60212460', '56.90428730'),
(898, 21, 'راین', 'Rayen', '29.59267390', '57.42716770'),
(899, 21, 'زنگی آباد', 'Zangiabad', '30.40467220', '56.89778550'),
(900, 21, 'شهداد', 'Shahdad', '30.42195570', '57.69062500'),
(901, 21, 'کاظم آباد', 'Kazem Abad', '30.56691630', '56.83686730'),
(902, 21, 'کرمان', 'Kerman', '30.27303230', '56.99620960'),
(903, 21, 'گلباف', 'Golbāf', '29.88492820', '57.71448600'),
(904, 21, 'ماهان', 'Mahan', '30.06414420', '57.25602090'),
(905, 21, 'محی آباد', 'MohyAbad', '30.08404130', '57.15257410'),
(906, 21, 'کوهبنان', 'Kuhbanan ', '31.40981600', '56.28215900'),
(907, 21, 'کیانشهر', 'Kian Shahr', '31.13444400', '56.39805600'),
(908, 21, 'کهنوج', 'Kahnooj', '27.97934880', '57.66592480'),
(909, 21, 'منوجان', 'Manoojan', '27.36824920', '57.20289640'),
(910, 21, 'نودژ', 'Nodej', '27.53194030', '57.44420510'),
(911, 21, 'نرماشیر', 'Narmashir', '28.95310380', '58.68991970'),
(912, 21, 'نظام شهر', 'Nezamshahr', '28.91611100', '58.55027800'),
(913, 22, 'اسلام آبادغرب', 'Eslamabad-e-Gharb', '34.11009240', '46.49572790'),
(914, 22, 'حمیل', 'Hamil', '33.93732470', '46.76577320'),
(915, 22, 'بانوره', 'Banevreh', '34.96917880', '46.35028830'),
(916, 22, 'باینگان', 'Bayangan', '34.98088040', '46.26785870'),
(917, 22, 'پاوه', 'Paveh', '35.04541920', '46.34376500'),
(918, 22, 'نودشه', 'Nowdeshah', '35.18205130', '46.24964120'),
(919, 22, 'نوسود', 'Nowsud', '35.16135400', '46.20011690'),
(920, 22, 'ازگله', 'Ezgeleh', '34.83314400', '45.83253630'),
(921, 22, 'تازه آباد', 'azeh Abad', '34.49698980', '47.04017400'),
(922, 22, 'جوانرود', 'Javanrud', '34.80562640', '46.47821880'),
(923, 22, 'ریجاب', 'Rijab', '34.48030290', '46.00143560'),
(924, 22, 'کرند', 'Kerend-e Gharb', '34.27801600', '46.22670290'),
(925, 22, 'گهواره', 'Gahvareh', '34.34416220', '46.41101360'),
(926, 22, 'روانسر', 'Ravansar', '34.70905390', '46.64036880'),
(927, 22, 'شاهو', 'Mansur-e Aqai', '34.93651900', '46.45208350'),
(928, 22, 'سرپل ذهاب', 'Sarpol Zahab', '34.45922230', '45.84577550'),
(929, 22, 'سطر', 'Satar', '34.81151280', '47.46012210'),
(930, 22, 'سنقر', 'Sonqor', '34.77446180', '47.56625120'),
(931, 22, 'صحنه', 'Sahneh', '34.47931870', '47.66803610'),
(932, 22, 'میان راهان', 'Miyan Rahan', '34.58375750', '47.44153980'),
(933, 22, 'سومار', 'Soomar', '33.88124650', '45.63190690'),
(934, 22, 'قصرشیرین', 'Qasr-e Shirin', '34.51672070', '45.57090270'),
(935, 22, 'رباط', 'Robat', '34.26546230', '46.79866770'),
(936, 22, 'کرمانشاه', 'Kermanshah', '34.33724970', '47.02583320'),
(937, 22, 'کوزران', 'Kuzaran', '34.49665360', '46.59675130'),
(938, 22, 'هلشی', 'Halashi', '34.10985920', '47.08711270'),
(939, 22, 'کنگاور', 'Kangavar', '34.50170840', '47.94414260'),
(940, 22, 'گودین', 'Gowdin', '34.50788250', '48.07484150'),
(941, 22, 'سرمست', 'Srmast', '34.50537190', '47.83984780'),
(942, 22, 'گیلانغرب', 'Gilan Gharb', '34.13989520', '45.91493370'),
(943, 22, 'بیستون', 'Bisotun', '34.39705640', '47.43759150'),
(944, 22, 'هرسین', 'Harsin', '34.27083380', '47.56954260'),
(945, 23, 'باشت', 'Basht', '30.36208100', '51.15127080'),
(946, 23, 'چیتاب', 'Chitab', '30.79500000', '51.32555600'),
(947, 23, 'گراب سفلی', 'Garab-e Sofla', '30.94722200', '50.88777800'),
(948, 23, 'مادوان', 'Madavan', '30.71844720', '51.53613560'),
(949, 23, 'مارگون', 'Margoon', '30.99314390', '51.06901290'),
(950, 23, 'یاسوج', 'Yasuj', '30.68669560', '51.49643320'),
(951, 23, 'لیکک', 'Likak', '30.89500000', '50.09305600'),
(952, 23, 'چرام', 'Choram', '30.75374640', '50.73295340'),
(953, 23, 'سرفاریاب', 'sarfariyab', '30.80720400', '50.84650350'),
(954, 23, 'پاتاوه', 'Pataveh', '30.95669820', '51.26478200'),
(955, 23, 'سی سخت', 'Sisakht', '30.85631130', '51.43766630'),
(956, 23, 'دهدشت', 'Dehdasht', '30.78881430', '50.54749170'),
(957, 23, 'دیشموک', 'Dishmok', '31.29920680', '50.39264550'),
(958, 23, 'سوق', 'Suq', '30.85902050', '50.45108550'),
(959, 23, 'قلعه رییسی', 'Qaleh Raisi', '31.19000000', '50.44194400'),
(960, 23, 'دوگنبدان', 'Dogonbadan', '30.35412730', '50.75786540'),
(961, 23, 'لنده', 'Lendeh', '30.97781800', '50.40324550'),
(962, 24, 'آزادشهر', 'Azadshahr', '37.08773700', '55.15544390'),
(963, 24, 'نگین شهر', 'Neginshahr', '37.13936470', '55.15758990'),
(964, 24, 'نوده خاندوز', 'Nowdeh Khanduz', '37.07449880', '55.25308730'),
(965, 24, 'آق قلا', 'Aq Qala', '37.01204170', '54.44060310'),
(966, 24, 'انبارالوم', 'Anbar Olum', '37.13300090', '54.61230750'),
(967, 24, 'بندرگز', 'Bandar-e Gaz', '36.77416700', '53.94805600'),
(968, 24, 'نوکنده', 'Nowkandeh', '36.74051840', '53.88399070'),
(969, 24, 'بندرتركمن', 'Bandar Torkaman', '36.90507650', '54.03526730'),
(970, 24, 'تاتار علیا', 'Tatar Olia', '37.11100750', '55.04270560'),
(971, 24, 'خان ببین', 'Khānbebin', '37.00947410', '54.97964140'),
(972, 24, 'دلند', 'Daland', '37.03465860', '55.03712660'),
(973, 24, 'رامیان', 'Ramian', '37.01793650', '55.12475950'),
(974, 24, 'سنگدوین', 'Sangdevin', '36.99793400', '54.85263350'),
(975, 24, 'علي آباد كتول', 'Aliabad-e-Katul', '36.91016390', '54.83907210'),
(976, 24, 'فاضل آباد', 'Fazelabad', '36.89410210', '54.73096840'),
(977, 24, 'مزرعه', 'Mazraeh', '36.95386110', '54.85471500'),
(978, 24, 'کردکوی', 'Kordkuy', '36.79071860', '54.08895490'),
(979, 24, 'فراغی', 'Faraqi', '37.26035860', '55.16635490'),
(980, 24, 'کلاله', 'Kalaleh', '37.37818460', '55.48038640'),
(981, 24, 'گالیکش', 'Galikesh', '37.27148880', '55.41242110'),
(982, 24, 'جلین', 'Jelin', '36.85127690', '54.52793600'),
(983, 24, 'سرخنکلاته', 'Sarkhon Kalateh', '36.89138900', '54.56916700'),
(984, 24, 'گرگان', 'Gorgan', '36.85041930', '54.36802300'),
(985, 24, 'سیمین شهر', 'Siminshahr', '37.01276160', '54.21581250'),
(986, 24, 'گمیش تپه', 'Gomish Tepe', '37.07166700', '54.07666700'),
(987, 24, 'اینچه برون', 'Incheboron', '37.45422400', '54.71541160'),
(988, 24, 'گنبدکاووس', 'Gonbad Kavus', '37.24385140', '55.12445700'),
(989, 24, 'مراوه', 'Maraveh', '37.90416700', '55.95583300'),
(990, 24, 'مینودشت', 'Minudasht', '37.22713100', '55.35491450'),
(991, 25, 'آستارا', 'Astara', '38.42378790', '48.81787720'),
(992, 25, 'لوندویل', 'Lavandvil', '38.30771640', '48.84607290'),
(993, 25, 'آستانه اشرفیه', 'Astaneh-ye Ashrafiyeh', '37.26507030', '49.91960360'),
(994, 25, 'کیاشهر', 'Kiashahr', '37.41682790', '49.92925590'),
(995, 25, 'املش', 'Amlash', '37.09246800', '50.17314410'),
(996, 25, 'رانکوه', 'Ranekouh', '37.05229690', '50.21790480'),
(997, 25, 'بندرانزلی', 'Bandar Anzali', '37.47444270', '49.41493690'),
(998, 25, 'خشکبیجار', 'Khoshkebijar', '37.37479300', '49.73922700'),
(999, 25, 'خمام', 'Khomam', '37.38749490', '49.63949190'),
(1000, 25, 'رشت', 'Rasht', '37.24423260', '49.51632260'),
(1001, 25, 'سنگر', 'Sangar', '37.17965610', '49.68532780'),
(1002, 25, 'کوچصفهان', 'Kuchesfahan', '37.27838040', '49.76859950'),
(1003, 25, 'لشت نشاء', 'Lasht-e Nesha', '37.36018660', '49.84508860'),
(1004, 25, 'لولمان', 'Louleman', '37.25747920', '49.80743050'),
(1005, 25, 'پره سر', 'Paresar', '37.60172960', '49.06391210'),
(1006, 25, 'رضوانشهر', 'Rezvanshahr', '37.56205280', '49.12607380'),
(1007, 25, 'بره سر', 'Barehsar', '36.77599100', '49.74575040'),
(1008, 25, 'توتکابن', 'Tutkabon', '36.89090440', '49.52147480'),
(1009, 25, 'جیرنده', 'Jirindih', '36.70054440', '49.78016850'),
(1010, 25, 'رستم آباد', 'Rostamabad', '36.89948990', '49.47362410'),
(1011, 25, 'رودبار', 'Rudbar', '36.81367160', '49.38912330'),
(1012, 25, 'لوشان', 'Lowshan', '36.63216940', '49.49772640'),
(1013, 25, 'منجیل', 'Manjil', '36.73708440', '49.39127490'),
(1014, 25, 'چابکسر', 'Chaboksar', '36.97505830', '50.54664930'),
(1015, 25, 'رحیم آباد', 'Rahimabad', '37.02874220', '50.32571940'),
(1016, 25, 'رودسر', 'Rudsar', '37.13858810', '50.26688520'),
(1017, 25, 'کلاچای', 'Kelachay', '37.07707330', '50.38030730'),
(1018, 25, 'واجارگاه', 'Vajargah', '37.04083300', '50.40861100'),
(1019, 25, 'دیلمان', 'Deylaman', '36.88609010', '49.90029930'),
(1020, 25, 'سیاهکل', 'Siahkal', '37.15141410', '49.84181590'),
(1021, 25, 'احمدسرگوراب', 'Ahmadsargurab', '37.12805600', '49.36666700'),
(1022, 25, 'شفت', 'Shaft', '37.06483110', '49.17771370'),
(1023, 25, 'صومعه سرا', 'Someh Sara', '37.30245890', '49.30286820'),
(1024, 25, 'گوراب زرمیخ', 'Gurab Zarmikh', '37.29829280', '49.20505980'),
(1025, 25, 'مرجقل', 'Marjaghal', '37.27555600', '49.36277800'),
(1026, 25, 'اسالم', 'Asalem', '37.72003980', '48.92658170'),
(1027, 25, 'چوبر', 'Choobar', '38.18351690', '48.87027790'),
(1028, 25, 'حویق', 'Haviq', '38.14750000', '48.89222200'),
(1029, 25, 'لیسار', 'Lisar', '37.95806970', '48.88967500'),
(1030, 25, 'هشتپر (تالش)', 'Talesh', '37.80885130', '48.86954730'),
(1031, 25, 'فومن', 'Fuman', '37.22937060', '49.29354140'),
(1032, 25, 'ماسوله', 'Masuleh', '37.15699680', '48.97589190'),
(1033, 25, 'ماکلوان', 'Maklavan', '37.19555600', '49.19861100'),
(1034, 25, 'رودبنه', 'Rod Baneh', '37.25551520', '50.00032430'),
(1035, 25, 'لاهیجان', 'Lahijan', '37.20875430', '49.97994160'),
(1036, 25, 'اطاقور', 'Otaghvar', '37.10889440', '50.11271960'),
(1037, 25, 'چاف و چمخاله', 'Chaf and Chamkhaleh', '37.22944400', '50.25388900'),
(1038, 25, 'شلمان', 'Shalman', '37.15916990', '50.20692950'),
(1039, 25, 'کومله', 'Kumeleh', '37.15277800', '50.17694400'),
(1040, 25, 'لنگرود', 'Langarud', '37.19100280', '50.13709520'),
(1041, 25, 'بازار جمعه', 'Bazar Jomeh', '37.27945660', '49.37436040'),
(1042, 25, 'ماسال', 'Masal', '37.37981710', '49.11473480'),
(1043, 26, 'ازنا', 'Azna', '33.45306320', '49.41435750'),
(1044, 26, 'مومن آباد', 'Momen Abad', '33.58523350', '49.50169070'),
(1045, 26, 'الیگودرز', 'Aligudarz', '33.39545930', '49.68276360'),
(1046, 26, 'شول آباد', 'Shool Abad', '33.18481160', '49.18555500'),
(1047, 26, 'اشترینان', 'Oshtorinan', '34.01542270', '48.63428580'),
(1048, 26, 'بروجرد', 'Borujerd', '33.88794450', '48.68367910'),
(1049, 26, 'پلدختر', 'Pol Dokhtar', '33.14617260', '47.70149940'),
(1050, 26, 'معمولان', 'Mamulan', '33.37947580', '47.95176030'),
(1051, 26, 'بیران شهر', 'Bayranshahr', '33.64777800', '48.55888900'),
(1052, 26, 'خرم آباد', 'Khorramabad', '33.49109740', '48.28902950'),
(1053, 26, 'زاغه', 'Zagheh', '33.49888900', '48.70861100'),
(1054, 26, 'سپیددشت', 'Sepid Dasht', '33.21903120', '48.88153190'),
(1055, 26, 'نورآباد', 'Nurabad', '34.06655210', '47.93512990'),
(1056, 26, 'هفت چشمه', 'Haft Cheshmeh', '34.20727710', '47.76102300'),
(1057, 26, 'چالانچولان', 'Chalan Chulan', '33.66517450', '48.89954560'),
(1058, 26, 'دورود', 'Dorud', '33.49215260', '49.02520120'),
(1059, 26, 'سراب دوره', 'Sarab-e Dowreh', '33.56388900', '48.02222200'),
(1060, 26, 'ویسیان', 'Veysian', '33.49083300', '48.04916700'),
(1061, 26, 'چقابل', 'Chaqabol', '33.28083300', '47.50888900'),
(1062, 26, 'الشتر', 'Aleshtar', '33.86684970', '48.24379900'),
(1063, 26, 'فیروزآباد', 'Firouz Abad', '33.89859610', '48.09895990'),
(1064, 26, 'درب گنبد', 'Darb Gonbad', '33.68929030', '47.14619640'),
(1065, 26, 'کوهدشت', 'Kuhdasht', '33.53133990', '47.59277330'),
(1066, 26, 'کوهنانی', 'Kunani', '33.40296240', '47.31635560'),
(1067, 26, 'گراب', 'Garab', '33.48518270', '48.48797680'),
(1068, 27, 'آمل', 'Amol', '36.46607750', '52.32350300'),
(1069, 27, 'امامزاده عبدالله', 'Emamzade Abdollah', '36.40886250', '52.30067250'),
(1070, 27, 'دابودشت', 'Dabudasht', '36.48444400', '52.45166700'),
(1071, 27, 'رینه', 'Rineh', '35.88149570', '52.16006610'),
(1072, 27, 'گزنک', 'Gazanak', '35.90314800', '52.21809470'),
(1073, 27, 'امیرکلا', 'Amir Kala', '36.59866300', '52.65631190'),
(1074, 27, 'بابل', 'Babol', '36.53844990', '52.64155360'),
(1075, 27, 'خوش رودپی', 'Khoshroud Pey', '36.37200490', '52.55749930'),
(1076, 27, 'زرگرمحله', 'Zargarmahalleh', '36.52138900', '52.57555600'),
(1077, 27, 'گتاب', 'Gatab', '36.42989710', '52.64785760'),
(1078, 27, 'گلوگاه', 'Galugah', '36.72793590', '53.80219260'),
(1079, 27, 'مرزیکلا', 'Marzikola', '36.36002270', '52.73004060'),
(1080, 27, 'بابلسر', 'Babolsar', '36.69780510', '52.62796930'),
(1081, 27, 'بهنمیر', 'Bahnamir', '36.67194440', '52.74325830'),
(1082, 27, 'کله بست', 'Kalleh Bast', '36.64199270', '52.61046750'),
(1083, 27, 'بهشهر', 'Behshahr', '36.69109230', '53.49981250'),
(1084, 27, 'خلیل شهر', 'Khalil Shahr', '36.69891840', '53.62323740'),
(1085, 27, 'رستمکلا', 'Rostam kola', '36.68009760', '53.39818930'),
(1086, 27, 'تنکابن', 'Tonekabon', '36.81609230', '50.84208670'),
(1087, 27, 'خرم آباد', 'Khorramabad', '36.78182580', '50.86045490'),
(1088, 27, 'شیرود', 'Shirud', '36.85088800', '50.80323940'),
(1089, 27, 'نشتارود', 'Nashtarud', '36.74781580', '51.01041190'),
(1090, 27, 'جویبار', 'Juybar', '36.64279990', '52.88316240'),
(1091, 27, 'کوهی خیل', 'Kuhi Khil', '36.68877660', '52.89846190'),
(1092, 27, 'چالوس', 'Chalus', '36.65616200', '51.38758370'),
(1093, 27, 'مرزن آباد', 'Marzanabad', '36.45283790', '51.28507020'),
(1094, 27, 'هچیرود', 'Hachiroud', '36.68229130', '51.34065050'),
(1095, 27, 'رامسر', 'Ramsar', '36.92914060', '50.60197540'),
(1096, 27, 'کتالم و سادات شهر', 'Ketalem and Sadat Shahr', '36.87656180', '50.70739730'),
(1097, 27, 'پایین هولار', 'Paein Hoular', '36.42892620', '53.13108150'),
(1098, 27, 'ساری', 'Sari', '36.55598260', '53.03742940'),
(1099, 27, 'فریم', 'Farim', '36.62361100', '52.54194400'),
(1100, 27, 'کیاسر', 'Kiasar', '36.24016620', '53.53250060'),
(1101, 27, 'آلاشت', 'Alasht', '36.06550040', '52.83250090'),
(1102, 27, 'پل سفید', 'Pol Sefid', '36.11532040', '53.01140370'),
(1103, 27, 'زیرآب', 'Zirab', '36.18055860', '52.95358650'),
(1104, 27, 'شیرگاه', 'Shirgah', '36.29749850', '52.86569940'),
(1105, 27, 'کیاکلا', 'Kia Kola', '36.58337860', '52.79896250'),
(1106, 27, 'سلمان شهر', 'Salman Shahr', '36.70064750', '51.19075290'),
(1107, 27, 'عباس اباد', 'Abbasabad', '36.72458210', '51.09663950'),
(1108, 27, 'کلارآباد', 'Kelarabad', '36.68741450', '51.23060710'),
(1109, 27, 'فریدونکنار', 'Fereydunkenar', '36.68627890', '52.50735260'),
(1110, 27, 'ارطه', 'Arateh', '36.49486060', '52.92620640'),
(1111, 27, 'قایم شهر', 'Qaemshahr', '36.46202810', '52.83104130'),
(1112, 27, 'کلاردشت', 'Kelardasht', '36.49314010', '51.11897660'),
(1113, 27, 'گلوگاه', 'Galugah', '36.72793590', '53.80219260'),
(1114, 27, 'سرخرود', 'Sorkh Roud', '36.66915810', '52.44252880'),
(1115, 27, 'محمودآباد', 'Mahmudabad', '36.62810130', '52.23996060'),
(1116, 27, 'سورک', 'Surak', '36.59687210', '53.20168030'),
(1117, 27, 'نکا', 'Neka', '36.64779280', '53.27055910'),
(1118, 27, 'ایزدشهر', 'Izadshahr', '36.59444940', '52.11988020'),
(1119, 27, 'بلده', 'Baladeh', '36.19892280', '51.79765630'),
(1120, 27, 'چمستان', 'Chamestan', '36.47860630', '52.10897640'),
(1121, 27, 'رویان', 'Royan', '36.56735610', '51.95396250'),
(1122, 27, 'نور', 'Nur', '36.57424760', '52.01171260'),
(1123, 27, 'پول', 'Pul', '36.39800310', '51.57935130'),
(1124, 27, 'کجور', 'Kojur', '36.38226370', '51.72398280'),
(1125, 27, 'نوشهر', 'Nowshahr', '36.65031060', '51.46933740'),
(1126, 28, 'آشتیان', 'Ashtian', '34.52343930', '49.98950940'),
(1127, 28, 'اراک', 'Arak', '34.07327550', '49.65036870'),
(1128, 28, 'داود آباد', 'Davoud Abad', '34.29521330', '49.84664440'),
(1129, 28, 'ساروق', 'Saroogh', '34.41188360', '49.49469560'),
(1130, 28, 'کارچان', 'Karchan', '34.09941170', '49.92860190'),
(1131, 28, 'تفرش', 'Tafresh', '34.69597120', '50.00299550'),
(1132, 28, 'خمین', 'Khomein', '33.63710910', '50.03426970'),
(1133, 28, 'قورچی باشی', 'Ghurchi Bashi', '33.67539870', '49.87539770'),
(1134, 28, 'جاورسیان', 'Javarseyan', '34.25554870', '49.31822780'),
(1135, 28, 'خنداب', 'Khondab', '34.39453120', '49.17237980'),
(1136, 28, 'دلیجان', 'Delijan', '33.99186840', '50.66804400'),
(1137, 28, 'نراق', 'Naragh', '34.01038960', '50.83148710'),
(1138, 28, 'پرندک', 'Parandak', '35.36852660', '50.67722800'),
(1139, 28, 'خشکرود', 'Khoshkrud', '35.39526200', '50.32892700'),
(1140, 28, 'رازقان', 'Razeqan', '35.33076780', '49.95117550'),
(1141, 28, 'زاویه', 'Zavieh', '35.37725590', '50.55088500'),
(1142, 28, 'مامونیه', 'Mamuniyeh', '35.30405590', '50.48039670'),
(1143, 28, 'آوه', 'Aveh', '34.80372130', '50.40720450'),
(1144, 28, 'ساوه', 'Saveh', '35.03244310', '50.33158730'),
(1145, 28, 'غرق آباد', 'Gharqabad', '35.10821780', '49.82183930'),
(1146, 28, 'نوبران', 'Nowbaran', '35.13117470', '49.70070010'),
(1147, 28, 'آستانه', 'Astaneh', '33.89083300', '49.35777800'),
(1148, 28, 'توره', 'Tureh', '34.04440970', '49.28376670'),
(1149, 28, 'شازند', 'Shazand', '33.93525590', '49.38822250'),
(1150, 28, 'شهباز', 'Shahbaz', '33.93541290', '49.33569190'),
(1151, 28, 'مهاجران', 'Mohajeran', '34.04931460', '49.41744790'),
(1152, 28, 'هندودر', 'Hendoudar', '33.78099310', '49.22662500'),
(1153, 28, 'خنجین', 'Khenejin', '34.75851920', '49.52237610'),
(1154, 28, 'فرمهین', 'Farmahin', '34.50566860', '49.66970420'),
(1155, 28, 'کمیجان', 'Komijan', '34.71307410', '49.30509560'),
(1156, 28, 'میلاجرد', 'Milajerd', '34.62165970', '49.20046800'),
(1157, 28, 'محلات', 'Mahalat', '33.90493140', '50.44106470'),
(1158, 28, 'نیمور', 'Nimvar', '33.88647470', '50.56310530'),
(1159, 29, 'ابوموسی', 'Abumusa ', '27.19805600', '54.36861100'),
(1160, 29, 'بستک', 'Bastak', '27.19631710', '54.34254150'),
(1161, 29, 'جناح', 'Janah', '27.02755080', '54.27128050'),
(1162, 29, 'سردشت', 'Sardasht Bashagard', '26.45871900', '57.88425900'),
(1163, 29, 'گوهران', 'Gouharan', '26.59615360', '57.88707010'),
(1164, 29, 'بندرعباس', 'Bandar Abbas', '27.18986420', '56.09781180'),
(1165, 29, 'تازیان پایین', 'Tazian', '27.29016000', '56.15210300'),
(1166, 29, 'تخت', 'Takht', '27.50356930', '56.62731160'),
(1167, 29, 'فین', 'Fin', '27.63285790', '55.88187210'),
(1168, 29, 'قلعه قاضی', 'Qaleh Qazi', '27.44472200', '56.54777800'),
(1169, 29, 'بندرلنگه', 'Bandar Lengeh', '26.56406140', '54.85581930'),
(1170, 29, 'چارک', 'Bandar Charak', '26.73055600', '54.27472200'),
(1171, 29, 'کنگ', 'Bandar Kong', '26.60285650', '54.92980580'),
(1172, 29, 'کیش', 'Kish', '26.53446380', '53.93884180'),
(1173, 29, 'لمزان', 'Lemazan', '27.05369130', '54.83641080'),
(1174, 29, 'پارسیان', 'Parsian', '27.21671750', '53.02186470'),
(1175, 29, 'دشتی', 'Dashti', '27.17918870', '52.99824000'),
(1176, 29, 'کوشکنار', 'Koshkonar', '27.25012720', '52.85715580'),
(1177, 29, 'بندرجاسک', 'Bandar-e-Jask', '25.65385140', '57.76995600'),
(1178, 29, 'حاجی اباد', 'Haji Abad', '28.31352140', '55.89620570'),
(1179, 29, 'سرگز', 'Sargaz', '28.42563000', '55.70177000'),
(1180, 29, 'فارغان', 'Fareghan', '28.00785210', '56.24459260'),
(1181, 29, 'خمیر', 'Bandar Khamir', '26.95185270', '55.57268840'),
(1182, 29, 'رویدر', 'Ruydar', '27.46003100', '55.40825820'),
(1183, 29, 'بیکاء', 'Bikah', '27.35404360', '57.16993320'),
(1184, 29, 'دهبارز', 'Dehbārez', '27.44841050', '57.16675690'),
(1185, 29, 'زیارتعلی', 'Ziyārat Ali', '27.73557730', '57.21072420'),
(1186, 29, 'سیریک', 'Sirik', '26.52731610', '57.09002470'),
(1187, 29, 'کوهستک', 'Kouhestak', '26.80426850', '57.01887130'),
(1188, 29, 'گروک', 'Gerouk', '26.58856490', '57.08517550'),
(1189, 29, 'درگهان', 'Dargahan', '26.95833690', '56.04316930'),
(1190, 29, 'سوزا', 'Suzā', '26.77724030', '56.04379160'),
(1191, 29, 'قشم', 'Qeshm', '26.95817700', '56.18880220'),
(1192, 29, 'هرمز', 'Hormuz', '27.09500000', '56.45277800'),
(1193, 29, 'تیرور', 'Tirour', '27.33793880', '56.95310350'),
(1194, 29, 'سندرک', 'Senderk', '26.83816290', '57.41788730'),
(1195, 29, 'میناب', 'Minab', '27.13832660', '57.01058610'),
(1196, 29, 'هشتبندی', 'Hasht Bandi', '27.14586240', '57.43326510'),
(1197, 30, 'آجین', 'Ajin', '34.73251280', '47.91867250'),
(1198, 30, 'اسدآباد', 'Asadabad', '34.78120160', '48.10209250'),
(1199, 30, 'بهار', 'Bahar', '34.89388660', '48.40322920'),
(1200, 30, 'صالح آباد', 'Salehabad', '34.92309630', '48.33458660'),
(1201, 30, 'لالجین', 'Lalejin', '34.97472390', '48.46436250'),
(1202, 30, 'مهاجران', 'Mohajeran', '35.07656210', '48.60714200'),
(1203, 30, 'تویسرکان', 'Tuyserkan', '34.54815720', '48.43238510'),
(1204, 30, 'سرکان', 'Serkan', '34.60070120', '48.43862940'),
(1205, 30, 'فرسفج', 'Farasfaj', '34.48626330', '48.28147890'),
(1206, 30, 'دمق', 'Damaq', '35.44193980', '48.81380080'),
(1207, 30, 'رزن', 'Razan', '35.38791150', '49.01764850'),
(1208, 30, 'قروه درجزین', 'Qorveh-e Darjazin', '35.31264740', '49.08991810'),
(1209, 30, 'فامنین', 'Famenin', '35.11300840', '48.95694480'),
(1210, 30, 'شیرین سو', 'Shirin Su', '35.49270800', '48.44196080'),
(1211, 30, 'کبودرآهنگ', 'Kabudrahang', '35.20939460', '48.70679130'),
(1212, 30, 'گل تپه', 'Gol Tappeh', '35.22083550', '48.19597000'),
(1213, 30, 'ازندریان', 'Azandarian', '34.50931250', '48.67901430'),
(1214, 30, 'جوکار', 'Jowkar', '34.43034520', '48.67798440'),
(1215, 30, 'زنگنه', 'Zangeneh', '34.15427170', '49.00369050'),
(1216, 30, 'سامن', 'Samen', '34.20976100', '48.69501120'),
(1217, 30, 'ملایر', 'Malayer', '34.30142510', '48.78822270'),
(1218, 30, 'برزول', 'Barzul', '34.21317710', '48.25816510'),
(1219, 30, 'فیروزان', 'Firuzan', '34.36152240', '48.10754300'),
(1220, 30, 'گیان', 'Giyan', '34.17566540', '48.23459370'),
(1221, 30, 'نهاوند', 'Nahavand', '34.19482680', '48.33924230'),
(1222, 30, 'جورقان', 'Juraqan', '34.88513830', '48.54383100'),
(1223, 30, 'قهاوند', 'Qahavand', '34.85973490', '48.99060110'),
(1224, 30, 'مریانج', 'Maryanaj', '34.83148830', '48.45425600'),
(1225, 30, 'همدان', 'Hamedan', '34.81230870', '48.44002710'),
(1226, 31, 'ابرکوه', 'Abarkooh', '31.12628100', '53.22159240'),
(1227, 31, 'مهردشت', 'Mehrdasht', '31.02277800', '53.35638900'),
(1228, 31, 'احمدآباد', 'Ahmadabad', '32.35666700', '53.99194400'),
(1229, 31, 'اردکان', 'Ardakan', '32.31041690', '53.99896130'),
(1230, 31, 'عقدا', 'Aqda', '32.44319900', '53.62542610'),
(1231, 31, 'اشکذر', 'Ashkezar', '32.00074020', '54.19235920'),
(1232, 31, 'خضرآباد', 'Khezrabad', '31.87049590', '53.94642230'),
(1233, 31, 'بافق', 'Bafgh', '31.61251830', '55.38023410'),
(1234, 31, 'بهاباد', 'Bahabad', '31.87022880', '56.00460980'),
(1235, 31, 'تفت', 'Taft', '31.75745810', '54.17206950'),
(1236, 31, 'نیر', 'Nir', '31.48225780', '54.12075520'),
(1237, 31, 'مروست', 'Marvast', '30.47856150', '54.20229430'),
(1238, 31, 'هرات', 'Harat', '30.05011000', '54.35108170'),
(1239, 31, 'مهریز', 'Mehriz', '31.57977540', '54.40669420'),
(1240, 31, 'بفروییه', 'Bafruiyeh', '32.26992120', '53.98829480'),
(1241, 31, 'میبد', 'Meybod', '32.20842700', '53.97471180'),
(1242, 31, 'ندوشن', 'Nodoushan', '32.03013140', '53.53182780'),
(1243, 31, 'حمیدیا', 'Hamidia', '31.82816140', '54.37884800'),
(1244, 31, 'زارچ', 'Zarach', '31.98615350', '54.22491050'),
(1245, 31, 'شاهدیه', 'Shahedieh', '31.94539800', '54.24602450'),
(1246, 31, 'یزد', 'Yazd', '31.87953920', '54.26672690');

-- --------------------------------------------------------

--
-- Table structure for table `copans`
--

CREATE TABLE `copans` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `amount` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `amount_type` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => percentage, 1 => price unit',
  `discount_ceiling` bigint(20) UNSIGNED DEFAULT NULL,
  `type` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => public (every user can use one time), 1 => private (one user can user one time)',
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `start_date` datetime DEFAULT NULL,
  `end_date` datetime DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `copans`
--

INSERT INTO `copans` (`id`, `code`, `amount`, `amount_type`, `discount_ceiling`, `type`, `status`, `start_date`, `end_date`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'vsdvsdvf', '30', 0, 100000, 0, 1, '2022-06-25 00:11:05', '2022-07-29 00:11:05', NULL, '2022-06-24 19:41:22', '2022-06-24 19:41:26');

-- --------------------------------------------------------

--
-- Table structure for table `delivery_times`
--

CREATE TABLE `delivery_times` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `time` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `delivery_times`
--

INSERT INTO `delivery_times` (`id`, `time`, `created_at`, `updated_at`) VALUES
(1, '24 ساعت', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(2, '48 ساعت', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(3, 'سه روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(4, 'چهار روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(5, 'پنج روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(6, 'شش روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(7, 'هفت روز', '2022-06-20 15:36:29', '2022-06-20 15:36:29');

-- --------------------------------------------------------

--
-- Table structure for table `discount_requests`
--

CREATE TABLE `discount_requests` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `quantity` int(11) NOT NULL,
  `requested_price` decimal(20,3) NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `faqs`
--

CREATE TABLE `faqs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `question` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `faq_category_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `faqs`
--

INSERT INTO `faqs` (`id`, `question`, `answer`, `slug`, `status`, `faq_category_id`, `created_at`, `updated_at`) VALUES
(1, 'شروع با ایسام', '<p>سایت ایسام خریداران و فروشندگان کل کشور را به یكدیگر معرفی و متصل كرده و قادر می‌سازد تا با آرامش خاطر با یکدیگر به تجارت بپردازند!<br>\n<br>\nروش كار سایت ایسام:<br>\nفروشنده محصول، جهت ثبت کالا در سایت اقدام می کند. این کالا می‌تواند فیزیکی یا مجازی، از عتیقه‌جات تا لوازم خانه و یا از كتاب گرفته تا تجهیزات ورزشی باشد. سپس فروشنده روش فروش آن را به صورت مزایده و یا فروش با قیمت ثابت انتخاب می‌كند.</p>\n\n<ol>\n	<li>در یك مزایده آنلاین، پیشنهاددهی با مبلغی كه فروشنده مشخص كرده، آغاز می‌شود و طی چند روز معین در سایت ایسام باقی‌ می‌ماند. در این مدت خریداران پیشنهادهای خود را برای خرید آن كالا ارایه می‌نمایند. پس از پایان مزایده، خریداری كه بالاترین پیشنهاد را ارایه داده ‌است برنده می‌شود و کالا را خریداری می‌كند.</li>\n	<li>هنگام عرضه كالاها به صورت فروش با قیمت ثابت، اولین خریداری كه مبلغ تعیین شده توسط فروشنده را می‌پذیرد می‌تواند كالای مورد نظر را به سبد خرید اضافه کرده و خریداری نماید.</li>\n</ol>', 'شروع-با-ایسام', 1, 1, '2022-06-24 15:49:54', '2022-06-24 15:49:54'),
(2, 'روش عضو شدن', '<p>ثبت نام در سایت ایسام خیلی ساده است و طی چند مرحله می توانید ثبت نام كنید:<br>\n<br>\n1- روی \"ورود / ثبت نام\" کلیک کنید</p>\n\n<p>2- شماره موبایل خود را وارد کنید<br>\n3- کد ارسال شده را وارد کنید<br>\n4- رمز عبور را انتخاب کنید</p>', 'روش-عضو-شدن', 1, 1, '2022-06-24 16:03:24', '2022-06-24 16:03:24'),
(3, 'روش انتخاب رمز عبور', '<ul>\n	<li>رمزهای انتخابی حساس به کوچک و یا بزرگ بودن حروف می باشند. مثلا \"password\" و \"PASSWORD\" دو رمز متفاوت می باشند. هنگامی که رمز خود را انتخاب می کنید، کوچک بودن و یا بزرگ بودن حروف را به یاد داشته باشید.</li>\n	<li>از رمز انتخابی خود با دقت محافظت کنید. به یاد داشته باشید، هر شخصی که رمز ورود شما را بداند، می تواند وارد حساب کاربری شما شود.</li>\n	<li>از ترکیب اعداد و حروف برای انتخاب رمز استفاده کنید. به عنوان مثال salamsam26</li>\n	<li>از ترکیب چندین واژه و عدد بدون فاصله گذاری استفاده نمایید. مانند mastersam84</li>\n	<li>به هیچ وجه از یک کلمه تنها که به راحتی در هر دیکشنری یافت می شود استفاده ننمایید. مانند manager یا bamboo</li>\n	<li>از اطلاعات شخصی خود که به سادگی قابل دسترس بوده و یا قابل حدس می باشد، استفاده ننمایید. مانند نام، شماره تلفن و یا تاریخ تولد خود.</li>\n	<li>از آدرس ایمیل خود به عنوان رمز استفاده ننمایید.</li>\n	<li>از انتخاب رمزهای متداول و قابل حدس جلوگیری کنید. مانند 123456 و یا ABCDEF</li>\n</ul>', 'روش-انتخاب-رمز-عبور', 1, 1, '2022-06-24 16:03:56', '2022-06-24 16:05:50'),
(4, 'چگونه خرید کنم و در مزایدات شرکت کنم؟', '<p><a href=\"https://esam.ir/Service/Help.aspx?order=2_1#C21\">مرحله 1: ثبت نام كنید</a></p>\n\n<p><br>\nاگر قبلا <a href=\"https://esam.ir/Service/Help.aspx?order=1_2\">ثبت نام</a> کرده اید، روی ورود کلیک کنید و نام کاربری و رمز عبور را وارد کنید.<br>\n(برای خروج از بخش راهنما و ورود به حساب کاربری خود <a href=\"https://esam.ir/signInUser.aspx\">اینجا</a> را کلیک کنید.)<br>\n<img alt=\"لینک ورود\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c2.jpg\"><br>\nدر این صفحه ایمیل، شماره تلفن و رمز عبور را وارد کنید. جهت فعالیت در سایت حتما باید ابتدا توافق نامه کاربری سایت را به صورت کامل مطالعه کرده و پس از آن با تیک زدن در کنار جمله \" قبول توافق نامه کاربری \" شرایط سایت را قبول نمایید. در صورت عدم قبول توافق نامه از عضویت شما در سایت جلوگیری خواهد شد. در پایان کد امنیتی خواسته شده را وارد کنید. (برای خروج از بخش راهنما و ثبت نام خود <a href=\"https://esam.ir/SignInUser.aspx?reg=1\">اینجا</a> را کلیک کنید.)</p>\n\n<p> </p>\n\n<p>روش یک:<br>\nالف) در بالای صفحه اول روی خرید کلیک کنید.<br>\n<img alt=\"لینک خرید\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c3.jpg\"><br>\nب) وارد صفحه خرید می شوید. بر روی گروه مورد نظر خود کلیک کنید و زیرگروه مورد نظر را انتخاب کنید. (برای خروج از بخش راهنما و ورود به صفحه گروه های مختلف کالا <a href=\"https://esam.ir/purchase/purchasefirst.aspx\">اینجا</a> را کلیک کنید.)<br>\n<br>\n<img alt=\"گروه کالاها\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c4.jpg\"><br>\nروش دو:<br>\nدر کادر <a href=\"https://esam.ir/Service/Help.aspx?order=2_2\">جستجوی</a> بالای صفحه، نام کالا را جستجو کنید، سپس در سمت راست صفحه نتایج جستجو، از گروه های نمایش داده شده، گروه مد نظر خود را انتخاب نمایید.<br>\n<img alt=\"جستجو\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c5.jpg\"><br>\nروش سه:<br>\nدر سمت راست صفحه اول، روی گروه کالای مورد نظر کلیک کنید. مثلا برای خرید گوشی موبایل، ابتدا نشانگر موس را روی گروه موبایل و تبلت نگه دارید، سپس از منوی باز شده موبایل را انتخاب کنید.<br>\n<img alt=\"لیست کالاها\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c6.jpg\"><br>\nدر صورت کلیک روی هر سر گروه، تمام زیرگروه های آن نمایش داده می شود.<br>\n<img alt=\"لیست کالاها\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-c66.jpg\"></p>\n\n<p> \n</p>\n\n<p><br>\n </p>\n', 'چگونه-خرید-کنم-و-در-مزایدات-شرکت-کنم', 1, 3, '2022-06-24 16:05:39', '2022-06-24 16:07:44'),
(5, 'چگونه بفروشم؟', '<p><strong>چگونه کالا برای فروش ثبت کنم؟</strong><br>\n<strong>مرحله 1: روی دکمه \"فروش کالا\" که در بالای تمام صفحات ایسام است، کلیک کنید.</strong><br>\n<img alt=\"دکمه فروش\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc38.jpg\"><br>\nاگر در ایسام ثبت نام نکرده اید و یا داخل حساب کاربری خود نیستید، صفحه ورود / ثبت نام می آید.<br>\n<img alt=\"ورود ثبت نام\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc39.jpg\"><br>\nبرای دریافت راهنمایی در مورد ثبت نام <a href=\"https://esam.ir/Service/Help.aspx?order=1_2\">اینجا</a> کلیک کنید و از شماره 2 به بعد را مطالعه کنید.<br>\nاگر قبلا ثبت نام کرده اید، شماره موبایل خود را وارد کنید و در مرحله بعدی رمز عبوری که انتخاب کرده اید را وارد کنید.<br>\n<img alt=\"وارد کردن شماره موبایل\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc34.jpg\"><br>\n<strong>مرحله 2: عنوان کالا را برای انتخاب گروه وارد کنید.</strong><br>\nعنوان کالا مانند لپ‌تاپ، کیف، دوربین، تمبر و ... را وارد کنید تا گروه کالای شما نمایش داده شود. سپس گروه مورد نظر را انتخاب کنید.<br>\n<img alt=\"عنوان کالا\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc40.jpg\"><br>\nگروه بندی کالا به این جهت مهم است که به خریدار کمک می‌کند سریع تر و راحت تر کالای شما را در سایت پیدا کند.<br>\n<br>\n<strong>پیدا نکردن گروه مورد نظر</strong><br>\nاگر در بین گروه های پیشنهادی، گروه مد نظر خود را پیدا نکردید، بر روی دکمه \"مشاهده تمام گروه ها\" کلیک کنید.<br>\nدر این قسمت لیست تمام گروه ها نشان داده می شود و با کلیک بر روی هر گروه به زیر گروه های آن دسترسی خواهید داشت.<br>\n<img alt=\"مشاهده تمام گروه ها\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc41.jpg\"><br>\n<br>\n<strong>گروه‌های استفاده شده</strong><br>\nبرای فروشندگانی است که پیش از این کالا ثبت کرده اند و می توانند از همان گروه های قبلی خودشان استفاده کنند. با کلیک بر روی هر کدام می توانید کالای خود را در آن گروه ثبت کنید.<br>\n<img alt=\"گروه‌های استفاده شده\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc42.jpg\"><br>\nبرای خروج از راهنما و فروش کالا <a href=\"https://esam.ir/sell/SellFirst.aspx\">اینجا</a> کلیک کنید.<br>\n<br>\n<strong>مرحله 3: صفحهٔ وارد کردن مشخصات کالا</strong><br>\nقبل از ثبت کالا در سایت، مطمئن شوید که عرضه آن با قوانین سایت منطبق بوده و جزو <a href=\"https://esam.ir/Service/Help.aspx?order=8_4\">فعالیت‌ها، مبادلات و کالاهای ممنوعه</a> نباشد.<br>\n<br>\nتوجه: چنانچه می خواهید یک کالای مجازی برای فروش ثبت کنید، بخش <a href=\"https://esam.ir/Service/Help.aspx?order=3_2\">فروش کالای مجازی</a> را مطالعه کنید.<br>\nهنگام انتخاب گروه هایی که هم ماهیت فیزیکی و هم مجازی دارند (مانند کتاب)، پنجره ای باز می شود و باید فیزیکی یا مجازی بودن کالا را انتخاب کنید.<br>\n<img alt=\"انتخاب فروش به صورت مجازی\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc43.jpg\"><br>\n<strong>نکته:</strong> فروشنده باید در مورد کالایی که برای فروش می گذارد، اطلاعات کافی و لازم را داشته باشد. همینطور باید نسبت به سلامت کالای خود آگاه باشد و اگر بخشی از آن معیوب است، حتما در جزییات کالا ذکر شود. اگر فروشنده از کارکرد درست آن مطمئن نیست، باید هنگام ثبت آن کالا، وضعیت آن را \"کالای معیوب یا غیر قابل استفاده\" انتخاب کند.<br>\n<br>\n<strong>انتخاب گروه کالا در فروشگاه</strong><br>\nدر صورتی که فروشگاه در ایسام ثبت کرده اید می توانید مشخص کنید این کالا در چه گروهی از فروشگاه شما قرار ‌گیرد.<br>\n<img alt=\"گروه فروشگاه\" src=\"https://esam.ir/images/HomePage/helpIMG/helpIMG-abc44.jpg\"><br>\nبرای ایجاد گروه در فروشگاه به ایسام من / فروشگاه / مدیریت گروه فروشگاه، مراجعه کنید و یا <a href=\"https://esam.ir/MyEsam/Store/StoreCategoryManagment.aspx\">اینجا</a> کلیک کنید.<br>\n<br>\n<a href=\"https://esam.ir/service/Help.aspx?order=3_1#C32\">قسمت اول: شرح کالا</a><br>\n<a href=\"https://esam.ir/service/Help.aspx?order=3_1#C33\">قسمت دوم: عکس های کالا</a><br>\n<a href=\"https://esam.ir/service/Help.aspx?order=3_1#C34\">قسمت سوم: مشخصات و توضیحات</a><br>\n<a href=\"https://esam.ir/service/Help.aspx?order=3_1#C35\">قسمت چهارم: نحوه فروش و قیمت</a><br>\n<a href=\"https://esam.ir/service/Help.aspx?order=3_1#C36\">قسمت پنجم: نحوه ارسال و هزینه</a><br>\n<br>\n<strong>مرحله 4: ثبت نهایی:</strong><br>\nپس از پر کردن تمام موارد فوق، لطفا روی دکمه ثبت نهایی کلیک کنید.<br>\nبا کلیک روی دکمه ثبت نهایی موافقت خود را با <a href=\"https://esam.ir/service/help.aspx\">قوانین و مقررات ایسام</a> اعلام نموده و مسئولیت صحت اطلاعات وارد شده را می‌پذیرید.<br>\nچنانچه می خواهید پیش از ثبت نهایی کالا، موارد ثبت شده را مرور کنید، بر روی دکمه پیش نمایش کلیک کنید.<br>\nهمینطور چنانچه قصد ثبت نهایی کالا را ندارید، می توانید بر روی دکمه \"ذخیره برای بعد\" کلیک کنید تا کالای شما ذخیره شود و بعدا آن را برای فروش در سایت قرار دهید.</p>', 'چگونه-بفروشم', 1, 4, '2022-06-24 16:09:45', '2022-06-24 16:09:45'),
(6, 'توافق نامه کاربری سایت ایسام', '<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\n	<tbody>\n		<tr>\n			<td>ه قسمت توافق نامه کاربر سایت \"ایسام\" خوش آمدید. خدماتی که در وب سایت esam.ir در دسترس شما میباشد توسط شرکت تجارت لناسام سهامی خاص ارائه می گردد. در صورت عدم توافق با این شرایط شما قادر به استفاده از خدمات سایت نخواهید بود.</td>\n		</tr>\n		<tr>\n			<td>ماده 1- طرفین توافق نامه</td>\n		</tr>\n		<tr>\n			<td>این توافق نامه فی ما بین شرکت تجارت لناسام ثبت شده به شماره 339393 به نشانی تهران، خیابان ولیعصر، بالاتر از دستگردی (ظفر)، خیابان بابک بهرامی، پلاک ۵۲، طبقه دوم از یک طرف و کاربران اینترنتی اعم از خریداران و فروشندگان از طرف دیگر در جهت تسهیل معاملات و افزایش امنیت در فضای اینترنتی منعقد می‏گردد. شرکت تجارت لناسام از این پس در این توافق نامه ایسام یا سایت نامیده می شود و کلیه حقوق مادی و معنوی آن در اختیار این شرکت قرار دارد.</td>\n		</tr>\n		<tr>\n			<td>ماده 2- موضوع توافق نامه</td>\n		</tr>\n		<tr>\n			<td>‏‎موضوع قرارداد عبارت است از ایجاد و ارائه شبکه‏ای مطمئن که در آن کاربران اینترنت، اعم از خریداران و فروشندگان، با استفاده از تسهیلات سایت اقدام به خرید و فروش اینترنتی می نمایند. کاربران اینترنتی می‏توانند در هر جای ایران، کالای مورد نظر خود را با استفاده از سایت www.esam.ir مورد مبادله قرار دهند.</td>\n		</tr>\n		<tr>\n			<td>ماده 3- مدت اعتبار توافق نامه</td>\n		</tr>\n		<tr>\n			<td>این توافق نامه از هنگامی که کاربر با آن موافقت می نماید تا زمانی که به یکی از دلایل قراردادی یا قانونی فسخ شود معتبر خواهد بود.</td>\n		</tr>\n		<tr>\n			<td>ماده 4- شروط توافق نامه</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-1- شرایط عضویت کاربر</td>\n		</tr>\n		<tr>\n			<td>در مورد اشخاص حقیقی، تنها اشخاص بالای 18 سال که مقیم ایران باشند می‌توانند به عضویت ایسام درآمده و از خدمات آن در مقام خریدار یا فروشنده استفاده نمایند.<br>\n			اشخاص حقوقی که در دفاتر ثبت شرکت‌ها و موسسات غیرتجاری جمهوری اسلامی ایران به ثبت رسیده باشند نیز می‌توانند عضو این سایت شده و از خدمات سایت استفاده نمایند.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-2- تعیین نام کاربری و رمز عبور</td>\n		</tr>\n		<tr>\n			<td>عضویت در \"ایسام\" رایگان است .جهت استفاده از خدمات سایت، کاربر میبایست هنگام ثبت نام ، نام کاربری و رمز عبور برای خود تعیین نماید. با انتخاب نام کاربری و رمز عبور و تایید آن توسط سایت، کاربر به عضویت سایت درآمده و مسئولیت کلیه امور انجام شده توسط وی در سایت ، بعهده ایشان خواهد بود در غیر این صورت مجاز به استفاده از خدمات ایسام نبوده و هرگونه دسترسی یا استفاده ، به معنای تجاوز به حقوق ایسام بوده که قابلیت پیگرد قانونی خواهد داشت. ایسام از اعضاء خود میخواهد، حتما شناسه کاربری و کلمه عبور خود را در صفحاتی که دارای آدرس ایسام دات آی آر (esam.ir) میباشد، وارد نمایند. بدیهی است در صورت وارد کردن اطلاعات در آدرس هایی بجز آدرسesam.ir مسئولیت و عواقب از دست رفتن اطلاعات و یا سرقت اطلاعات با کاربر مورد نظر میباشد. کاربر متعهد می شود تا رمز عبور مناسبی برای حساب کاربری خود تعیین نموده و به منظور حصول امنیت در دسترسی به حساب کاربری خود، شخصا مسئولیت حفظ و نگهداری آن را به عهده گیرد. در صورت عدم تعهد، سایت در قبال آن مسئولیتی نخواهد داشت. درصورت نیاز به رمز عبور جدید، کاربر موظف می باشد تا همه معیارها و فرایندهای حفاظتی شرکت را برای احراز هویت طی نموده و در صورتیکه نتواند هویت خود را اثبات نماید سایت این حق را برای خود محفوظ می دارد تا از دسترسی جزیی و یا کلی کاربر مربوطه ، جلوگیری نماید. در هنگام انتخاب نام کاربری نباید از اسامی خاص یا مارکهای تجاری استفاده شود. با انتخاب هر گونه نام کاربری که با شئونات اجتماعی، مذهبی، سیاسی و فرهنگی کشور مغایر باشد، سایت مجاز خواهد بود تا نسبت به ابطال آن اقدام نموده و کاربر حق هیچگونه اعتراض نخواهد داشت.<br>\n			تبصره 1- کاربر حق فروش، انتقال و استفاده از نام کاربری دیگران را نداشته و در صورت اثبات این موضوع ، سایت بدون اجازه کاربر حق ابطال آنرا خواهد داشت.<br>\n			تبصره 2- سایت ایسام مجاز است به صورت مستقیم یا غیرمستقیم اطلاعاتی را که برای تأیید هویت كاربر ضروری بوده کسب نماید. پرسش از خود كاربر برای دریافت اطلاعات تکمیلی ، درخواست تأیید پست الکترونیکی ، استعلام و تحقیق در مورد صحت اطلاعات مرتبط با کارت‌ها یا حساب‌های معرفی‌شده ، برخی از مصادیق این امر تلقی می‌شوند.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-3- اطلاعات مورد نیاز جهت عضویت</td>\n		</tr>\n		<tr>\n			<td>هنگامی که شما برای استفاده از خدمات سایت، ثبت نام می نمایید، اطلاعات تماس شامل نام ، نشانی و شماره تلفن ، آدرس پست الکترونیکی ، آدرس محل سکونت، اطلاعات بانکی شامل شماره کارت یا شماره حسابتان را در اختیار ما قرار می دهید. تا زمانی که شما مشتری ما باقی بمانید، اطلاعات با توجه به وضعیت حساب کاربری، نوع خدمات و کار سیستم، مدیریت می شوند.<br>\n			تبصره 3- کاربران ایسام میبایست هرگونه تغییر تلفن و آدرس خود را از طریق تیکت به اطلاع سایت برسانند. بدیهی است در صورت مشاهده اشکال در آدرس و تلفن، حساب کاربری خاطی، توقیف خواهد شد .<br>\n			تبصره 4- اگر شماره‌ کارت یا شماره حساب كاربر به هر دلیل تغییر نماید، در اسرع وقت موظف خواهد بود اطلاعات مربوطه را در سایت به روزرسانی نموده در غیر این صورت مسئولیتی متوجه سایت نخواهد بود. این اطلاعات در صفحه \"ایسام من\" در قسمت ویرایش مشخصات بانکی قابل دسترس میباشد .<br>\n			تبصره 5- ایسام اطلاعات دریافت شده از اعضا خود را فقط در امور مرتبط معاملاتی استفاده نموده و به هیچ وجه در اختیار سایرین قرار نخواهد داد. همچنین در صورت نیاز به انجام مقاصد تجاری با کسب اجازه از کاربر نسبت به بهره برداری از این اطلاعات، اقدام خواهد نمود .</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-4- امنیت اطلاعات كاربران</td>\n		</tr>\n		<tr>\n			<td>حفاظت از اطلاعات شخصی كاربران برای این سایت بسیار حائز اهمیت می باشد. جهت اطلاع از اقداماتی كه برای محرمانه ماندن اطلاعات کاربران صورت میگیرد، میتوانید <a href=\"https://esam.ir/service/Help.aspx?order=8_2\">حفظ حریم شخصی</a> را که لینک آن در زیر کلیه صفحات سایت موجود است مطالعه فرمایید</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-5- لغو عضویت</td>\n		</tr>\n		<tr>\n			<td>كاربر در هر زمان می تواند با مراجعه به فرم \"تماس با ما\"، درخواست لغو عضویت در ایسام را بدهد. ایسام حساب کاربر مورد نظر را غیرفعال می کند اما از پایگاه داده های خود خارج نمی کند. این کار به منظور نگهداری جزئیات کاربران و تراکنش های آنها، انجام می شود. با لغو عضویت، سایت کلیه‌ وجوه نزد خود را تا تعیین تکلیف نهایی حفظ خواهد کرد و كاربر حتی پس از لغو عضویت نسبت به تعهداتی که پیش از آن در ازای تراکنش‌های ثبت‌شده متقبل شده‌ مسئول خواهد بود.<br>\n			<br>\n			تبصره 6- در صورتی که کاربر، عملی خارج از قوانین و مقررات تعیین شده انجام دهد، سایت مجاز خواهد بود بدون اخطار پیشین عضویت کاربر را به حالت تعلیق در آورده و یا آن را ابطال نماید و طبق قوانین و مقررات با ایشان برخورد خواهد شد. کاربر با قبول این توافق نامه موافقت خود را مبنی بر ایفای تعهدات مندرج در <a href=\"https://esam.ir/service/Help.aspx?order=8_1\">قوانین و مقررات</a> و قبول تمامی مطالب درج شده در <a href=\"https://esam.ir/service/Help.aspx\">راهنما</a> اعلام می دارد.<br>\n			<br>\n			تبصره 7- با قبول این توافق نامه، شرکت مجازاست تا در صورت وقوع هر گونه تقلب، یا کشف احتمال تقلب و کلاهبرداری، عضویت کاربر را معلق و یا ابطال نماید و کاربر حق هیچگونه اعتراضی در این خصوص ندارد .</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-6- ارتباط میان کاربران با یکدیگر و سایت</td>\n		</tr>\n		<tr>\n			<td>ارتباط با کلیه بخشهای سایت از طریق \"تماس با ایسام\" ویا\"درخواست تماس باشما\" که لینک آن در صفحه اول سایت موجود است برقرار می‌گردد. ضمنا در مواقع ضروری سایت از طریق شماره تلفن هر كاربر با وی ارتباط برقرار می نماید. همچنین ارتباط کاربران با یکدیگر از طریق \"پیام های خصوصی\" می باشد و یا از طریق بخش \"سوال از فروشنده\" با یکدیگر ارتباط برقرار می کنند.<br>\n			<br>\n			تبصره 8- بر اساس این توافق نامه كاربر قبول می نماید کلیه اخطارها ، تذکرات و مکاتبات مربوطه، مندرج در سایت و یا ارسال شده به نشانی پست الکترونیک و یا نشانی پستی درج‌شده هنگام تکمیل درخواست عضویت، به رویت وی می‏رسد. در این صورت 24 ساعت پس از درج اخطار بر روی سایت یا ارسال آن به نشانی پست الکترونیک وی ، اخطار، ابلاغ شده تلقی گردیده و در صورت ارسال از طریق پست، اخطار مذکور پس از گذشت سه (۳) روز کاری ابلاغ شده تلقی می‌گردد. اگر كاربر پس از گذشت این مدت از ادامه‌ ارتباط الکترونیکی با ایسام منصرف گردد، سایت مجاز خواهد بود که کلیه حقوق کاربری وی را محدود و یا معلق نماید.<br>\n			<br>\n			تبصره 9- اگر علیرغم تلاش شبانه روزی پرسنل در جهت فعال بودن سایت، در بعضی از موارد به دلایل غیر ارادی و یا فورس ماژور دسترسی 24 ساعته کاربر به سایت مقدور نباشد، با پذیرش این توافقنامه کاربر حق هیچگونه اعتراض و اقامه دعوی در خصوص قطع تماس احتمالی و همچنین زیانها و خسارات احتمالی وارده ناشی از موارد مذکور را نداشته و این حق را از خود سلب می نماید.<br>\n			<br>\n			تبصره 10- طبق این توافق نامه ایسام تمامی پیام های کاربران به یکدیگر را کنترل می کند و پیام هایی که شامل هرگونه اطلاعات تماس، لینک سایر وب سایتها، توهین و تمسخر باشد را حذف و یا ویرایش می نماید.<br>\n			<br>\n			تبصره 11- چنانچه علیرغم تلاش پرسنل ایسام جهت کنترل پیامها، هرگونه پیام شامل توهین، تمسخر و اطلاعات تماس، توسط کاربر دیگری دریافت شود، سایت ایسام هیچ گونه مسئولیتی در قبال پیام ارسال شده و یا دریافت شده ندارد.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-7- شرح کالا</td>\n		</tr>\n		<tr>\n			<td>برای عرضه کالا می توانید از متن، عکس و گرافیک در گروه های مناسب استفاده کرده و مسئولیت استفاده از هر نوع ابزار فوق که مغایر با شئونات مذهبی، اجتماعی ،سیاسی و فرهنگی کشور باشد منحصرا متوجه کاربر خواهدبود. فروشنده می بایست ضمن تشریح کامل وضعیت کالا، کلیه شرایط مربوط به فروش آنرا نیز اعلام نموده و نوع فروش کالا نیز باید دقیقا در شرح آن درج شود .<br>\n			<br>\n			تبصره 12- سایت توضیحات محصولات، قیمت آن‌ها و آمار مربوط به فروشندگان یا سایر موارد را تأیید نمی‌کند. همچنین ادعا نمی‌کند که نتایج جست‌وجو لزوما کامل، دقیق، قابل‌اعتماد و به‌ روز باشد. این خدمت برای آگاهی بیشتر و کمک به خریداران طراحی شده و به معنای تایید یا تضمین کالاها و خدمات فروشندگان نیست.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-8- خرید و فروش</td>\n		</tr>\n		<tr>\n			<td>درصورتی که کاربر ، اقدام به فروش کالایی در سایت نماید، باید اطمینان داشته باشد که قانونا مجاز به فروش آن کالا می باشد. بعنوان یک خریدار، کاربر مجاز خواهد بود به یکی از سه روش زیر اقدام به خرید نماید:\n			<ol>\n				<li>کاربر کالایی را با قیمت ثابت در سایت خریداری نماید.</li>\n				<li>کاربر خریدار، پیشنهاد قیمتی کمتر از قیمت ثبت شده در سایت به فروشنده داده و فروشنده طی مهلت مقرر با قیمت پیشنهادی وی موافقت نماید.</li>\n				<li>در پایان مزایده ،خریداری که بیشترین پیشنهاد قیمت را اعلام نموده و بعنوان برنده مزایده شناخته می شود و از طرف سایت با ایمیل به ایشان اطلاع رسانی خواهد شد. خریدار برنده موظف خواهد بود طی 24 ساعت نسبت به خرید آن کالا اقدام کند، اگر خریدار ظرف این مدت مبلغ کالا را پرداخت نکند، قفل مزایده می شود و امکان شرکت در سایر مزایدات سایت را نخواهد داشت. سپس نفر دوم مزایده بعنوان برنده شناخته خواهد شد. ارائه پیشنهاد قیمت در یک مزایده به معنی قبول کردن کلیه شرایط مزایده، وضعیت و شرایط کالا بوده که در بخش مربوطه(صفحه فروش کالا) و توسط کاربر فروشنده تشریح شده است.<br>\n				پس از مشخص شدن برنده مزایده توسط سایت ، فروشنده موظف خواهد بود ظرف 36 ساعت ، کالا را آماده ارسال برای خریدار نموده و پس از ارسال در قسمت ایسام من، بخش فعالیت های من، بخش فروش، بخش پرداخت شده شماره بارنامه را جهت آگاهی خریدار و سایت وارد نماید.</li>\n			</ol>\n			<br>\n			<br>\n			تبصره 13- ابطال مزایده مجاز نیست و با تکمیل و ارسال فرم فروش کالا به سایت که توسط کاربر فروشنده صورت می پذیرد، خدمات سایت به کاربر عرضه شده و از آن پس کاربر حق ابطال روند عرضه کالا و یا مزایده آغاز شده را ندارد.<br>\n			<br>\n			تبصره 14- فروشنده ای که حداقل یک پیشنهاد قیمت معادل یا بالاتر از قیمت پایه کالا دریافت کند متعهد به فروش کالا به بالاترین قیمت ارائه شده می باشد مگر اینکه:\n			<ul>\n				<li>نام کالا در لیست کالاهای ممنوعه باشد.</li>\n				<li>خریداری که بالاترین قیمت را پیشنهاد نموده از عهده شرایط اعلام شده توسط فروشنده بر نیامده باشد. (مثلا روش پرداخت بهای کالا) و یا براساس مقررات و قوانین کشور مجاز به خریداری کالا نباشد.</li>\n				<li>مشخصات و شناسایی خریدار برای فروشنده امکان پذیر نباشد.</li>\n			</ul>\n			<br>\n			<br>\n			تبصره 15- کاربر حق اخلال در روند سالم مزایدات و دستکاری در قیمت کالاهایی که سایر اعضا آنها را برای فروش ارائه نموده اند ، نداشته و برای کالاهایی که شخصا برای فروش ارائه می نماید، نه بصورت مستقیم ونه غیرمستقیم مجاز به پیشنهاد قیمت نیست. ضمنا تبانی با دیگران جهت ارائه پیشنهاد قیمت ، برای کالای خود و یا استفاده از نام کاربری دیگران مجاز نخواهد بود.<br>\n			<br>\n			تبصره 16- انجام معامله خارج از سایت ایسام به هر شکلی مجاز نمی باشد. تبادل هرگونه اطلاعات تماس و یا دادن پیشنهاد جهت انجام معامله خارج از سایت ایسام ممنوع است. همینطور استفاده از هرگونه متنی شامل لینک های خرید سایت های دیگر و یا درج هرگونه اطلاعات تماس برای کاربران جهت تبلیغات یا ارایه خدمات خود مجاز نمی باشد.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-9- روش ارسال کالا</td>\n		</tr>\n		<tr>\n			<td>فروشندگان باید پس از فروش کالا نسبت به ارسال آن به خریدار از طریق پست های مورد تایید ایسام اقدام نمایند. این شرکت ها شامل پست پیشتاز جمهوری اسلامی، شرکت تیپاکس و شرکت TPG میباشند.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-10- مسئولیت فروشندگان</td>\n		</tr>\n		<tr>\n			<td>کاربر ایسام که به عنوان فروشنده فعالیت مینماید، موظف است نسبت به ارسال و تحویل کالا اقدام نماید. بدیهی است که هرگونه مسئولیت، در زمینه کیفیت یا کمیت کالای ارائه شده و نیز ارسال آن بر عهده فروشنده بوده و در صورت اعلام خریدار ، مبنی بر عدم دریافت کالا، فروشنده موظف به ارائه رسید ارسال کالا میباشد. فروشنده موظف است اطلاعات کامل خریدار را از سایت دریافت نماید. در بعضی از مواقع این امکان وجود دارد ، ایسام به منظور تطبیق اطلاعات ، جلوگیری از سوء استفاده و کلاه برداری با فروشنده و خریدار به صورت جداگانه تماس گرفته و در این صورت هر دو طرف موظف به ارائه اطلاعات به ایسام خواهند بود. هر نوع ضرر و زیانی که به هر نحو از سوی فروشنده به خریدار و یا از سوی خریدار به فروشنده وارد شود میبایست مابین طرفین حل و فصل شود. ایسام امکان گفتگوی دو طرفه را به منظور حل مشکلات از طریق بخش تیکت فراهم نموده و در صورت عدم حل مشکل، امکان پیگیری قضایی برای طرفین وجود دارد. چنانچه در نتیجه نقض این توافق نامه ضرر و زیانی از سوی هر یک از طرفین به ایسام، سایر کاربران و یا اشخاص ثالث وارد شود، مسئولیت جبران خسارت با ایشان خواهد بود.<br>\n			 \n			<ol>\n				<li>فروشنده موظف خواهد بود کالاهایی را که موجود نداشته در قسمت فروشگاه وارد ننموده و یا چنانچه موجودی کالایی در فروشگاه به صفر رسیده و امکان تهیه مجدد آن طی 24 ساعت وجود نداشته باشد نسبت به حذف آن کالا اقدام نماید.</li>\n				<li>از آنجاییکه هزینه حمل از خریدار دریافت می گردد، فروشنده موظف خواهد بود در هنگام تحویل کالا هزینه ارسال را نقدا پرداخت نماید. پس از وصول کالا توسط خریدار ، هزینه حمل دریافت شده از خریدار به همراه وجه کالا پس از کسر کسورات ، به حساب فروشنده واریز خواهد شد.</li>\n				<li>فروشنده موظف خواهد بود فقط از طریق یکی از راه های فوق، جهت ارسال کالا برای خریدار اقدام نماید.</li>\n				<li>در صورتیکه کالای ارسال شده جهت خریدار به دلایلی از قبیل مغایرت با اطلاعات وارد شده کالا در سایت، شکستگی و یا آسیب دیدگی از سوی خریدار مرجوع گردد، هیچ هزینه ایی به فروشنده از سوی سایت پرداخت نخواهد شد.</li>\n				<li>فروشندگان ملزم هستند در معاملاتی که در این سایت انجام می دهند الزامات این توافق نامه را مراعات نمایند و مندرجات این توافق نامه در تفسیر و تعبیر اختلافات طرفین ملاک عمل می باشد.</li>\n				<li>فروشنده ملزم می باشد در زمان مفقود شدن کالا، جهت استفاده از خدمات بیمه شرکت های حمل و نقل با توجه به قیمت کالا اقدام نماید.</li>\n			</ol>\n			</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-11- مسئولیت خریداران :</td>\n		</tr>\n		<tr>\n			<td>\n			<ol>\n				<li>در هنگام به وجود آمدن اختلاف بین خریدار و فروشنده، چنانچه طرفین به توافق نرسند، شکایت به بخش حل اختلاف ارجاع داده می شود. اگر طبق نظر بخش حل اختلاف مقرر شد که کالا باید مرجوع شود، هزینه حمل برای استرداد کالا به فروشنده به عهده طرفی خواهد بود که بخش حل اختلاف رای داده است. در صورتی که خریدار ظرف مدت 48 ساعت آن کالا را مرجوع نکند، مبلغ پرداختی به خریدار مسترد نخواهد شد و وجه برای فروشنده قابل برداشت خواهد بود.</li>\n				<li>خریدار در هنگام استرداد کالا موظف خواهد بود، فقط از طریق شرکت پست جمهوری اسلامی ایران، شرکت تیپاکس و یا تی پی جی جهت این امر استفاده نموده و اطلاعات بارنامه ارسالی را ظرف 24 ساعت کاری به سایت اعلام نماید. پس از تایید وصول کالا توسط فروشنده، وجه پرداختی بابت خرید آن کالا به حساب خریدار واریز خواهد شد.</li>\n				<li>خریدارانی که امتیاز آنها کمتر از 10 باشد حق شرکت در بیش از دو مزایده را نخواهند داشت.</li>\n				<li>خریداران ملزم هستند در معاملاتی که در این سایت انجام می دهند الزامات این توافق نامه را مراعات نمایند و مندرجات این توافق نامه در تفسیر و تعبیر اختلافات طرفیت ملاک عمل می باشد.</li>\n			</ol>\n			</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-12- روش پرداخت</td>\n		</tr>\n		<tr>\n			<td>خریداران می توانند با استفاده از کلیه کارت های عضو شتاب نسبت به خرید کالا های مورد نیاز خود اقدام نمایند.<br>\n			پس از واریز وجه توسط خریدار، قسمت حسابداری سایت از وصول پرداختی شما در حساب بانک اطمینان حاصل نموده و چنانچه پول از حساب شما کسر گردیده، ولی به حساب سایت واریز نشده باشد، طی تماس تلفنی این موضوع به فرستنده وجه اطلاع داده خواهد شد. خریدار نهایتا پس از اطلاع از این موضوع تا 48 ساعت صبر نموده و اگر طی این مدت وجه واریزی از سوی بانک مسترد نگردید، آنگاه با پشتیبانی بانک عامل پرداخت اینترنتی تماس گرفته و نسبت به رفع مغایرت اقدام نماید.<br>\n			<br>\n			تبصره 17- برای جلوگیری از زیان‌ها و خطرات احتمالی، سایت می‌تواند شیوه‌های پرداخت یک تراکنش را محدود نماید. در چنین مواردی، كاربر می‌تواند پس از اطلاع از این محدودیت‌ها، با استفاده از شیوه‌های باقی‌مانده تراکنش را انجام دهد.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-13- فعالیت‌ها، مبادلات و کالاهای ممنوعه</td>\n		</tr>\n		<tr>\n			<td>فروشندگان ابتدا باید از مطابقت داشتن فعالیتها، مبادلات و فروش کالای خود با قوانین سایت اطمینان حاصل نمایند. در صورت منطبق نبودن آنها با قوانین سایت، از انحام هر یک از این امور جلوگیری شده و همچنین ممکن است تغییرات دیگری نظیر ایجاد محدودیت در تسهیلات خرید و فروش و حتی بسته شدن حساب کاربر خاطی اعمال شود.<br>\n			لیست فعالیت‌ها، مبادلات و کالاهای ممنوعه که تحت هیچ شرایطی نمی توانند مورد خرید و فروش قرار گیرند به شرح فایل پیوست این توافق نامه <a href=\"https://esam.ir/service/Help.aspx?order=8_4\">(جهت مشاهده لیست اینجا را کلیک فرمایید)</a> می باشند.<br>\n			<br>\n			تبصره 18- موارد استثناء<br>\n			مواردی که مطابق این قرارداد مصداق فعالیت‌ها، مبادلات و کالاهای ممنوعه باشند در شمول حمایت‌های سایت قرار نخواهند گرفت.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-14- تعرفه های خدمات شرکت</td>\n		</tr>\n		<tr>\n			<td>تعرفه های مربوط به عرضه کالا و فروش آن در صفحه تعرفه های خدمات سایت درج گردیده است. <a href=\"https://esam.ir/service/Help.aspx?order=3_4\">( جهت مشاهده جدول تعرفه ها اینجا را کلیک نمایید)</a>. کارمزد های مندرج در صفحه مذکور هر سه ماه یک بار بازنگری و در صورت نیاز تغییر خواهند یافت . هزینه خدماتی که برای انجام معاملات و تدارک امنیت داد و ستدهای اینترنتی در ایسام فراهم شده برعهده فروشنده میباشد.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-15- روش تسویه حساب با فروشندگان</td>\n		</tr>\n		<tr>\n			<td>پس از فروش موفق کالا در سایت، مبلغ کالا و هزینه ارسال از خریدار دریافت گردیده و با ایمیل و اس ام اس به فروشنده اطلاع داده خواهد شد تا کالای خود را برای خریدار طبق سفارش داده شده، در زمان تعیین شده ارسال نماید. پس از تحویل و تایید کالا توسط خریدار، مبلغ واریز شده پس از کسر تعرفه خدمات و مالیات و عوارض ارزش افزوده به قسمت مبلغ قابل برداشت فروشنده اضافه می گردد. فروشندگان در صفحه صورتحساب، در قسمت حساب ایسام من ، درخواست انتقال وجه مبلغ قابل برداشت خود را ارسال نموده و پس از طی 48 ساعت کاری از تاریخ ارسال درخواست، مبلغ قابل برداشت، به حساب اعلام شده در صفحه مشخصات بانکی واریز می گردد.<br>\n			لازم به ذکر است تسویه حساب با کاربران در صورتی که با سایر بندهای توافق نامه کاربری مغایرت نداشته باشد، تنها از طریق شماره شبای ثبت شده در حساب کاربری در سایت ایسام انجام می شود<br>\n			اگر خریدار دریافت کالا را تا 5 روز پس از ثبت بارنامه توسط فروشنده تایید نکند، در این مدت مبلغ پرداختی به حساب فروشنده واریز نخواهد شد. پس از سپری شدن این مدت و تایید نشدن کالا توسط خریدار، از بخش پشتیبانی ایسام برای تایید تلفنی کالا با خریدار تماس گرفته می شود. چنانچه طی مدت 24 ساعت دو بار بخش پشتیبانی با خریدار تماس بگیرد و خریدار پاسخگو نباشد، سیستم به صورت خودکار کالا را تایید می کند و مبلغ واریزی به حساب فروشنده واریز می شود.<br>\n			اگر خریدار هنگام تایبد کالا فیدبک ناراضی بدهد، مبلغ کالا تا 7 روز پس از تاریخ ثبت بارنامه توسط فروشنده، غیر قابل برداشت است و طی این مدت خریدار باید شکایت خود را مطرح کند. در صورت مطرح کردن شکایت، اختلاف به سایت ایسام ارجاع داده می شود. سپس سایت با توجه به ادله دو طرف و طبق قوانین موجود دارای حق تصمیم گیری در مورد آزادسازی بخشی و یا تمامی مبلغ مبادله برای هر دو طرف و یا تنها یک طرف منازعه می باشد.<br>\n			در صورتی که خریدار طی این مدت (یعنی 7 روز) شکایت نکند، پس از آن مبلغ واریزی برای فروشنده قابل برداشت می شود.<br>\n			<br>\n			موجودی حساب فروشنده، مبلغی است که خریدار بابت خرید کالا به شرکت ایسام پرداخت کرده ولی کالا را دریافت نکرده یا دریافت کرده و تائید نکرده و یا از خرید خود راضی نبوده و به ایسام شکایت کرده، این وجه بعنوان امانت در حساب شرکت باقی مانده و قابل برداشت نخواهد بود.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> 4-16- امتیازات اعضاء</td>\n		</tr>\n		<tr>\n			<td>پس از مبادله هر کالا، خریدار و فروشنده می توانند نظرات مثبت، خنثی و یا منفی خود را در خصوص روش عملکرد طرف مقابل ارائه نموده و آنرا در سوابق طرف مقابل در کنار نام کاربری جهت اطلاع سایرین ثبت نمایند. روش \"امتیاز کاربر\" که در سایت مورد استفاده قرار گرفته به کاربران کمک می نماید تا سابقه سایر اعضاء را مشاهده نمایند. به کاربران توصیه میشود قبل از معامله با هر کاربر \"امتیاز کاربر\" مورد نظر را بررسی نمایند. اعلام نظر مثبت ، یک امتیاز مثبت، خنثی صفر امتیاز و منفی یک امتیاز منفی برای طرف مقابل محاسبه می شود . سایت مجاز خواهد بود در صورتی که امتیاز هر یک از اعضا به 2- برسد، به صورت اتوماتیک حساب کاربری آن عضو را معلق نموده و حق استفاده از خدمات سایت را سلب نماید. امتیاز هر عضو در حقیقت شهرت و اعتبار وی در سایت می باشد که سایرین می توانند بر اساس آن در خصوص قابل اطمینان بودن یا نبودن وی بعنوان طرف یک معامله قضاوت نمایند. در صورت پرداخت وجه کالا توسط خریدار، سایت به صورت خودکار یک امتیاز مثبت برای وی در نظر میگیرد.</td>\n		</tr>\n		<tr>\n			<td>ماده 5- حل اختلافات</td>\n		</tr>\n		<tr>\n			<td>خریداران و فروشندگان در صورت داشتن شکایت، اختلاف و یا مواجه با بروز مشکلات در امر خرید و فروش می بایست با مراجعه به بخش حل اختلاف که دسترسی به آن از طریق صفحه \"ایسام من\" میسر شده، مورد حمایت ایسام قرار گیرند.</td>\n		</tr>\n		<tr>\n			<td>  <img alt=\"\" src=\"https://esam.ir/images/HomePage/Bullet_flesh.gif\"> حل اختلافات از طریق داوری ایسام</td>\n		</tr>\n		<tr>\n			<td>در سایت یک سیستم پرسش و پاسخ ایجاد گردیده که در صورت بروز مشکل، خریدار و فروشنده موظف خواهند بود تا از این طریق مشکلات شان را با یکدیگر مطرح و اقدام به حل آن نمایند. این سیستم شکایت شاکی را ثبت نموده و شماره پیگیری جهت اقدامات بعدی صادر می نماید. قسمت حل اختلاف سایت با استفاده از این سیستم قادر خواهد بود تا در جریان اختلاف ایجاد شده و ریز گفتگوی طرفین قرار گرفته و در نهایت نسبت به صدور رای عادلانه اقدام نماید. سایت مسئولیتی در قبال حل اختلاف ، در خارج از این چهارچوب تعیین شده نخواهد داشت.<br>\n			<br>\n			تبصره 19- در صورتیکه قسمت حل اختلاف سایت نظر نهایی ، در مورد حل یک اختلاف را اعلام نموده و لیکن طرفین آن نظر را اجرا ننمایند ، دیگر حق طرح هیچ گونه شکایتی در این مورد را نخواهند داشت.<br>\n			تبصره 20 - اگر ثابت شود که دعوای مطرح‌ شده از طرف کاربر واهی بوده، کاربر موظف است خسارات وارده به ایسام را مطابق نظر داور رسیدگی‌کننده به آن بپردازد و در صورتیکه کاربری با مشكل روبرو شده و ایسام را در بروز آن مقصر بداند، لازم است ابتدا موضوع را با خود سایت در میان گذاشته تا با مذاکره و رسیدگی دقیق‌تر نسبت به حل مساله اقدام شود.</td>\n		</tr>\n		<tr>\n			<td>ماده 6- اقدامات و اختیارات سایت</td>\n		</tr>\n		<tr>\n			<td>ایسام در قطع، محدود نمودن و یا لغو ارایه خدمات خود به کاربران مختار است<br>\n			همچنین اگر بر اساس دلایل و شواهد قطعی مشخص گردد که کاربر در فعالیت‌ها و مبادلات ممنوعه یا کالاهای غیر مجاز دخالت داشته‌، به منظور جلوگیری از ورود ضرر و زیان به کاربران، اشخاص ثالث و سایت، اقدامات احتمالی شامل موارد زیر را اتخاذ خواهد نمود:\n			<ol>\n				<li>توقف انجام تراکنش‌ها، تعلیق یا ایجاد محدودیت دسترسی کاربر به سایت و یا لغو عضویت</li>\n				<li>اصلاح اطلاعات نادرستی که به سایت داده‌ شده است</li>\n				<li>اطلاع به مشتریان، بانک و سایر کاربران در مورد فعالیت‌های کاربر خاطی</li>\n				<li>امتناع از ارائه‌ی خدمات آتی</li>\n				<li>تعقیب و پیگرد قانونی، سایت این حق را برای خود محفوظ می‌دارد که به تشخیص خود و با اطلاع قبلی به این توافق نامه خاتمه داده و یا دسترسی کاربر به سایت را قطع نماید.</li>\n				<li>قطع خدمات و یا محدودیت دسترسی به صفحه کاربری</li>\n				<li>نقض شرایط استفاده از خدمات اینترنتی سایت</li>\n				<li>اگر کاربر شرایط استفاده از خدمات ایسام را نقض کند، سایت می‌تواند از طرق قانونی خسارات وارد شده را مطالبه نماید.</li>\n				<li>حذف و یا ویرایش پیام های ارسالی کاربران به یکدیگر و یا پیام های بخش سوال از فروشنده</li>\n			</ol>\n			<br>\n			در صورتی که ارائه خدمات به کاربر قطع یا محدود و یا لغو گردد، ، مراتب به وی ابلاغ خواهد شد. در این موارد کاربر می‌تواند تقاضای رفع این محدودیت‏ها را مطرح نماید تصمیم‏گیری نهایی در این خصوص با سایت خواهد بود.<br>\n			اگر به هر دلیلی كاربر به سایت بدهکار باشد (مثلا مشکلات بانکی و غیره)، فورا اقدامات لازم جهت وصول طلب انجام خواهد شد. كاربران موظفند نهایت سعی خود را جهت تسهیل و تسریع این امر به كار بندند. اگر موجودی كاربر کافی نباشد، با کسری موجودی مواجه شده و باید سریعا نسبت به تامین موجودی کافی اقدام نماید. در غیر این صورت ایسام جهت وصول مطالبات خود، از طرق دیگری که مناسب تشخیص دهد ، اقدام خواهد نمود. اگر نسبت به یک تراکنش شکایتی مطرح شود، سایت ادامه مبادلات را تا حصول نتیجه قطعی به تعویق می‌اندازد. اگر حکم به نفع فروشنده صادر شده و یا تراکنش به دلیل حمایت سایت از فروشندگان صحیح تشخیص داده شود، مبلغ مورد اختلاف به فروشنده مسترد خواهد شد در غیر این صورت مبلغ مورد اختلاف به خریدار باز گردانده می‏شود.<br>\n			در جهت حفط منابع سایت و همچنین جلوگیری از سوء استفاده احتمالی ،فروشگاه های آزمایشی، غیر فعال، بدون محتوا و محصول حذف خواهد شد.</td>\n		</tr>\n		<tr>\n			<td>ماده 7- حقوق و مالکیت سایت</td>\n		</tr>\n		<tr>\n			<td>دامنه «esam.ir»، نام «ایسام»، لوگو و سایر علائم تجاری ثبت شده، محصولات و خدمات درج شده در سایت، متعلق به ایسام بوده و بدون کسب اجازه کتبی، هر گونه کپی برداری و استفاده از موارد فوق ممنوع خواهد بود. علاوه بر این، اسناد، توافقنامه‏ها، فرم‏ها، درخواست‏ها، طرح سربرگ صفحات، شکل‌های گرافیکی و دکمه‌ها در مالکیت انحصاری ایسام بوده و بدون کسب اجازه کتبی کپی‌برداری از آن‌ها ممنوع است. مالکیت و منافع کلیه حقوق سایت ایسام و مندرجات آن منحصرا متعلق به ایسام و شرکت ایسام خواهد بود.</td>\n		</tr>\n		<tr>\n			<td>ماده 8- قانون حاکم</td>\n		</tr>\n		<tr>\n			<td>قانون حاکم بر این توافق نامه کلیه‏ی قوانین و مقررات کشور جمهوری اسلامی ایران می‏باشد.</td>\n		</tr>\n		<tr>\n			<td>ماده 9- شرایط عدم مسئولیت و عدم تضمین</td>\n		</tr>\n		<tr>\n			<td>9-1 شرط عدم مسئولیت<br>\n			سایت و هیچ یک از ارگان‏های اصلی یا فرعی آن به هیچ وجهی، مسئول خسارات اتفاقی، غیرقابل ‌پیش‌بینی، تبعی و عدم‌النفع در قبال کاربران نیست. مسئولیت ایسام، شرکت ایسام و کارکنان آن محدود به خسارات مستقیم و بلاواسطه ایی است که با اثبات تقصیر سایت به کاربران یا اشخاص ثالث وارد شده است. در صورتی كه ثابت شود ورود خسارت در نتیجه اهمال، تقصیر و یا نقض تعهدات قانونی یا قراردادی كاربر بوده، سایت و شرکت ایسام مسئول پرداخت هیچ خسارتی نخواهند بود. همچنین در صورتی كه احراز گردد وقوع حالت فورس ماژور یا قوه قهریه باعث ایجاد خسارت گردیده، سایت و شرکت از مسئولیت برئ خواهند بود.<br>\n			<br>\n			9-2 با پذیرش این توافقنامه کاربران قبول می کنند شرکت و سایت هیچگونه مسئولیتی در خصوص ادعاها و مطالب گمراه کننده، نادرست، مضر و موهن مندرج در سایت ندارد. بدیهی است به محض اطلاع و رویت هر گونه اطلاعات غیر اخلاقی، غیرشرعی و ناهنجار، اطلاعات مذکور از سایت حذف خواهد شد.<br>\n			<br>\n			9-3 سایت هیچگونه مسئولیتی در خصوص زیان ها و خسارات احتمالی ناشی از عملکرد شرکت و پرسنل به اعضا نداشته و حداکثر خسارات قابل پرداخت معادل کارمزد خدمات ارائه شده به شخص مدعی ، خواهد بود.<br>\n			<br>\n			9-4 ایسام در مورد صحت اظهارات كاربران در خصوص کسوراتی از قبیل مالیات، عوارض و دیگر مطالبات قانونی که به مبالغ دریافتی یا پرداختی تعلق می‏گیرد، هیچ مسئولیتی ندارد و مسئول پرداخت این کسورات نخواهد بود.<br>\n			<br>\n			9-5 عدم تضمین: سایت خدمات خود را تنها طبق شروطی که در این توافق نامه بیان شده ارائه می‌نماید و هیچ تضمین و شرط اضافی دیگر را نپذیرفته و تضمین نمی نماید که خریدار یا فروشنده به همه شروط معامله پایبند باشند.</td>\n		</tr>\n		<tr>\n			<td>ماده 10- عدم اسقاط حق</td>\n		</tr>\n		<tr>\n			<td>عدم تعقیب یا چشم‌پوشی سایت از نقض برخی تعهدات توسط کاربران به معنای اسقاط حق رسیدگی و تعقیب این تخلفات نیست و در آینده می‌توان این تخلفات را تحت تعقیب قانونی قرار داد. بنابراین، طرح ادّعای مرور زمان از سوی كاربر به هیچ وجه قابل قبول نخواهد بود.</td>\n		</tr>\n		<tr>\n			<td>ماده 11- اصلاح توافق نامه</td>\n		</tr>\n		<tr>\n			<td>امکان بازنگری و یا اصلاح کلی و یا جزیی این توافق نامه در طی زمان وجود داشته و در صورت انجام این امر نسخه ی بازنگری شده بر روی سایت قرار گرفته و از زمان درج نسبت به همه‏ی كاربران عضو موثر خواهد بود.</td>\n		</tr>\n		<tr>\n			<td>ماده 12- شرایط فورس ماژور</td>\n		</tr>\n		<tr>\n			<td>عمل به مفاد این توافق نامه در شرایط خارج از اراده از قبیل قطعی سیستم اینترنت و... و فورس ماژور شامل سیل، زلزله، صاعقه ، آتش سوزی و غیره مستثنی خواهد بود.<br>\n			این توافق نامه در 12 ماده و 20 تبصره به رویت کاربر رسیده و با تایید در هنگام عضویت، از آن پس پذیرش بدون قید و شرط این قرارداد لازم الاجرا خواهد بود.</td>\n		</tr>\n	</tbody>\n</table>', 'توافق-نامه-کاربری-سایت-ایسام', 1, 6, '2022-06-24 16:15:38', '2022-06-24 16:15:38'),
(7, 'حفظ حریم شخصی کاربران', '<p>خط مشی صیانت از حریم شخصی کاربران<br>\n<br>\nسایت ایسام، حریم شخصی اعضاء و بازدید کنندگان را محترم می شمارد و به حفاظت از اطلاعات شخصی اعضاء و بازدید کنندگان خود پایبند است. ما هیچگونه اطلاعات شخصی شما را در هنگام بازدید از سایت جمع آوری نمی کنیم، مگر اینکه شما، آن اطلاعات را در فرم عضویت سایت و یا فرمهای دیگر در اختیار ما قرار دهید. شما می توانید مطمئن باشید که این اطلاعات تنها برای حفظ ارتباط ما و شما مورد استفاده قرار خواهد گرفت.<br>\n<br>\n<br>\n سایت ایسام چه نوع اطلاعاتی را جمع آوری می کند؟<br>\n<br>\nهنگامی که شما از سایت ایسام بازدید می کنید، وب سرور ما اطلاعات پایه شما را جمع آوری می کند. این اطلاعات درباره نام دامنه، زمان بازدید، صفحاتی که از آن بازدید کرده اید، خواهد بود و شامل اطلاعات هویتی نمی باشد، به جز مواقعی که برای جلوگیری از کلاهبرداری و سوء استفاده از سیستم مورد نیاز باشد. هنگامی که شما برای استفاده از خدمات سایت، ثبت نام می نمایید، اطلاعات تماس شامل نام، نشانی، شماره تلفن و اطلاعات بانکی شامل شماره شبا یا شماره حسابتان را در اختیار ما قرار می دهید. تا زمانی که شما مشتری ما باقی بمانید، اطلاعات با توجه به وضعیت حساب کاربری، نوع خدمات و کار سیستم، مدیریت می شوند. به علاوه ممکن است نامه های الکترونیکی مشتری و سایر مراسلات و مکاتبات با مشتری در صورت لزوم ذخیره شوند.<br>\n<br>\n<br>\n ما اطلاعات را چگونه استفاده می کنیم؟<br>\n<br>\nسایت ایسام اطلاعات شخصی شما را مورد مبادله یا اجاره یا فروش، به هیچ شخص حقیقی یا حقوقی ثالث قرار نخواهد داد. ما از اطلاعات تماسی که در اختیار ما نهاده اید در جهت برقراری خدمات به شما استفاده می نماییم. در همین راستا ممکن است اطلاعات تماس شما جهت استفاده از خدمات حمل و نقل و ارسال مرسوله در اختیار شرکت های حمل و نقل طرف قرارداد با ایسام قرار گیرد. همچنین از اطلاعات بانکی شما نیز تنها در فرایند پرداخت استفاده خواهیم نمود. سایت ایسام فقط اطلاعات تماس تان را به اشخاص طرف قرارداد با شما جهت انجام معاملات ارایه خواهد نمود.<br>\nما اطلاعات شخصی و حساب کاربری مشتری را فاش نخواهیم کرد، مگر اینکه متقاعد شویم افشای این اطلاعات در جهت شناسایی یا تماس یا اقامه دعوی علیه کسی باشد که باعث صدمه و خسارت به حقوق و اموال سایت ایسام یا اعضاء سایت ایسام یا دیگران شده باشد. ما ممکن است اطلاعاتی را مطابق با قانون در جایی که سایت ایسام متقاعد شود که قانون نیازمند این اطلاعات است، در اختیار مقامات قضایی قرار دهیم.<br>\nسایت ایسام همچنین محتویات هیچ نامه الکترونیکی، یا مراسلات و مکاتباتی که برای اعضاء خود ذخیره کرده و لیکن برای هیچ شخص ثالثی افشا نخواهد کرد، مگر در مواردی که: (الف) موضوع سلامت و ایمنی عمومی مطرح باشد، (ب) در ارتباط با انتقال اموال تجاری دیگری به مشتری باشد، (ج) مورد نیاز برای انجام سفارش، خدمات پس از فروش، بررسی های حقوقی باشد که سایت ایسام به صلاحدید خود منفردا آن را، لازم بداند. (د) لازم باشد که برای پیگیری امور قانونی در اختیار مقامات قضایی قرار گیرد.<br>\nتوجه داشته باشید که سایت ایسام ممکن است اطلاعات جمع آوری شده را در جهت اطلاع رسانی محصولات و خدمات خود مورد استفاده قرار دهد.<br>\n<br>\n<br>\n کوکی ها(Cookies)<br>\n<br>\nاطلاعاتی که تحت عنوان کوکی در رایانه کاربر ذخیره می شود به ما کمک می کند نوع اعضاء، جاذبه های وب سایت و اینکه کدام محصول پرطرفدارتر است را متوجه شویم.استفاده از اطلاعات مذکور راندمان فروش را تا حد بسیار بالایی افزایش می دهد.<br>\n<br>\n<br>\n حریم شخصی کودکان<br>\n<br>\nسایت ایسام محصول به کودکان نمی فروشد. اعضاء سایت ایسام باید حداقل 18 سال سن داشته باشند.<br>\n<br>\n<br>\n تغییر در قوانین و مقررات سایت<br>\n<br>\nسایت ایسام حق تغییر قوانین و مقررات را در هر زمان که لازم بداند، دارد. ما به شما توصیه می کنیم که به صورت دوره ای برای اطلاع از این تغییرات، به سایت مراجعه کنید. پس از هر تغییر فرض ما بر این است که شما آن تغییر را پذیرفته اید. نسخه قابل استناد این سند آخرین نسخه موجود در سایت خواهد بود.<br>\n<br>\n<br>\n تماس با ما<br>\n<br>\nاگر شما پرسش یا نگرانی در مورد این سند خط مشی دارید، می توانید آن را از طریق لینک تماس با ما در پایین صفحات سایت مطرح کنید.</p>', 'حفظ-حریم-شخصی-کاربران', 1, 6, '2022-06-24 16:16:01', '2022-06-24 16:18:23');
INSERT INTO `faqs` (`id`, `question`, `answer`, `slug`, `status`, `faq_category_id`, `created_at`, `updated_at`) VALUES
(8, 'قوانین مرتبط با اختلافات در معاملات', '<p>توضیحات کلی در مورد آشنایی با فعالیت سایت<br>\nخدمات معاملاتی و بازرگانی وب سایت ایسام به دو بخش تقسیم می شود. بخش اول فروشندگان که به عنوان عرضه کننده فعالیت می نمایند و بخش دوم خریداران که با استفاده از خدمات سایت ایسام ، محصولات عرضه شده را خریداری می نمایند. خدمات مدیریت مالی و حسابداری سایت توسط واحد مالی حمایت می گردد، تا بتوانیم محیطی امن برای تجارت شما ایجاد نموده و همچنین میزان سود دهی افراد در معاملات را افزایش داده و از حقوق خریدار و فروشنده محافظت نماییم.<br>\n<br>\nچنانچه در یک معامله، اختلافی بین خریدار و فروشنده به وجود آید، دو طرف برای حل اختلاف به مذاکره با یکدیگر فراخوانده می شوند. درصورت درخواست هریک از طرفین، سایت نیز برای رسیدن به یک تفاهم طرفین را یاری خواهد کرد. با این وجود، چنانچه یک هفته پس از طرح شکایت و یا 7 روز پس از درخواست برای استرداد مبلغ مبادله، همچنان دو طرف به توافقی نرسیده باشند، موضوع برای تصمیم گیری به خود سایت ارجاع داده شده سپس از طرفین درخواست می شود تا مدارک خود را ارایه نمایند. طرفین موظف خواهند بود که برای رسیدگی به موارد اختلاف، تابع قوانین سایت باشند.<br>\nموافقت طرفین بدین معنا می باشد که سایت ایسام با توجه به نقش خود به عنوان داور مرضی الطرفین (طبق آیین دادرسی مدنی- کتاب اول، بابت هفتم، داوری / مواد ۴۵۴ الی ۵۰۱) و بر پایه قوانین سایت، حق تصمیم گیری برای حل اختلاف به وجود آمده را دارا می باشد. سایت مسئولیتی در قبال حل اختلاف در خارج از این چهارچوب تعیین شده نخواهد داشت.<br>\nهمینطور در صورتی که بخش حل اختلاف سایت ایسام نتواند بر اساس مستندات موجود تصمیم گیری کند این حق را دارد تا مراجعه طرفین دعوی به مراجع ذی صلاح قضایی و طرح شکایت از طرف مقابل، وجه دریافت شده کالا را به عنوان امانت نزد خود نگاه دارد.<br>\n<br>\nتبصره 1- در صورتی که قسمت حل اختلاف سایت نظر نهایی، در مورد حل یک اختلاف را اعلام نموده و لیکن طرفین آن نظر را اجرا ننمایند، دیگر حق طرح هیچ گونه شکایتی در این مورد را نخواهند داشت.<br>\nاین قوانین شامل فعالیت های غیر قانونی اعضاء نبوده و در صورتی که محصولی برخلاف قوانین و مقررات به فروش برسد، سایت ایسام حق لغو و یا تعلیق هر معامله ای را برای خود محفوظ داشته و طبق توافق نامه میتواند حساب کاربری اشخاص خاطی را مسدود نماید.<br>\n<br>\n1-1 محل تحویل کالا به خریدار<br>\nکالا به آدرس ثبت شده خریدار در سایت ارسال خواهد شد. چنانچه در هنگام خرید، آدرس جدیدی قید نشده باشد، آدرسی که خریدار در سایت عنوان نموده، به عنوان محل تحویل در نظر گرفته خواهد شد. هنگام مرجوع شدن کالا، آدرس تحویل فروشنده، همان آدرسی که در حساب کاربری ذکر شده، در نظر گرفته خواهد شد.<br>\n<br>\n2-1 مسئولیت انتقال کالا<br>\nمسئولیت ارسال کالا جهت تحویل به خریدار، به عهده فروشنده خواهد بود و چنانچه کالای ارسالی توسط شرکت های حمل کننده هرگونه آسیبی دید و یا مفقود شد، مسئولیت پیگیری آن از شرکت های حمل کننده با فروشنده می باشد.<br>\n<br>\n3-1 لغو مبادله<br>\nممکن است خریدار از خرید کالا صرف نظر نموده و خواهان استرداد مبلغ مبادله، پیش از اقدام فروشنده برای ارسال کالا باشد. در این گونه موارد چنانچه فروشنده همچنان (علی رغم لغو معامله توسط خریدار) به ارسال کالا مبادرت ورزد، مسئولیت و عواقب ارسال کالا به عهده فروشنده بوده و خریدار ملزم به تحویل گرفتن کالا نخواهد بود. چنانچه پیش از لغو معامله توسط خریدار، فروشنده اقدام به ارسال کالا کرده و در این مورد، هنوز خریدار را مطلع نکرده باشد، با توجه به قوانین و مقررات سایت درخواست لغو مبادله و استرداد مبلغ آن، توسط خریدار منتفی خواهد بود.<br>\n<br>\n4-1 کالاهای ممنوعه<br>\nچنانچه خریدار و فروشنده با قصد قبلی اقدام به معامله کالاهای ممنوعه که نقض قوانین سایت و همچنین تخطی از قانون محسوب می شود، نمایند سایت ایسام دارای این حق خواهد بود که از واریز مبلغ مبادله امتناع ورزیده و عمل تخطی از قانون را به مقامات دولتی و اجرایی مرتبط اطلاع دهد.<br>\n<br>\n5-1 مسئولیت صحت و سلامت کالا<br>\nچنانچه کالای ثبت شده توسط فروشنده دارای گارانتی باشد یا نباشد، مسئولیت صحت و سلامت کالا هنگام تحویل به خریدار به عهده فروشنده است و فروشنده می بایست کالای سالم و بدون نقص به دست خریدار برساند.<br>\n<br>\n6-1 روش و مبلغ ارسال<br>\nفروشنده موظف است کالا را با روش ارسال و مبلغ ارسالی که هنگام ثبت کالا مشخص کرده است، ارسال کند. چنانچه فروشنده هر کدام از گزینه های ارسال کالا را انتخاب کرده باشد، موظف به ارسال کالا به همان صورت می باشد. عدم ارسال کالا طبق گزینه انتخاب شده، تخلف محسوب می شود و فروشنده موظف به پرداخت مابه تفاوت هزینه ارسال به خریدار است.<br>\n<br>\n1-2 مطابقت داشتن کالا با مشخصات ذکر شده در صفحه فروش<br>\nامضای خریدار بر روی رسید کالا، هنگام تحویل گرفتن آن، به منزله رسید دریافت کالا توسط او تلقی می شود.<br>\nچنانچه خریدار بر این عقیده باشد که کالای تحویل شده با کالای سفارش داده شده مطابقت ندارد، بلافاصله باید به صفحه حل اختلاف در بخش \"ایسام من\" مراجعه و با انتخاب گزینه \" کالایی را که دریافت کرده ام با شرح ارایه شده در مشخصات مطابقت ندارد\" و وارد کردن شماره کالا شکایت خود را ثبت کند.<br>\n<br>\n2-2 عبارت \"مطابقت داشتن ظاهری کالای تحویل گرفته شده با کالای سفارش داده شده \" به این معنی خواهد بود که از لحاظ ظاهری (با چشم انسان و یا ابزار ساده اندازه گیری) دارای شرایطی مناسب و مشابه همان عکس کالا که در درون سایت قرار داده شده، باشد و با مشخصات ذکر شده توسط فروشنده شامل شکل و شمایل آن، وزن، رنگ، مدل، آکبند بودن کالا، تعداد و ... یکسان باشد.<br>\n<br>\nتبصره 2: مطابقت نداشتن رنگ کالا با رنگ تصویر درج شده در صفحه فروش، به معنای تفاوت کامل رنگ می باشد و تیرگی و روشنی رنگ به معنای عدم تطابق رنگ نیست. به عنوان مثال چنانچه گوشی آبی در صفحه فروش ثبت شده باشد اما گوشی که خریدار دریافت کرده است، قرمز است، می تواند به دلیل عدم تطابق رنگ شکایت مطرح کند. اما اگر گوشی دریافتی خریدار آبی کمرنگ تر یا تیره تر و یا رنگ های مشابه آبی باشد، شکایت وارد نیست. زیرا ممکن است مانیتور و یا دوربین عکاسی مقداری از طیف رنگ را تغییر دهد و رنگ تصویر کالا با رنگ کالا کمی متفاوت باشد و این موضوع توسط ایسام قابل پیگیری نیست. برای دریافت راهنمایی بیشتر در مورد عکاسی صحیح لطفا <a href=\"http://blog.esam.ir/%D8%A8%D8%A7%DB%8C%D8%AF-%D9%87%D8%A7-%D9%88-%D9%86%D8%A8%D8%A7%DB%8C%D8%AF-%D9%87%D8%A7%DB%8C-%D8%B9%DA%A9%D8%A7%D8%B3%DB%8C-%D8%A7%D8%B2-%DA%A9%D9%81%D8%B4/\">اینجا</a> کلیک کنید.<br>\n<br>\n3-2 در صورتی که کالای ثبت شده اصل نباشد و فروشنده این موضوع را در صفحه فروش عنوان نکرده باشد و خریدار شکایت مطرح کند، هزینه برگشت کالا به عهده فروشنده است و 4 نمره از نمره فروش فروشنده کسر می شود. بنابراین در صورت عدم اعلام فروشنده در مورد اصل و یا کپی بودن کالا، کالای ثبت شده اصل در نظر گرفته می شود.<br>\n<br>\n4-2 چنانچه خریدار در زمان دریافت کالا در مکان مورد نظر حضور نداشته و شخص دیگری کالا را تحویل گرفته و رسید تحویل را امضاء کند (چه از طریق دست خط و یا به صورت الکترونیکی که توسط شرکت حمل کالا اعلام می شود) به منزله تحویل گرفتن کالا توسط خریدار تلقی خواهد شد.<br>\n<br>\n3- کیفیت<br>\n1-3 فروشنده ملزم می باشد تا اطمینان دهد که کالای ارسال شده با مشخصات ذکر شده مطابقت دارد. ممکن است از فروشنده درخواست شود تا گواهی ساخت و تولید سازنده و یا گواهی کیفیت کالا و پیش فاکتور و سایر مستندات دیگر را در صورت شکایت خریدار ارایه نماید.<br>\n2-3 در صورتی که نقص کالا با معاینه و بازرسی ظاهری کالا، قابل مشاهده بوده و این نقص باعث اختلال در عملکرد دستگاه و استفاده از آن گردد و یا هرگونه سند معتبری دال بر عدم مطابقت کالا ، با سفارش داده شده باشد، این کالا غیر منطبق با سفارش خریدار در نظر گرفته می شود. مطابقت نداشتن شامل موارد زیر می گردد:</p>\n\n<ul>\n	<li>کالایی را که خریدار دریافت می کند، به طور کامل با سفارش داده شده از لحاظ مشخصات ظاهری مطابقت نداشته باشد.</li>\n	<li>خریدار کالای نو و آکبند سفارش داده ، اما کالای دست دوم برای او ارسال شده است.</li>\n	<li>کالای ارسالی به خریدار جعلی باشد.</li>\n	<li>تعداد و کمیت کالای ارسالی، از تعداد سفارش داده شده خریدار کمتر باشد.</li>\n	<li>کالای تحویل گرفته شده ناقص باشد، مثلا بخشی از آن مفقود شده باشد.</li>\n</ul>\n\n<p><br>\n<br>\n3-3 شکایت مربوط به مطابقت نداشتن کالا با مشخصات ذکر شده در صفحه فروش، در این گونه موارد پذیرفته نخواهد شد:</p>\n\n<ul>\n	<li>نقص کالا در صفحه فروش ذکر شده باشد.</li>\n	<li>در صفحه فروش، وضعیت کالا \"کالای معیوب یا غیرقابل استفاده\" باشد.<br>\n	نکته 1: در صورت ثبت کالای معیوب یا غیر قابل استفاده، لازم است فروشنده ایراد محصول را واضح در توضیحات کالا درج نماید.<br>\n	نکته 2: در صورت ثبت کالای معیوب یا غیر قابل استفاده، در صورتی که فروشنده در توضیحات و یا پاسخ به سوالات خریداران به سالم بودن بخش هایی از کالا اشاره کرده باشد، کالا باید با آن توضیحات مطابقت داشته باشد.</li>\n</ul>\n\n<p><br>\n4-3 خریدار ملزم به ارایه دلیل مناسب، برای اثبات ادعای خود مبنی بر مطابقت نداشتن کالا با مشخصات ذکر شده در صفحه فروش می باشد. چنانچه خریدار موفق به جمع آوری و ارایه تمام و یا بخشی از ادله برای اثبات ادعای خود نگردد، سایت با توجه به مدارک ارایه شده موجود، تصمیم گیری خواهد نمود. خریدار تنها در صورت رای بخش حل اختلاف مبنی بر مرجوع شدن کالا، می تواند کالا را برگشت دهد و مسئولیت مرجوع کردن کالا به فروشنده بدون هماهنگی با بخش حل اختلاف بر عهده خریدار می باشد.<br>\n<br>\n5-3 فروشنده نیز باید دلیل خود را، برای رد ادعای خریدار در مورد مطابقت نداشتن کالا با مشخصات ذکر شده در صفحه فروش، ارایه نماید. چنانچه فروشنده موفق به جمع آوری و ارایه تمام و یا بخشی از دلایل برای اثبات ادعای خود نگردد، سایت با توجه به مدارک ارایه شده موجود، تصمیم گیری خواهد نمود . در مواردی که کالای ارسالی باید مرجوع شود، فروشنده ملزم به ارایه آدرس درست برای مرجوع شدن آن می باشد. چنانچه کالای مرجوع شده به دلیل ثبت آدرس نادرست توسط فروشنده، به مقصد نرسد، به این معنا خواهد بود که فروشنده از حق خود برای مرجوع شدن کالا چشم پوشی کرده و موافقت می کند که مبلغ مبادله، به خریدار مسترد گردد.<br>\n<br>\n4-تاخیر و یا کوتاهی در تحویل کالا<br>\n1-4 پس از این که خریدار مبلغ قرارداد را به حساب ایسام واریز نمود، فروشنده ملزم به ارسال آن به مقصد تعیین شده ظرف مدت 36 ساعت می باشد. ممکن است بنا به دلایل خارج از اراده شامل جنگ ، سیل، زلزله و یا فورس ماژور، تحویل کالا به خریدار به تاخیر افتاده و یا کالا به دست خریدار نرسد. در این گونه موارد، خریدار و فروشنده می توانند با یکدیگر مذاکره کرده و زمان تحویل کالا را به تعویق انداخته و یا ارسال آن را لغو نموده و مبلغ پرداخت شده را عودت دهند. اما در صورت عدم توافق ، سایت ایسام با توجه به قوانین زیر تصمیم گیری خواهد نمود.</p>\n\n<ul>\n	<li>چنانچه فروشنده کالای مورد نظر را به شرکت حمل و نقل تحویل نداده باشد، معامله فسخ خواهد شد و فروشنده مسئول پذیرش عواقب فسخ این قرارداد می باشد.</li>\n	<li>چنانچه فروشنده کالای سفارش داده شده را ارسال کرده، اما هنگام حمل مفقود شده باشد، فروشنده مسئول گم شدن آن بوده و می بایست شخصا با شرکت حمل کننده طرف قرارداد، مذاکره و نسبت به دریافت وجه کالا از بیمه شرکت حمل طرف قرارداد اقدام نماید.</li>\n	<li>چنانچه فروشنده اثبات نماید که شرکت حمل طرف قرارداد، کالا را در محل مورد نظر تحویل داده، اما شخص ثالثی اقدام به تحویل گرفتن آن نموده و خریدار از این موضوع با خبر نشده باشد، کالای ارسالی به منزله تحویل شده تلقی خواهد شد.</li>\n</ul>\n\n<p><br>\n<br>\n2-4 فروشنده پس از ارسال باید خریدار را از وضعیت حمل کالا مطلع گرداند و همچنین باید اسناد مرتبط با ارسال کالا شامل رسید، بارنامه و یا کد رهگیری مرسوله را در اختیار سایت قرار دهد.<br>\n<br>\n5- مدارک مورد نیاز در هنگام بروز اختلافات<br>\n1-5 طرف زیان دیده، ملزم به ارایه اسناد محکمه پسند برای اثبات ادعای خود می باشد. سایت ایسام برای به دست آوردن ادله مناسب، از دو طرف درخواست می کند تا مدارک اثبات کننده ادعای خود را ارایه نمایند. خریدار و فروشنده قبول می نمایند که سایت ایسام دارای نقش تعیین کننده در پذیرش و یا عدم پذیرش اسناد ارایه شده خواهد بود.<br>\n2-5 چنانچه مدارک ارایه شده، ارتباطی با ادعای مطرح شده نداشته باشند، سایت ایسام دارای این حق می باشد که بنابه صلاحدید خود تصمیم مناسب را اتخاذ کند.<br>\n3-5 چنانچه مدارک ارایه شده توسط دو طرف، کامل نباشد، سایت ایسام دارای این حق می باشد که مستندات محکمه پسند دیگری را جهت اثبات ادعای هر یک از طرفین مطالبه نماید.<br>\n<br>\nحمایت از فروشندگان<br>\nایسام با در نظر گرفتن شرایط، فروشندگان را در برابر طرح شکایت و درخواست بازگرداندن وجه به دلیل عدم دریافت کالا مورد حمایت قرار می دهد.<br>\n<br>\nتبصره 3- ایسام از کل مبلغ دریافتی ثبت‌ شده به نام فروشنده حمایت نموده و در این مورد محدودیتی از نظر تعداد آن وجود ندارد.<br>\nتبصره 4- فروشنده باید واجد تمامی شرایط زیر باشد تا مشمول حمایت‌های سایت قرار گیرد:<br>\n     1- کالا را در مدت زمان تعیین شده و به نشانی خریدار که در سایت ثبت شده است ارسال کرده باشد.<br>\n     2- کالا با شرکت های حمل کننده مورد تایید ایسام ارسال شود و دارای رسید، بارنامه و کد رهگیری معتبر باشد.<br>\n     3- مدارک مورد نیاز سایت را در مهلت مقرر ارایه کند.<br>\n     4- کالای موضوع معامله مادی و ملموس باشد به گونه‌ای که قابل ارسال تلقی شود و در مورد کالاهای مجازی فایل و اطلاعات قابل انتقال باشد.<br>\n<br>\nتبصره 5- تحویل کالا به خریدار، با ارایه سند تحویل کالا که شامل موارد زیر باشد اثبات می‌گردد:<br>\n     1- شماره بارکد قبض ارسال کالا یا کد رهگیری مرسوله<br>\n     2- تعداد و مشخصات کالا<br>\n     3- تاریخ تحویل کالا<br>\n     4- نشانی گیرنده کالا<br>\n     5- نام و امضای گیرنده کالا مبنی بر دریافت کالا<br>\n<br>\nتبصره 6- فروشنده موظف خواهد بود ظرف 36 ساعت از زمان اعلام فروش کالای خود در سایت ، نسبت به ارسال کالا و ثبت بارنامه در سایت اقدام نماید. در غیر این صورت سایت معامله را فسخ و وجه واریزی خریدار را مسترد می گرداند.<br>\n<br>\nتبصره 7- موارد ذیل مشمول حمایت نخواهند بود :<br>\n1- معاملات مربوط به کالاهای غیرمجاز<br>\n2- معاملاتی که خارج از سایت ایسام انجام شده است.<br>\n<br>\n<br>\n6- مرجوع شدن کالا<br>\n1-6 خریدار و فروشنده می توانند بر سر مرجوع شدن کالا و همچنین چگونگی انجام این امر، با یکدیگر مذاکره کرده و به توافق برسند. در این گونه موارد، کالای مرجوع شده باید با همان شرایطی که تحویل گرفته شده، مرجوع گردد.<br>\n2-6 چنانچه خریدار کالایی را مرجوع می کند، باید از شرکت های حمل مورد تایید ایسام برای ارسال آن استفاده کند. همچنین خریدار باید تمام اطلاعات و جزییات مرتبط با حمل کالا را از طریق سایت ارایه نماید. چنانچه خریدار نتواند اطلاعات مورد نیاز برای رهگیری کالا ارایه نماید ، مرجوع گشتن کالا بی اعتبار گردیده و مبلغ معامله به حساب فروشنده واریز خواهد شد.<br>\n3-6 چنانچه خریدار و فروشنده نتوانند بر سر مرجوع شدن کالا و همچنین چگونگی انجام این امر، با یکدیگر به توافق برسند، حل اختلاف را به ایسام برای صدور رای نهایی ارجاع می دهند. در این صورت در مورد مرجوع شدن کالا رای ایسام لازم الاجرا است.<br>\n<br>\n7- آزادسازی مبلغ قرارداد<br>\nهنگام به وجود آمدن اختلافی بین خریدار و فروشنده و ارجاع آن به سایت، هر دو طرف می پذیرند که سایت طبق قوانین موجود دارای حق تصمیم گیری در مورد آزادسازی بخشی و یا تمامی مبلغ مبادله برای هر دوطرف و یا تنها یک طرف منازعه می باشد. چنانچه سایت ایسام تصمیم بگیرد که خریدار باید کالای مورد نظر را مرجوع کند، خریدار 48 ساعت فرصت دارد تا کالا را مرجوع کند، اگر خریدار از مرجوع کردن آن ظرف این مدت امتناع ورزد، سایت ایسام مبلغ معامله را به حساب فروشنده واریز می نماید.<br>\n<br>\n<br>\n8- محدودیت های زمانی<br>\n1-8 هنگام دریافت شکایت، سایت ایسام بلافاصله خریدار و فروشنده را از آن با خبر می گرداند.<br>\n2-8 هر دوطرف خریدار و فروشنده، باید مدارک خود را برای اثبات ادعای طرح شده و یا رد آن، ظرف مدت 72 ساعت پس از اطلاع رسانی سایت در مورد شکایت مطرح شده، ارایه کنند. چنانچه خریدار و یا فروشنده ظرف مدت زمان مشخص شده، موفق به ارایه تمام و یا بخشی از مدارک نشوند، سایت ایسام می تواند تصمیم خود را با توجه به مدارک ارایه شده تا آن لحظه اتخاذ کند.<br>\n3-8 چنانچه بررسی شکایت مطرح شده ، نیازمند زمان بیشتری باشد، سایت ایسام ظرف مدت یک هفته کاری پس از دریافت شکایت ، تصمیم مناسب را اتخاذ می نماید.<br>\n4-8 چنانچه خریدار و فروشنده برای مرجوع شدن کالا با یکدیگر به توافق رسیده باشند، فروشنده حق هیچ گونه اعتراضی را نسبت به عدم دریافت کالا و یا مغایرت داشتن کالا با کالایی که فروخته است، ندارد.<br>\n5-8 چنانچه گروه حل اختلاف رای به مرجوع شدن کالا به فروشنده داده باشد، در صورتی که فروشنده مدعی باشد که خریدار کالا را معیوب کرده و یا در آن تغییری ایجاد کرده است و با کالایی که برای خریدار ارسال کرده است، مغایرت دارد، تنها 24 ساعت پس از دریافت کالا فرصت دارد تا با ارایه رسید معتبر شکایت خود را مطرح کند.<br>\n6-8 اگر فروشنده حداکثر تا 5 روز پس از ثبت بارنامه در بخش حل اختلاف توسط خریدار، دریافت یا عدم دریافت کالا را به اطلاع ایسام نرساند، سایت ایسام عدم اطلاع رسانی فروشنده را به منزله دریافت نمودن و تایید کالا در نظر می گیرد و مختار است مبلغ پرداختی را به حساب خریدار واریز کند.</p>', 'قوانین-مرتبط-با-اختلافات-در-معاملات', 1, 6, '2022-06-24 16:16:22', '2022-06-24 16:18:24');

-- --------------------------------------------------------

--
-- Table structure for table `faq_categories`
--

CREATE TABLE `faq_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `faq_categories`
--

INSERT INTO `faq_categories` (`id`, `name`, `status`, `created_at`, `updated_at`) VALUES
(1, 'عضویت و حساب کاربری', 1, '2022-06-24 15:46:20', '2022-06-24 15:46:20'),
(3, 'خرید کالا و شرکت در مزایدات ایسام', 1, '2022-06-24 15:47:03', '2022-06-24 15:47:03'),
(4, 'فروش کالا و تعرفه ایسام', 1, '2022-06-24 15:47:18', '2022-06-24 15:47:18'),
(6, 'قوانین و مقررات', 1, '2022-06-24 15:48:16', '2022-06-24 15:48:19');

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `jobs`
--

INSERT INTO `jobs` (`id`, `queue`, `payload`, `attempts`, `reserved_at`, `available_at`, `created_at`) VALUES
(1, 'default', '{\"uuid\":\"6beb7fe2-9b24-4f24-8e6f-724da4877024\",\"displayName\":\"App\\\\Mail\\\\OtpMail\",\"job\":\"Illuminate\\\\Queue\\\\CallQueuedHandler@call\",\"maxTries\":null,\"maxExceptions\":null,\"failOnTimeout\":false,\"backoff\":null,\"timeout\":null,\"retryUntil\":null,\"data\":{\"commandName\":\"Illuminate\\\\Mail\\\\SendQueuedMailable\",\"command\":\"O:34:\\\"Illuminate\\\\Mail\\\\SendQueuedMailable\\\":13:{s:8:\\\"mailable\\\";O:16:\\\"App\\\\Mail\\\\OtpMail\\\":3:{s:4:\\\"code\\\";s:6:\\\"947816\\\";s:2:\\\"to\\\";a:1:{i:0;a:2:{s:4:\\\"name\\\";N;s:7:\\\"address\\\";s:19:\\\"adada5116@gmail.com\\\";}}s:6:\\\"mailer\\\";s:4:\\\"smtp\\\";}s:5:\\\"tries\\\";N;s:7:\\\"timeout\\\";N;s:17:\\\"shouldBeEncrypted\\\";b:0;s:10:\\\"connection\\\";N;s:5:\\\"queue\\\";N;s:15:\\\"chainConnection\\\";N;s:10:\\\"chainQueue\\\";N;s:19:\\\"chainCatchCallbacks\\\";N;s:5:\\\"delay\\\";N;s:11:\\\"afterCommit\\\";N;s:10:\\\"middleware\\\";a:0:{}s:7:\\\"chained\\\";a:0:{}}\"}}', 0, NULL, 1656079536, 1656079536);

-- --------------------------------------------------------

--
-- Table structure for table `landing_page_copans`
--

CREATE TABLE `landing_page_copans` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `image` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0 COMMENT 'one copan can have true status, for being show',
  `copan_id` bigint(20) UNSIGNED NOT NULL,
  `start_date` timestamp NULL DEFAULT NULL,
  `end_date` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `landing_page_copans`
--

INSERT INTO `landing_page_copans` (`id`, `image`, `status`, `copan_id`, `start_date`, `end_date`, `created_at`, `updated_at`) VALUES
(1, '\"images\\/landingPageCopans\\/eMuuiTnysHJPHzxOSCud2q7LsZwhGTc441heVTaF.png\"', 1, 1, '2022-06-24 19:41:34', '2022-07-28 19:41:34', '2022-06-24 19:42:10', '2022-06-24 19:42:14');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_03_12_003648_create_roles_table', 1),
(2, '2014_10_12_000000_create_users_table', 1),
(3, '2014_10_12_100000_create_password_resets_table', 1),
(4, '2019_08_19_000000_create_failed_jobs_table', 1),
(5, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(6, '2021_10_04_082511_create_provinces_table', 1),
(7, '2021_10_04_082534_create_cities_table', 1),
(8, '2022_03_12_200709_create_selectable_attributes_table', 1),
(9, '2022_03_12_200742_create_selectable_attribute_values_table', 1),
(10, '2022_03_12_201818_create_product_categories_table', 1),
(11, '2022_03_13_003108_create_faq_categories_table', 1),
(12, '2022_03_13_003124_create_faqs_table', 1),
(13, '2022_03_13_003151_create_product_weights_table', 1),
(14, '2022_03_13_003151_create_sell_types_table', 1),
(15, '2022_03_13_003152_create_products_table', 1),
(16, '2022_03_13_003153_create_product_variants_table', 1),
(17, '2022_03_13_003211_create_product_questions_table', 1),
(18, '2022_03_13_003317_create_user_favorite_products_table', 1),
(19, '2022_03_13_003351_create_auction_periods_table', 1),
(20, '2022_03_13_003352_create_auctions_table', 1),
(21, '2022_03_13_003455_create_discount_requests_table', 1),
(22, '2022_03_13_003517_create_supports_table', 1),
(23, '2022_03_13_003531_create_banners_table', 1),
(24, '2022_03_13_003624_create_pages_table', 1),
(25, '2022_03_13_003700_create_permissions_table', 1),
(26, '2022_03_13_003747_create_permission_role_table', 1),
(27, '2022_03_13_003842_create_product_attributes_table', 1),
(28, '2022_03_13_003941_create_product_attribute_default_values_table', 1),
(29, '2022_03_13_004004_create_product_images_table', 1),
(30, '2022_03_13_004057_create_product_attribute_values_table', 1),
(31, '2022_03_13_004800_create_copans_table', 1),
(32, '2022_03_13_004847_create_addresses_table', 1),
(33, '2022_03_13_005135_create_public_sms_table', 1),
(34, '2022_03_13_005143_create_public_mail_table', 1),
(35, '2022_03_13_005151_create_public_mail_files_table', 1),
(36, '2022_03_13_005238_create_payment_types_table', 1),
(37, '2022_03_13_005239_create_payments_table', 1),
(38, '2022_03_13_005250_create_online_payments_table', 1),
(39, '2022_03_13_005303_create_cart_items_table', 1),
(40, '2022_03_13_005400_create_orders_table', 1),
(41, '2022_03_13_005410_create_amazing_sales_table', 1),
(42, '2022_03_13_005411_create_order_items_table', 1),
(43, '2022_03_13_005442_create_settings_table', 1),
(44, '2022_03_13_005454_create_temporary_files_table', 1),
(45, '2022_03_13_005600_create_permission_user_table', 1),
(46, '2022_03_13_232057_create_landing_page_copans', 1),
(47, '2022_03_21_203724_create_category_selectable_attribute_value_table', 1),
(48, '2022_03_21_215534_create_product_variant_selectable_attributes', 1),
(49, '2022_03_23_180425_create_delivery_times_table', 1),
(50, '2022_03_23_180459_add_delivery_time_to_users_table', 1),
(51, '2022_03_24_182316_add_fa_to_auction_periods_table', 1),
(52, '2022_04_04_205025_add_value_column_to_product_attribute_values_table', 1),
(53, '2022_04_04_214044_add_column_active_to_product_variants_table', 1),
(54, '2022_04_10_195346_rename_amout_to_amount_copans_table', 1),
(55, '2022_04_10_195808_rename_start_day_to_start_date_copans_table', 1),
(56, '2022_04_10_195835_rename_end_day_to_end_date_copans_table', 1),
(57, '2022_04_17_181106_create_notifications_table', 1),
(58, '2022_04_18_200216_create_otps_table', 1),
(59, '2022_04_18_200237_create_jobs_table', 1),
(60, '2022_05_08_113309_add_cash_to_users_table', 1),
(61, '2022_05_09_114705_add_user_id_to_user_favorite_products', 1),
(62, '2022_05_14_211803_modify_product_id_column_to_unique_amazing_sales_table', 1),
(63, '2022_05_14_235509_create_auction_suggestions_table', 1),
(64, '2022_05_14_235636_create_auction_follower_table', 1),
(65, '2022_05_15_000222_add_visitors_column_products_table', 1),
(66, '2022_05_17_203338_remove_colorable_product_categories_table', 1),
(67, '2022_05_18_133344_add_end_date_to_auctions_table', 1),
(68, '2022_05_21_185349_rename_usre_id_to_user_id_auction_suggestions_table', 1),
(69, '2022_05_23_180505_create_user_favorite_sellers_table', 1),
(70, '2022_05_23_200003_create_reports_table', 1),
(71, '2022_05_24_120352_add_disabled_for_report_column_products_table', 1),
(72, '2022_05_29_181852_add_delivery_time_column_to_order_items_table', 1),
(73, '2022_05_29_183929_create_used_copans_table', 1),
(74, '2022_05_30_113826_create_cash_payments_table', 1),
(75, '2022_05_31_121547_remove_frozen_number_from_product_variants_table', 1),
(76, '2022_05_31_121733_create_variant_frozen_number_table', 1),
(77, '2022_06_02_121612_add_sent_column_to_public_mail_table', 1),
(78, '2022_06_11_184245_set_default_for_sent_column_public_mail_table', 1),
(79, '2022_06_11_220228_add_is_superadmin_to_users_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE `notifications` (
  `id` char(36) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `notifiable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `notifiable_id` bigint(20) UNSIGNED NOT NULL,
  `data` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `read_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `online_payments`
--

CREATE TABLE `online_payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `amount` decimal(20,3) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `gateway` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `transaction_id` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `bank_first_response` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `bank_second_response` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `address_id` bigint(20) UNSIGNED DEFAULT NULL,
  `address_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `payment_id` bigint(20) UNSIGNED DEFAULT NULL,
  `payment_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `delivery_amount` decimal(20,3) DEFAULT NULL,
  `delivery_status` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => not sent, 1 => is sending, 2 => sent, 3 => received',
  `order_final_amount` decimal(20,3) DEFAULT NULL COMMENT 'without discount and delivery_amount, just real(without discount) product price * number',
  `order_discount_amount` decimal(20,3) DEFAULT NULL COMMENT 'without copan discount amount',
  `copan_id` bigint(20) UNSIGNED DEFAULT NULL,
  `copan_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `order_copan_discount_amount` decimal(20,3) DEFAULT NULL,
  `order_status` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => waiting for accept, 1 => accepted, 2 => not accepted',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `order_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `product_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `delivery_time` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `amazing_sale_id` bigint(20) UNSIGNED DEFAULT NULL,
  `amazing_sale_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `amazing_sale_discount_amount` decimal(20,3) DEFAULT NULL,
  `number` int(11) NOT NULL DEFAULT 1,
  `final_product_price` decimal(20,3) DEFAULT NULL COMMENT 'price effected by discount',
  `final_total_price` decimal(20,3) DEFAULT NULL COMMENT 'number * final_product_price',
  `variant_id` bigint(20) UNSIGNED NOT NULL,
  `variant_object` longtext COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `otps`
--

CREATE TABLE `otps` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `login_id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '0 => mobile number, 1 => email',
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `otps`
--

INSERT INTO `otps` (`id`, `code`, `token`, `login_id`, `type`, `user_id`, `created_at`, `updated_at`) VALUES
(1, '947816', 'diInSrkWYna5keGZ0WxRIdGuhxG4VscD6e37ernlqhNkSSOMFJ7Ukc8xv8z4', 'adada5116@gmail.com', 1, 2, '2022-06-24 14:05:35', '2022-06-24 14:05:35'),
(2, '335229', 'DNoHVr5R0zvgMmL2HvCdaiG6RZj8RvDqcWHSv9wl0KEOQnmrkzHGGMb1cShd', 'admin@gmail.com', 1, 1, '2022-06-24 14:06:08', '2022-06-24 14:06:08'),
(3, '926357', 'cJzCP6DEvHpkicZVfQkNjYKmgu2yTAXWZGFCpCwY1djzYqNnZLQ8yc2A0ShP', 'admin@gmail.com', 1, 1, '2022-06-24 18:54:31', '2022-06-24 18:54:31'),
(4, '954037', 'uI4RVdw4B90Y5zGl1mr4GFZsYPgSbXBSLv59OGoWRXQ6j3lg0s7IODE5DM7p', 'admin@gmail.com', 1, 1, '2022-06-24 19:31:48', '2022-06-24 19:31:48');

-- --------------------------------------------------------

--
-- Table structure for table `pages`
--

CREATE TABLE `pages` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `body` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `tags` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `amount` decimal(20,3) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => not paid, 1 => paid, 2 => rejected, 3 => returned',
  `type_id` bigint(20) UNSIGNED NOT NULL COMMENT 'way that payed, e.g. is online, offline, ...',
  `paymentable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `paymentable_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payment_types`
--

CREATE TABLE `payment_types` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `fa_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `payment_types`
--

INSERT INTO `payment_types` (`id`, `name`, `fa_name`, `created_at`, `updated_at`) VALUES
(1, 'online', 'آنلاین', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(2, 'cash', 'کیف پول', '2022-06-20 15:36:29', '2022-06-20 15:36:29');

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `name`, `description`, `status`, `created_at`, `updated_at`) VALUES
(1, 'product_category_view_any', 'مشاهده دسته بندی محصولات', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(2, 'product_attribute_view_any', 'مشاهده فرم کالا', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(3, 'product_view_any', 'مشاهده  محصولات ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(4, 'product_archive_view_any', 'مشاهده  محصولات آرشیو شده ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(5, 'product_change_marketable', ' تغییر امکان فروش محصول', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(6, 'product_delete', 'حذف محصول', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(7, 'product_update', 'ویرایش محصول', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(8, 'selectable_attribute_view_any', 'مشاهده ویژگی های قابل انتخاب ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(9, 'order_view_any', 'مشاهده سفارش ها ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(10, 'payment_view_any', 'مشاهده پرداخت ها ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(11, 'landing_page_copan_view_any', 'مشاهده کپن های صفحه اصلی ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(12, 'copan_view_any', 'مشاهده کپن ها ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(13, 'amazing_sale_view_any', 'مشاهده تخفیف های شگفت انگیز ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(14, 'faq_category_view_any', 'مشاهده  دسته بندی سوالات متداول ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(15, 'faq_view_any', 'مشاهده  سوالات متداول ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(16, 'page_view_any', 'مشاهده پیج ساز ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(17, 'banner_view_any', 'مشاهده بنرها ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(18, 'report_view_any', 'مشاهده گزارش ها ', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(19, 'report_toggle_product', 'بازکردن و بستن محصول گزارش شده', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(20, 'public_mail_view_any', 'مشاهده اطلاعیه ایمیلی', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(21, 'public_sms_view_any', 'مشاهده اطلاعیه پیامکی', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13'),
(22, 'setting_view', 'مشاهده تنظیمات', 0, '2022-06-20 15:36:13', '2022-06-20 15:36:13');

-- --------------------------------------------------------

--
-- Table structure for table `permission_role`
--

CREATE TABLE `permission_role` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permission_role`
--

INSERT INTO `permission_role` (`permission_id`, `role_id`, `created_at`) VALUES
(18, 2, '2022-06-20 17:27:13'),
(19, 2, '2022-06-20 17:27:13');

-- --------------------------------------------------------

--
-- Table structure for table `permission_user`
--

CREATE TABLE `permission_user` (
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `abilities` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `introduction` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `visitors` bigint(20) NOT NULL DEFAULT 0,
  `marketable` tinyint(4) NOT NULL DEFAULT 1 COMMENT '1 => marketable ,0 => unmarketable',
  `disabled_for_report` tinyint(4) NOT NULL DEFAULT 0 COMMENT 'when admin wants a reported product be disable, 0 => notdisable, 1 => disable',
  `has_request_for_discount` tinyint(4) NOT NULL DEFAULT 0,
  `tags` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `weight_id` bigint(20) UNSIGNED NOT NULL,
  `delivery_amount` decimal(20,3) NOT NULL DEFAULT 0.000,
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `sell_type_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `published_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `introduction`, `description`, `slug`, `image`, `visitors`, `marketable`, `disabled_for_report`, `has_request_for_discount`, `tags`, `weight_id`, `delivery_amount`, `category_id`, `sell_type_id`, `user_id`, `published_at`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'نیسان آبی آقا جمشید در سریال نیسان آبی', 'عشق جمشید ناجی زندانیان بی گناه', '<p>نیسان آبی قصه جمشید و رضاس، قصه دو رفیق قدیمی که روزی روزگاری عاشق دو تا آبجی شدن به اسم های زری و پری و با اون ها ازدواج کردن. جمشید شیفته جمشید هاشم پور و نیسان آبی شه؛ رضا هم عاشق شعر و شاعری و تو رویاهاش فکر می کنه شاعری نامداره! جمشید روی نیسانش کار می کنه و قرون به قرون پول درمیاره تا چرخ زندگیش بچرخه که البته خداییش سخت می چرخه، رضا هم در به در دنبال یه فرصتیه تا اوضاعش بهتر شه و شغل خوب برای خودش دست و پا کنه! البته قصه ها دست از سر زندگی جمشید و رضا بر نمی دارن و مدام اون ها رو درگیر اتفاقای ریز و درشت می کنن، اتفاقایی که بعضی وقتا لحظات شیرینی رو می سازن و گاهی هم غمگین! نیسان آبی قصه جیب خالی و بی پولیه، قصه عشقه و شیفتگی، قصه خیانته و وفاداری و از همه مهم تر نیسان آبی قصه خانواده اس، خانواده و خانواده.</p>', 'نیسان-آبی-آقا-جمشید-در-سریال-نیسان-آبی', '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099302_460.jpeg\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 2, 1, 0, 0, 'cinema', 5, '0.000', 55, 2, 1, '2022-06-24 19:33:07', '2022-06-24 19:35:02', '2022-06-24 19:47:04', NULL),
(2, 'ساعت کاسیو مدل CASIO A159W', 'نو آکبند. چراغ صفحه. آلارم. کورنومتر. تاریخ. روزشمار و...', '<p><strong>منصفانه ترین قیمت در بین تمامی فروشگاه ها</strong></p>\n\n<p> </p>\n\n<p><strong>تک فروشی به قیمت عمده</strong><br>\n </p>\n\n<p><strong>ساعت کاسیو مدل A159W </strong></p>\n\n<p> </p>\n\n<p><strong>سبک زیبا و جذاب و حس نوستالژیک مدلهای وینتیج کاسیو به علاوه مقاومت و کیفیت بالا به شما حس خوش ایندی را القا میکند</strong></p>\n\n<p><strong>تایم سیتی افتخار ارائه نمونه های متنوع این سری از ساعت های کاسیو را دارا میباشد</strong></p>\n\n<p> </p>\n\n<p> </p>\n\n<p><strong>امکانات :</strong></p>\n\n<p> </p>\n\n<p><strong>تاریخ ماهانه</strong></p>\n\n<p> </p>\n\n<p><strong>روزشمار هفته</strong></p>\n\n<p> </p>\n\n<p><strong>کرنومتر</strong></p>\n\n<p> </p>\n\n<p><strong>چراغ Led صفحه</strong></p>\n\n<p> </p>\n\n<p><strong>آلارم زنگ</strong></p>\n\n<p> </p>\n\n<p><strong>هشدار24 ساعته</strong></p>\n\n<p> </p>\n\n<p><strong>هشدار تک زمانه</strong></p>\n\n<p> </p>\n\n<p><strong>سایز بدنه: 36*33 میلیمتر </strong></p>\n\n<p> </p>\n\n<p><strong>ساخته شده ار آلیاژ مقاوم استیل با وزن کم جهت جلوگیری از خستگی بر روی مچ</strong></p>\n\n<p> </p>\n\n<p><strong>جنس بدنه : رزین با روکش کروم </strong></p>\n\n<p><strong>جنس بند : استیل ضد زنگ </strong></p>\n\n<p> </p>\n\n<p><strong>﻿﻿موتور و باتری ژاپن</strong></p>\n\n<p><strong>تحت لیسانس کاسیو </strong></p>\n\n<p><strong>ساخت و مونتاز : کشور چین</strong><br>\n </p>\n\n<p> </p>\n\n<p><strong>مدل: مجلسی _ اسپرت _ کلاسیک</strong></p>\n\n<p> </p>\n\n<p><strong>قابل استفاده: مردانه _ زنانه</strong></p>\n\n<p> </p>\n\n<p><strong>بسیار کم مصرف </strong></p>\n\n<p> </p>\n\n<p> </p>\n\n<p><strong>ارسال به سراسر ایران</strong></p>\n\n<p> </p>\n\n<p><strong>ارسال با جعبه هدیه شیک</strong></p>\n\n<p> </p>\n\n<p><strong>زندگی را لحظه ها می سازند...</strong></p>\n\n<p> </p>\n\n<p><strong>از فروشگاه تایم سیتی ایسام دیدن کنید.</strong></p>', 'ساعت-کاسیو-مدل-CASIO-A159W', '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099601_461.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 0, 1, 0, 0, 'ساعت', 4, '5000.000', 49, 1, 1, '2022-06-24 19:37:17', '2022-06-24 19:40:01', '2022-06-24 19:40:01', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `product_attributes`
--

CREATE TABLE `product_attributes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_attributes`
--

INSERT INTO `product_attributes` (`id`, `name`, `category_id`, `created_at`, `updated_at`) VALUES
(1, 'جعبه', 3, '2022-06-24 18:54:42', '2022-06-24 18:54:42'),
(2, 'حسگر اثر انگشت', 3, '2022-06-24 18:54:58', '2022-06-24 18:54:58'),
(3, 'اندازه  RAM', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(4, 'حافظه داخلی', 3, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(5, 'هندزفری', 3, '2022-06-24 18:56:57', '2022-06-24 18:56:57'),
(6, 'مقاوم در برابر آب', 3, '2022-06-24 18:57:07', '2022-06-24 18:57:07'),
(7, 'مدل گوشی', 3, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(8, 'وضعیت', 4, '2022-06-24 18:59:23', '2022-06-24 18:59:23'),
(9, 'وضعیت', 5, '2022-06-24 18:59:43', '2022-06-24 18:59:43'),
(10, 'وضعیت', 6, '2022-06-24 19:00:00', '2022-06-24 19:00:00'),
(12, 'نوع', 9, '2022-06-24 19:06:31', '2022-06-24 19:06:31'),
(13, 'کاربرد', 9, '2022-06-24 19:08:31', '2022-06-24 19:08:31'),
(14, 'جعبه', 9, '2022-06-24 19:09:10', '2022-06-24 19:09:10'),
(15, 'باتری', 9, '2022-06-24 19:09:24', '2022-06-24 19:09:24'),
(16, 'شارژر', 9, '2022-06-24 19:09:36', '2022-06-24 19:09:36'),
(17, 'وضعیت', 10, '2022-06-24 19:10:00', '2022-06-24 19:10:00'),
(18, 'صفحه نمایش لمسی', 13, '2022-06-24 19:11:29', '2022-06-24 19:11:29'),
(19, 'جنس', 19, '2022-06-24 19:13:03', '2022-06-24 19:13:03'),
(20, 'فصل', 23, '2022-06-24 19:13:57', '2022-06-24 19:13:57'),
(21, 'وضعیت', 29, '2022-06-24 19:14:28', '2022-06-24 19:14:28'),
(22, 'نوع چاپ کتاب', 30, '2022-06-24 19:15:35', '2022-06-24 19:15:35'),
(23, 'وضعیت', 36, '2022-06-24 19:17:07', '2022-06-24 19:17:07'),
(24, 'وضعیت', 37, '2022-06-24 19:17:32', '2022-06-24 19:17:32'),
(25, 'وضعیت', 38, '2022-06-24 19:18:10', '2022-06-24 19:18:10'),
(26, 'وضعیت موتور', 38, '2022-06-24 19:19:27', '2022-06-24 19:19:27'),
(27, 'وضعیت موتور', 39, '2022-06-24 19:19:46', '2022-06-24 19:19:46'),
(28, 'وضعیت شاسی', 38, '2022-06-24 19:20:37', '2022-06-24 19:20:37'),
(29, 'وضعیت بدنه', 38, '2022-06-24 19:21:20', '2022-06-24 19:21:20'),
(30, 'وضعیت بدنه', 39, '2022-06-24 19:21:40', '2022-06-24 19:21:40'),
(31, 'سال چاپ', 42, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(32, 'وزن', 50, '2022-06-24 19:23:05', '2022-06-24 19:23:05'),
(33, 'وضعیت', 50, '2022-06-24 19:23:19', '2022-06-24 19:23:19'),
(34, 'وضعیت', 51, '2022-06-24 19:24:29', '2022-06-24 19:24:29');

-- --------------------------------------------------------

--
-- Table structure for table `product_attribute_default_values`
--

CREATE TABLE `product_attribute_default_values` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `value` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `attribute_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_attribute_default_values`
--

INSERT INTO `product_attribute_default_values` (`id`, `value`, `attribute_id`, `created_at`, `updated_at`) VALUES
(1, 'دارد', 1, '2022-06-24 18:54:42', '2022-06-24 18:54:42'),
(2, 'ندارد', 1, '2022-06-24 18:54:42', '2022-06-24 18:54:42'),
(3, 'دارد', 2, '2022-06-24 18:54:58', '2022-06-24 18:54:58'),
(4, 'ندارد', 2, '2022-06-24 18:54:58', '2022-06-24 18:54:58'),
(5, 'نامشخص', 2, '2022-06-24 18:54:58', '2022-06-24 18:54:58'),
(6, '۴مگابایت', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(7, '۶۴مگابایت', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(8, '۱گیگ', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(9, '۲گیگ', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(10, '۴گیگ', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(11, '۶گیگ', 3, '2022-06-24 18:56:03', '2022-06-24 18:56:03'),
(12, '۵۱۲', 4, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(13, '۱۲۴', 4, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(14, '۶۴', 4, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(15, '۳۲', 4, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(16, '۱۶', 4, '2022-06-24 18:56:35', '2022-06-24 18:56:35'),
(17, 'دارد', 5, '2022-06-24 18:56:57', '2022-06-24 18:56:57'),
(18, 'ندارد', 5, '2022-06-24 18:56:57', '2022-06-24 18:56:57'),
(19, 'هست', 6, '2022-06-24 18:57:07', '2022-06-24 18:57:07'),
(20, 'نیست', 6, '2022-06-24 18:57:07', '2022-06-24 18:57:07'),
(21, 'نامشخص', 6, '2022-06-24 18:57:07', '2022-06-24 18:57:07'),
(22, 'apple', 7, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(23, 'samsung', 7, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(24, 'xiaomi', 7, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(25, 'nokia', 7, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(26, 'سایر', 7, '2022-06-24 18:58:04', '2022-06-24 18:58:04'),
(27, 'نو', 8, '2022-06-24 18:59:23', '2022-06-24 18:59:23'),
(28, 'درحدنو', 8, '2022-06-24 18:59:23', '2022-06-24 18:59:23'),
(29, 'تعمیرشده', 8, '2022-06-24 18:59:23', '2022-06-24 18:59:23'),
(30, 'خراب', 8, '2022-06-24 18:59:23', '2022-06-24 18:59:23'),
(31, 'نو', 9, '2022-06-24 18:59:43', '2022-06-24 18:59:43'),
(32, 'درحدنو', 9, '2022-06-24 18:59:43', '2022-06-24 18:59:43'),
(33, 'تعمیرشده', 9, '2022-06-24 18:59:43', '2022-06-24 18:59:43'),
(34, 'خراب', 9, '2022-06-24 18:59:43', '2022-06-24 18:59:43'),
(35, 'نو', 10, '2022-06-24 19:00:00', '2022-06-24 19:00:00'),
(36, 'درحدنو', 10, '2022-06-24 19:00:00', '2022-06-24 19:00:00'),
(37, 'خراب', 10, '2022-06-24 19:00:00', '2022-06-24 19:00:00'),
(38, 'تعمیرشده', 10, '2022-06-24 19:00:00', '2022-06-24 19:00:00'),
(40, 'لپ تاپ (نوت بوک)', 12, '2022-06-24 19:06:31', '2022-06-24 19:06:31'),
(41, 'آلترابوک', 12, '2022-06-24 19:06:31', '2022-06-24 19:06:31'),
(42, 'نامشخص', 12, '2022-06-24 19:06:31', '2022-06-24 19:06:31'),
(43, 'طراحی و رندرینگ', 13, '2022-06-24 19:08:31', '2022-06-24 19:08:31'),
(44, 'مهندسی', 13, '2022-06-24 19:08:31', '2022-06-24 19:08:31'),
(45, 'اداری و دانشجویی', 13, '2022-06-24 19:08:31', '2022-06-24 19:08:31'),
(46, 'دارد', 14, '2022-06-24 19:09:10', '2022-06-24 19:09:10'),
(47, 'ندارد', 14, '2022-06-24 19:09:10', '2022-06-24 19:09:10'),
(48, 'دارد', 15, '2022-06-24 19:09:24', '2022-06-24 19:09:24'),
(49, 'ندارد', 15, '2022-06-24 19:09:24', '2022-06-24 19:09:24'),
(50, 'دارد', 16, '2022-06-24 19:09:36', '2022-06-24 19:09:36'),
(51, 'ندارد', 16, '2022-06-24 19:09:37', '2022-06-24 19:09:37'),
(52, 'درحدنو', 17, '2022-06-24 19:10:00', '2022-06-24 19:10:00'),
(53, 'نو', 17, '2022-06-24 19:10:00', '2022-06-24 19:10:00'),
(54, 'خراب', 17, '2022-06-24 19:10:00', '2022-06-24 19:10:00'),
(55, 'تعمیرشده', 17, '2022-06-24 19:10:00', '2022-06-24 19:10:00'),
(56, 'بله', 18, '2022-06-24 19:11:29', '2022-06-24 19:11:29'),
(57, 'خیر', 18, '2022-06-24 19:11:29', '2022-06-24 19:11:29'),
(58, 'نامشخص', 18, '2022-06-24 19:11:29', '2022-06-24 19:11:29'),
(59, 'ابریشم', 19, '2022-06-24 19:13:03', '2022-06-24 19:13:03'),
(60, 'پلی استر', 19, '2022-06-24 19:13:03', '2022-06-24 19:13:03'),
(61, 'نایلون', 19, '2022-06-24 19:13:03', '2022-06-24 19:13:03'),
(62, 'گیاهی', 19, '2022-06-24 19:13:03', '2022-06-24 19:13:03'),
(63, 'گرم', 20, '2022-06-24 19:13:57', '2022-06-24 19:13:57'),
(64, 'سرد', 20, '2022-06-24 19:13:57', '2022-06-24 19:13:57'),
(65, 'نامشخص', 20, '2022-06-24 19:13:57', '2022-06-24 19:13:57'),
(66, 'نو', 21, '2022-06-24 19:14:28', '2022-06-24 19:14:28'),
(67, 'درحدنو', 21, '2022-06-24 19:14:28', '2022-06-24 19:14:28'),
(68, 'خراب', 21, '2022-06-24 19:14:28', '2022-06-24 19:14:28'),
(69, 'تعمیرشده', 21, '2022-06-24 19:14:28', '2022-06-24 19:14:28'),
(70, 'چاپ اصل', 22, '2022-06-24 19:15:35', '2022-06-24 19:15:35'),
(71, 'چاپ غیر اصل', 22, '2022-06-24 19:15:35', '2022-06-24 19:15:35'),
(72, 'نامشخص', 22, '2022-06-24 19:15:35', '2022-06-24 19:15:35'),
(73, 'نو', 23, '2022-06-24 19:17:07', '2022-06-24 19:17:07'),
(74, 'درحدنو', 23, '2022-06-24 19:17:07', '2022-06-24 19:17:07'),
(75, 'تعمیرشده', 23, '2022-06-24 19:17:07', '2022-06-24 19:17:07'),
(76, 'خراب', 23, '2022-06-24 19:17:07', '2022-06-24 19:17:07'),
(77, 'درحدنو', 24, '2022-06-24 19:17:32', '2022-06-24 19:17:32'),
(78, 'نو', 24, '2022-06-24 19:17:32', '2022-06-24 19:17:32'),
(79, 'تعمیرشده', 24, '2022-06-24 19:17:32', '2022-06-24 19:17:32'),
(80, 'خراب', 24, '2022-06-24 19:17:32', '2022-06-24 19:17:32'),
(81, 'نو', 25, '2022-06-24 19:18:10', '2022-06-24 19:18:10'),
(82, 'درحدنو', 25, '2022-06-24 19:18:10', '2022-06-24 19:18:10'),
(83, 'تعمیرشده', 25, '2022-06-24 19:18:10', '2022-06-24 19:18:10'),
(84, 'سالم', 26, '2022-06-24 19:19:27', '2022-06-24 19:19:27'),
(85, 'خراب', 26, '2022-06-24 19:19:27', '2022-06-24 19:19:27'),
(86, 'نیاز به تعمیر', 26, '2022-06-24 19:19:28', '2022-06-24 19:19:28'),
(87, 'سالم', 27, '2022-06-24 19:19:46', '2022-06-24 19:19:46'),
(88, 'خراب', 27, '2022-06-24 19:19:46', '2022-06-24 19:19:46'),
(89, 'نیاز به تعمیر', 27, '2022-06-24 19:19:46', '2022-06-24 19:19:46'),
(90, 'سالم و پلمپ', 28, '2022-06-24 19:20:37', '2022-06-24 19:20:37'),
(91, 'خراب', 28, '2022-06-24 19:20:37', '2022-06-24 19:20:37'),
(92, 'نیاز به تعمیر', 28, '2022-06-24 19:20:37', '2022-06-24 19:20:37'),
(93, 'سالم', 29, '2022-06-24 19:21:20', '2022-06-24 19:21:20'),
(94, 'خط و خش جزيی', 29, '2022-06-24 19:21:20', '2022-06-24 19:21:20'),
(95, 'سالم', 30, '2022-06-24 19:21:40', '2022-06-24 19:21:40'),
(96, 'دارای خط و خش', 30, '2022-06-24 19:21:40', '2022-06-24 19:21:40'),
(97, '2100', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(98, '2020', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(99, '2022', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(100, '1999', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(101, '1562', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(102, '1354', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(103, '1362', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(104, '1681', 31, '2022-06-24 19:22:29', '2022-06-24 19:22:29'),
(105, '1 کیلو', 32, '2022-06-24 19:23:05', '2022-06-24 19:23:05'),
(106, '۵۰۰ گرم', 32, '2022-06-24 19:23:05', '2022-06-24 19:23:05'),
(107, 'سالم', 33, '2022-06-24 19:23:19', '2022-06-24 19:23:19'),
(108, 'پنچر', 33, '2022-06-24 19:23:19', '2022-06-24 19:23:19'),
(109, 'نو', 34, '2022-06-24 19:24:29', '2022-06-24 19:24:29'),
(110, 'درحدنو', 34, '2022-06-24 19:24:29', '2022-06-24 19:24:29'),
(111, 'نیاز به تعمیر', 34, '2022-06-24 19:24:29', '2022-06-24 19:24:29');

-- --------------------------------------------------------

--
-- Table structure for table `product_attribute_values`
--

CREATE TABLE `product_attribute_values` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `attribute_id` bigint(20) UNSIGNED NOT NULL,
  `value_id` bigint(20) UNSIGNED NOT NULL,
  `value` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_categories`
--

CREATE TABLE `product_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `show_in_menu` tinyint(4) NOT NULL DEFAULT 0,
  `parent_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_categories`
--

INSERT INTO `product_categories` (`id`, `name`, `description`, `slug`, `image`, `show_in_menu`, `parent_id`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'دیجیتال', '<p>دیجیتال</p>', 'دیجیتال', NULL, 1, NULL, '2022-06-20 15:45:35', '2022-06-20 15:55:46', NULL),
(2, 'موبایل و تبلت', '<p>موبایل و تبلت</p>', 'موبایل-و-تبلت', NULL, 1, 1, '2022-06-20 15:46:03', '2022-06-20 15:56:50', NULL),
(3, 'گوشی موبایل', '<p>گوشی موبایل</p>', 'گوشی-موبایل', NULL, 1, 2, '2022-06-20 15:49:11', '2022-06-20 15:50:16', NULL),
(4, 'لوازم جانبی موبایل', '<p>لوازم جانبی موبایل</p>', 'لوازم-جانبی-موبایل', NULL, 1, 2, '2022-06-20 15:50:48', '2022-06-20 15:50:51', NULL),
(5, 'لوازم و قطعات موبایل', '<p>لوازم و قطعات موبایل</p>', 'لوازم-و-قطعات-موبایل', NULL, 1, 2, '2022-06-20 15:51:21', '2022-06-20 15:51:41', NULL),
(6, 'لوازم و قطعات تبلت', '<p>لوازم و قطعات تبلت</p>', 'لوازم-و-قطعات-تبلت', NULL, 1, 2, '2022-06-20 15:51:32', '2022-06-20 15:51:48', NULL),
(7, 'سایر', '<p>سایر</p>', 'سایر', NULL, 1, 2, '2022-06-20 15:52:16', '2022-06-20 15:52:16', NULL),
(8, 'لپتاپ', '<p>لپتاپ</p>', 'لپتاپ', NULL, 1, 1, '2022-06-20 15:53:21', '2022-06-20 15:53:21', NULL),
(9, 'لپتاپ', '<p>لپتاپ</p>', 'لپتاپ-2', NULL, 1, 8, '2022-06-20 15:53:43', '2022-06-20 15:55:45', NULL),
(10, 'لوازم جانبی لپتاپ', '<p>لوازم جانبی لپتاپ</p>', 'لوازم-جانبی-لپتاپ', NULL, 1, 8, '2022-06-20 15:54:00', '2022-06-20 15:54:05', NULL),
(11, 'قطعات لپتاپ', '<p>قطعات لپتاپ</p>', 'قطعات-لپتاپ', NULL, 1, 8, '2022-06-20 15:58:17', '2022-06-20 15:58:17', NULL),
(12, 'دوربین', '<p>دوربین</p>', 'دوربین', NULL, 1, 1, '2022-06-20 15:59:09', '2022-06-20 15:59:09', NULL),
(13, 'دوربین', '<p>دوربین</p>', 'دوربین-2', NULL, 1, 12, '2022-06-20 15:59:18', '2022-06-20 15:59:18', NULL),
(14, 'لوازم دوربین', '<p>دوربین</p>\n\n<p> </p>', 'لوازم-دوربین', NULL, 1, 12, '2022-06-20 16:06:08', '2022-06-20 16:06:08', NULL),
(15, 'مد و پوشاک', '<p>مد و پوشاک</p>', 'مد-و-پوشاک', NULL, 1, NULL, '2022-06-20 16:06:42', '2022-06-20 16:06:42', NULL),
(16, 'پوشاک زنانه', '<p>پوشاک زنانه</p>', 'لباس-زنانه', NULL, 1, 15, '2022-06-20 16:07:02', '2022-06-20 16:07:24', NULL),
(17, 'پوشاک مردانه', '<p>پوشاک مردانه</p>', 'پوشاک-مردانه', NULL, 1, 15, '2022-06-20 16:07:48', '2022-06-20 16:07:48', NULL),
(18, 'پوشاک و لوارم کودک', '<p>پوشاک و لوارم کودک</p>', 'پوشاک-و-لوارم-کودک', NULL, 1, 15, '2022-06-20 16:08:22', '2022-06-20 16:08:26', NULL),
(19, 'لباس زنانه', '<p>لباس زنانه</p>', 'لباس-زنانه-2', NULL, 1, 16, '2022-06-20 16:10:37', '2022-06-20 16:10:37', NULL),
(20, 'کیف و کفش زنانه', '<p>کیف و کفش زنانه</p>', 'کیف-و-کفش-زنانه', NULL, 1, 16, '2022-06-20 16:11:01', '2022-06-20 16:11:01', NULL),
(21, 'لباس مردانه', '<p>لباس مردانه</p>', 'لباس-مردانه', NULL, 1, 17, '2022-06-20 16:11:34', '2022-06-20 16:11:34', NULL),
(22, 'عینک و کیف و کفش مردانه', '<p>عینک و کیف و کفش مردانه</p>', 'عینک-و-کیف-و-کفش-مردانه', NULL, 1, 17, '2022-06-20 16:11:56', '2022-06-20 16:11:56', NULL),
(23, 'پوشاک و لوازم کودک', '<p>پوشاک و لوازم کودک</p>', 'پوشاک-و-لوازم-کودک', NULL, 1, 18, '2022-06-20 17:08:33', '2022-06-20 17:08:33', NULL),
(24, 'اسباب بازی کودک', '<p>اسباب بازی کودک</p>', 'اسباب-بازی-کودک', NULL, 1, 18, '2022-06-20 17:08:59', '2022-06-20 17:08:59', NULL),
(25, 'قدیمی و کلکسیونی', '<p>قدیمی و کلکسیونی</p>', 'قدیمی-و-کلکسیونی', NULL, 1, NULL, '2022-06-20 17:09:26', '2022-06-20 17:09:26', NULL),
(26, 'لوازم قدیمی', '<p>لوازم قدیمی</p>', 'لوازم-قدیمی', NULL, 1, 25, '2022-06-20 17:09:53', '2022-06-20 17:09:53', NULL),
(27, 'کتاب قدیمی', '<p>کتاب قدیمی</p>', 'کتاب-قدیمی', NULL, 1, 25, '2022-06-20 17:10:07', '2022-06-20 17:10:07', NULL),
(28, 'لوازم قدیمی خانه', '<p>لوازم قدیمی خانه</p>', 'لوازم-قدیمی-خانه', NULL, 1, 26, '2022-06-20 17:10:48', '2022-06-20 17:10:48', NULL),
(29, 'ابزار آلات قدیمی', '<p>ابزار آلات قدیمی</p>', 'ابزار-آلات-قدیمی', NULL, 1, 26, '2022-06-20 17:11:21', '2022-06-20 17:11:21', NULL),
(30, 'کتاب قدیمی', '<p>کتاب قدیمی</p>', 'کتاب-قدیمی-2', NULL, 1, 27, '2022-06-20 17:11:44', '2022-06-20 17:23:20', NULL),
(31, 'روزنامه قدیمی', '<p>روزنامه قدیمی</p>', 'روزنامه-قدیمی', NULL, 1, 27, '2022-06-20 17:12:04', '2022-06-20 17:12:04', NULL),
(32, 'ماشین و موتور', '<p>ماشین و موتور</p>', 'ماشین-و-موتور', NULL, 1, NULL, '2022-06-20 17:12:25', '2022-06-20 17:17:03', NULL),
(33, 'لوازم یدکی خودرو', '<p>لوازم یدکی خودرو</p>', 'لوازم-یدکی-خودرو', NULL, 1, 32, '2022-06-20 17:12:47', '2022-06-20 17:12:47', NULL),
(34, 'خودرو', '<p>خودرو</p>', 'خودرو', NULL, 1, 32, '2022-06-20 17:13:45', '2022-06-20 17:13:45', NULL),
(35, 'موتور', '<p>موتور</p>', 'موتور', NULL, 1, 32, '2022-06-20 17:14:50', '2022-06-20 17:14:50', NULL),
(36, 'قطعات داخل اتاق و بدنه', '<p>قطعات داخل اتاق و بدنه</p>', 'قطعات-داخل-اتاق-و-بدنه', NULL, 1, 33, '2022-06-20 17:15:33', '2022-06-20 17:15:33', NULL),
(37, 'قطعات موتور', '<p>قطعات موتور</p>', 'قطعات-موتور', NULL, 1, 33, '2022-06-20 17:15:53', '2022-06-20 17:15:53', NULL),
(38, 'فروش خودرو', '<p>فروش خودرو</p>', 'فروش-خودرو', NULL, 1, 34, '2022-06-20 17:16:37', '2022-06-20 17:16:37', NULL),
(39, 'فروش موتور', '<p>فروش موتور</p>', 'فروش-موتور', NULL, 1, 35, '2022-06-20 17:16:50', '2022-06-20 17:16:50', NULL),
(40, 'فرهنگ و هنر', '<p>فرهنگ و هنر</p>', 'فرهنگ-و-هنر', NULL, 1, NULL, '2022-06-20 17:17:55', '2022-06-20 17:17:55', NULL),
(41, 'کتاب و مجله و روزنامه', '<p>کتاب و مجله و روزنامه</p>', 'کتاب-و-مجله-و-روزنامه', NULL, 1, 40, '2022-06-20 17:18:17', '2022-06-20 17:18:17', NULL),
(42, 'کتاب', '<p>کتاب</p>\n\n<p> </p>', 'کتاب', NULL, 1, 41, '2022-06-20 17:18:35', '2022-06-20 17:23:25', NULL),
(43, 'مجله', '<p>مجله</p>', 'مجله', NULL, 1, 41, '2022-06-20 17:18:46', '2022-06-20 17:18:46', NULL),
(44, 'روزنامه', '<p>روزنامه</p>', 'روزنامه', NULL, 1, 41, '2022-06-20 17:19:00', '2022-06-20 17:19:00', NULL),
(45, 'ورزش و سفر', '<p>ورزش و سفر</p>', 'ورزش-و-سفر', NULL, 1, NULL, '2022-06-20 17:20:05', '2022-06-20 17:20:05', NULL),
(46, 'پوشاک ورزشی', '<p>پوشاک ورزشی</p>', 'پوشاک-ورزشی', NULL, 1, 45, '2022-06-20 17:20:23', '2022-06-20 17:20:23', NULL),
(47, 'لوازم ورزشی', '<p>لوازم ورزشی</p>', 'لوازم-ورزشی', NULL, 1, 45, '2022-06-20 17:20:38', '2022-06-20 17:23:24', NULL),
(48, 'وسایل مردانه', '<p>وسایل مردانه</p>', 'وسایل-مردانه', NULL, 1, 46, '2022-06-20 17:21:03', '2022-06-20 17:21:03', NULL),
(49, 'وسایل زنانه', '<p>وسایل زنانه</p>', 'وسایل-زنانه', NULL, 1, 46, '2022-06-20 17:21:23', '2022-06-20 17:23:26', NULL),
(50, 'توپ', '<p>توپ</p>', 'توپ', NULL, 1, 47, '2022-06-20 17:21:52', '2022-06-20 17:23:27', NULL),
(51, 'بدنسازی', '<p>بدنسازی</p>', 'بدنسازی', NULL, 1, 47, '2022-06-20 17:22:09', '2022-06-20 17:23:41', NULL),
(52, 'سایر', '<p>سایر</p>', 'سایر-2', NULL, 1, 47, '2022-06-20 17:22:21', '2022-06-20 17:22:21', NULL),
(53, 'کالاهای ماندگار', '<p>کالاهای ماندگار</p>', 'کالاهای-ماندگار', NULL, 1, NULL, '2022-06-20 17:22:39', '2022-06-20 17:22:39', NULL),
(54, 'ورزش', '<p>ورزش</p>', 'ورزش', NULL, 1, 53, '2022-06-20 17:23:01', '2022-06-20 17:23:30', NULL),
(55, 'سینما', '<p>سینما</p>', 'سینما', NULL, 1, 53, '2022-06-20 17:23:12', '2022-06-20 17:23:12', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `product_images`
--

CREATE TABLE `product_images` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `image` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_images`
--

INSERT INTO `product_images` (`id`, `image`, `product_id`, `created_at`, `updated_at`) VALUES
(1, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099317_597.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 1, '2022-06-24 19:35:17', '2022-06-24 19:35:17'),
(2, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099317_933.jpeg\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 1, '2022-06-24 19:35:18', '2022-06-24 19:35:18'),
(3, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099318_823.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 1, '2022-06-24 19:35:18', '2022-06-24 19:35:18'),
(4, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099318_745.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 1, '2022-06-24 19:35:18', '2022-06-24 19:35:18'),
(5, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099609_253.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 2, '2022-06-24 19:40:09', '2022-06-24 19:40:09'),
(6, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099609_930.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 2, '2022-06-24 19:40:10', '2022-06-24 19:40:10'),
(7, '{\"index\":\"images\\/product\\/2022\\/06\\/25\\/1656099610_275.webp\",\"imageDirectory\":\"images\\/product\\/2022\\/06\\/25\",\"disk\":\"public\"}', 2, '2022-06-24 19:40:10', '2022-06-24 19:40:10');

-- --------------------------------------------------------

--
-- Table structure for table `product_questions`
--

CREATE TABLE `product_questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product_variants`
--

CREATE TABLE `product_variants` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `sold_number` tinyint(4) NOT NULL DEFAULT 0,
  `marketable_number` tinyint(4) NOT NULL DEFAULT 0,
  `price` decimal(20,3) NOT NULL,
  `active` tinyint(4) NOT NULL DEFAULT 0 COMMENT '1 => will show product price',
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_variants`
--

INSERT INTO `product_variants` (`id`, `sold_number`, `marketable_number`, `price`, `active`, `product_id`, `created_at`, `updated_at`) VALUES
(1, 0, 5, '480000.000', 1, 2, '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(2, 0, 3, '500000.000', 0, 2, '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(3, 0, 10, '100000.000', 0, 2, '2022-06-24 19:40:01', '2022-06-24 19:40:01');

-- --------------------------------------------------------

--
-- Table structure for table `product_variant_selectable_attributes`
--

CREATE TABLE `product_variant_selectable_attributes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `variant_id` bigint(20) UNSIGNED NOT NULL,
  `attribute_id` bigint(20) UNSIGNED NOT NULL,
  `value_id` bigint(20) UNSIGNED NOT NULL,
  `value` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_variant_selectable_attributes`
--

INSERT INTO `product_variant_selectable_attributes` (`id`, `variant_id`, `attribute_id`, `value_id`, `value`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 1, 'سیاه', '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(2, 1, 3, 19, 'small', '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(3, 2, 1, 3, 'قرمز', '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(4, 2, 3, 17, 'xlarge', '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(5, 3, 1, 4, 'آبی', '2022-06-24 19:40:01', '2022-06-24 19:40:01'),
(6, 3, 3, 16, 'large', '2022-06-24 19:40:01', '2022-06-24 19:40:01');

-- --------------------------------------------------------

--
-- Table structure for table `product_weights`
--

CREATE TABLE `product_weights` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `showable` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `weight` double(8,2) NOT NULL COMMENT 'kg',
  `delivery_amount` decimal(20,3) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `product_weights`
--

INSERT INTO `product_weights` (`id`, `showable`, `weight`, `delivery_amount`, `created_at`, `updated_at`) VALUES
(1, 'زیر ۲۰۰ گرم', 0.25, '1000.000', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(2, '۲۵۰ گرم تا ۵۰۰ گرم', 0.50, '2000.000', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(3, '۵۰۰ گرم تا ۱ کیلوگرم', 1.00, '3000.000', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(4, '۱ تا ۲ کیلوگرم', 2.00, '5000.000', '2022-06-20 15:36:29', '2022-06-20 15:36:29'),
(5, 'بیشتر از ۲ کیلوگرم', 2.00, '6000.000', '2022-06-20 15:36:29', '2022-06-20 15:36:29');

-- --------------------------------------------------------

--
-- Table structure for table `provinces`
--

CREATE TABLE `provinces` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(64) COLLATE utf8mb4_unicode_ci NOT NULL,
  `en_name` varchar(64) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `area_code` tinyint(3) UNSIGNED DEFAULT NULL,
  `latitude` decimal(10,8) DEFAULT NULL,
  `longitude` decimal(11,8) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `provinces`
--

INSERT INTO `provinces` (`id`, `name`, `en_name`, `area_code`, `latitude`, `longitude`) VALUES
(1, 'آذربایجان شرقی', 'East Azerbaijan', 41, '37.97082910', '45.62582760'),
(2, 'آذربایجان غربی', 'West Azerbaijan', 44, '37.85371490', '43.44866590'),
(3, 'اردبیل', 'Ardabil', 45, '38.26669610', '48.27099320'),
(4, 'اصفهان', 'Isfahan', 31, '32.66221110', '51.54694070'),
(5, 'البرز', 'Alborz', 26, '36.02298310', '50.55685820'),
(6, 'ایلام', 'Ilam', 84, '33.63691930', '46.39649800'),
(7, 'بوشهر', 'Bushehr', 77, '28.91090220', '50.83002140'),
(8, 'تهران', 'Tehran', 21, '35.69673300', '51.20973350'),
(9, 'چهارمحال و بختیاری', 'Chaharmahal and Bakhtiari', 38, '31.90539810', '49.99617030'),
(10, 'خراسان جنوبی', 'South Khorasan', 56, '32.75699190', '55.98188210'),
(11, 'خراسان رضوی', 'Razavi Khorasan', 51, '35.57459830', '56.63584140'),
(12, 'خراسان شمالی', 'North Khorasan', 58, '37.43932840', '55.97495040'),
(13, 'خوزستان', 'Khuzestan', 61, '31.51309870', '47.88873790'),
(14, 'زنجان', 'Zanjan', 24, '36.68100000', '48.42318290'),
(15, 'سمنان', 'Semnan', 23, '35.57766970', '53.34909380'),
(16, 'سیستان و بلوچستان', 'Sistan and Baluchestan', 54, '28.24860330', '58.81079620'),
(17, 'فارس', 'Fars', 71, '29.44176370', '50.85564210'),
(18, 'قزوین', 'Qazvin', 28, '36.28133810', '49.94664540'),
(19, 'قم', 'Qom', 25, '34.68878450', '50.71197920'),
(20, 'كردستان', 'Kurdistan', 87, '35.63136750', '45.74418520'),
(21, 'كرمان', 'Kerman', 34, '30.27318060', '56.99620940'),
(22, 'كرمانشاه', 'Kermanshah', 83, '34.33739140', '47.02583300'),
(23, 'کهگیلویه و بویراحمد', 'Kohgiluyeh and Boyer-Ahmad', 74, '30.84208530', '50.24427770'),
(24, 'گلستان', 'Golestan', 17, '35.76998150', '51.45653800'),
(25, 'گیلان', 'Gilan', 13, '37.52755020', '48.44215160'),
(26, 'لرستان', 'Lorestan', 66, '33.52512460', '47.33120480'),
(27, 'مازندران', 'Mazandaran', 11, '36.36813810', '51.14940560'),
(28, 'مركزی', 'Markazi', 86, '34.62148310', '48.86641130'),
(29, 'هرمزگان', 'Hormozgan', 76, '27.19054290', '53.70737490'),
(30, 'همدان', 'Hamedan', 81, '34.81244970', '48.44002710'),
(31, 'یزد', 'Yazd', 35, '31.87968500', '54.26672670');

-- --------------------------------------------------------

--
-- Table structure for table `public_mail`
--

CREATE TABLE `public_mail` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `subject` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `body` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `send_at` timestamp NULL DEFAULT NULL,
  `sent` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `public_mail`
--

INSERT INTO `public_mail` (`id`, `subject`, `body`, `status`, `send_at`, `sent`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'عید نوروز مبارک', '<h3>و انتهای این قصه‌ی سرد و سفید<br>\nهمیشه سبز خواهد بود<br>\nتا رسیدن سال نو ، تنها یک سلام خورشید باقی ست . . .<br>\nهزاران تبریک</h3>', 1, '2022-03-20 21:30:00', 1, '2022-06-20 17:29:06', '2022-06-20 17:29:09', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `public_mail_files`
--

CREATE TABLE `public_mail_files` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `file_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `public_mail_id` bigint(20) UNSIGNED NOT NULL,
  `file_path` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `file_size` bigint(20) NOT NULL,
  `file_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `public_sms`
--

CREATE TABLE `public_sms` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `body` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0,
  `send_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `reports`
--

CREATE TABLE `reports` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `title` tinyint(4) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => visible, 1 => unvisible',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `name`, `description`, `status`, `created_at`, `updated_at`) VALUES
(1, 'شخصی سازی شده', 'adding custom permissions to user.', 1, NULL, NULL),
(2, 'چک کننده گزارشات', 'گزارشات ارسالی از طرف کاربران را بررسی میکند و در صورت لزوم محصول را غیر فعال میکند', 0, '2022-06-20 17:27:12', '2022-06-20 17:27:12');

-- --------------------------------------------------------

--
-- Table structure for table `selectable_attributes`
--

CREATE TABLE `selectable_attributes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `selectable_attributes`
--

INSERT INTO `selectable_attributes` (`id`, `name`, `created_at`, `updated_at`) VALUES
(1, 'رنگ', '2022-06-24 19:24:43', '2022-06-24 19:24:43'),
(2, 'رم', '2022-06-24 19:25:27', '2022-06-24 19:25:27'),
(3, 'سایز', '2022-06-24 19:26:12', '2022-06-24 19:26:12');

-- --------------------------------------------------------

--
-- Table structure for table `selectable_attribute_values`
--

CREATE TABLE `selectable_attribute_values` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `selectable_attribute_id` bigint(20) UNSIGNED NOT NULL,
  `value` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `background` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'when attribute is color',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `selectable_attribute_values`
--

INSERT INTO `selectable_attribute_values` (`id`, `selectable_attribute_id`, `value`, `background`, `created_at`, `updated_at`) VALUES
(1, 1, 'سیاه', '#000000', '2022-06-24 19:25:15', '2022-06-24 19:25:15'),
(2, 1, 'سفید', '#ffffff', '2022-06-24 19:25:15', '2022-06-24 19:25:15'),
(3, 1, 'قرمز', '#a51d2d', '2022-06-24 19:25:15', '2022-06-24 19:25:15'),
(4, 1, 'آبی', '#26a269', '2022-06-24 19:25:15', '2022-06-24 19:25:15'),
(5, 2, '۲', NULL, '2022-06-24 19:25:47', '2022-06-24 19:25:47'),
(6, 2, '۴', NULL, '2022-06-24 19:25:47', '2022-06-24 19:25:47'),
(7, 2, '۶', NULL, '2022-06-24 19:25:47', '2022-06-24 19:25:47'),
(8, 2, '۸', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(9, 2, '۱۲', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(10, 2, '۱۰', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(11, 2, '۱۳', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(12, 2, '۴۵', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(13, 2, '۱۵', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(14, 2, '۲۰', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(15, 2, '۱', NULL, '2022-06-24 19:25:48', '2022-06-24 19:25:48'),
(16, 3, 'large', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37'),
(17, 3, 'xlarge', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37'),
(18, 3, 'meduim', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37'),
(19, 3, 'small', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37'),
(20, 3, 'xx large', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37'),
(21, 3, 'xxx large', NULL, '2022-06-24 19:26:37', '2022-06-24 19:26:37');

-- --------------------------------------------------------

--
-- Table structure for table `sell_types`
--

CREATE TABLE `sell_types` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `persian_name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sell_types`
--

INSERT INTO `sell_types` (`id`, `persian_name`, `name`, `created_at`, `updated_at`) VALUES
(1, 'قیمت ثابت', 'fix_price', NULL, NULL),
(2, 'مزایده', 'auction', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `available_hours` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `phone_number` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `keywords` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `icon` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `logo` text COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`id`, `title`, `description`, `available_hours`, `phone_number`, `keywords`, `icon`, `logo`, `created_at`, `updated_at`) VALUES
(1, 'ایسام', 'فروش محصول بصورت مزایده یا عادی', 'ساعت ۶ تا ۱۲', '09035440654', 'مزایده,فروش', 'icon.png', 'logo.png', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `supports`
--

CREATE TABLE `supports` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => open, 1 => closed',
  `seen` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => unseen, 1 => seen',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `temporary_files`
--

CREATE TABLE `temporary_files` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `folder_path` text COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'for multiple files located in a folder',
  `file_path` text COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'for one file',
  `disk` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'local',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `used_copans`
--

CREATE TABLE `used_copans` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `copan_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `national_code` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `first_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `last_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `slug` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `profile_photo_path` text COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'avatar',
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `mobile_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_type` tinyint(4) NOT NULL DEFAULT 0 COMMENT '0 => user, 1 => admin',
  `is_superadmin` tinyint(1) NOT NULL DEFAULT 0,
  `status` tinyint(4) NOT NULL DEFAULT 0 COMMENT 'general status',
  `current_team_id` bigint(20) UNSIGNED DEFAULT NULL,
  `role_id` bigint(20) UNSIGNED DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `delivery_time_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  `cash` decimal(20,3) NOT NULL DEFAULT 0.000
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `email`, `mobile`, `national_code`, `first_name`, `last_name`, `slug`, `profile_photo_path`, `email_verified_at`, `mobile_verified_at`, `password`, `user_type`, `is_superadmin`, `status`, `current_team_id`, `role_id`, `remember_token`, `delivery_time_id`, `created_at`, `updated_at`, `deleted_at`, `cash`) VALUES
(1, 'admin@gmail.com', NULL, NULL, 'admin', NULL, NULL, NULL, '2022-06-20 15:36:30', '2022-06-20 15:36:30', '$2y$10$/Aa5GoITWiMRHv3DigesQO2966RcbfH0Dbmr.PF.wkXiW.ZkxD/rS', 1, 1, 0, NULL, NULL, NULL, 1, '2022-06-20 15:36:30', '2022-06-20 15:36:30', NULL, '0.000'),
(2, 'adada5116@gmail.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '$2y$10$8X46kosVTtbK7E18Dx4nRuMsy5ec9rY5zlTJFsOmXWIL7fZG3r1UG', 0, 0, 0, NULL, NULL, NULL, 1, '2022-06-24 14:05:35', '2022-06-24 14:05:35', NULL, '0.000');

-- --------------------------------------------------------

--
-- Table structure for table `user_favorite_products`
--

CREATE TABLE `user_favorite_products` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `product_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `user_favorite_sellers`
--

CREATE TABLE `user_favorite_sellers` (
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `seller_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `variant_frozen_number`
--

CREATE TABLE `variant_frozen_number` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `variant_id` bigint(20) UNSIGNED NOT NULL,
  `cart_item_id` bigint(20) UNSIGNED NOT NULL,
  `number` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `addresses`
--
ALTER TABLE `addresses`
  ADD PRIMARY KEY (`id`),
  ADD KEY `addresses_user_id_foreign` (`user_id`),
  ADD KEY `addresses_city_id_foreign` (`city_id`),
  ADD KEY `addresses_province_id_foreign` (`province_id`);

--
-- Indexes for table `amazing_sales`
--
ALTER TABLE `amazing_sales`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `amazing_sales_product_id_unique` (`product_id`);

--
-- Indexes for table `auctions`
--
ALTER TABLE `auctions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `auctions_product_id_foreign` (`product_id`),
  ADD KEY `auctions_period_id_foreign` (`period_id`);

--
-- Indexes for table `auction_follower`
--
ALTER TABLE `auction_follower`
  ADD KEY `auction_follower_auction_id_foreign` (`auction_id`),
  ADD KEY `auction_follower_user_id_foreign` (`user_id`);

--
-- Indexes for table `auction_periods`
--
ALTER TABLE `auction_periods`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `auction_suggestions`
--
ALTER TABLE `auction_suggestions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `auction_suggestions_usre_id_foreign` (`user_id`),
  ADD KEY `auction_suggestions_auction_id_foreign` (`auction_id`);

--
-- Indexes for table `banners`
--
ALTER TABLE `banners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cart_items`
--
ALTER TABLE `cart_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cart_items_user_id_foreign` (`user_id`),
  ADD KEY `cart_items_product_id_foreign` (`product_id`),
  ADD KEY `cart_items_variant_id_foreign` (`variant_id`);

--
-- Indexes for table `cash_payments`
--
ALTER TABLE `cash_payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cash_payments_user_id_foreign` (`user_id`);

--
-- Indexes for table `category_selectable_attribute_value`
--
ALTER TABLE `category_selectable_attribute_value`
  ADD KEY `category_selectable_attribute_value_category_id_foreign` (`category_id`),
  ADD KEY `category_selectable_attribute_value_attribute_value_id_foreign` (`attribute_value_id`),
  ADD KEY `category_selectable_attribute_value_attribute_id_foreign` (`attribute_id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cities_province_id_foreign` (`province_id`);

--
-- Indexes for table `copans`
--
ALTER TABLE `copans`
  ADD PRIMARY KEY (`id`),
  ADD KEY `copans_user_id_foreign` (`user_id`);

--
-- Indexes for table `delivery_times`
--
ALTER TABLE `delivery_times`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `discount_requests`
--
ALTER TABLE `discount_requests`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `faqs`
--
ALTER TABLE `faqs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `faqs_faq_category_id_foreign` (`faq_category_id`);

--
-- Indexes for table `faq_categories`
--
ALTER TABLE `faq_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `landing_page_copans`
--
ALTER TABLE `landing_page_copans`
  ADD PRIMARY KEY (`id`),
  ADD KEY `landing_page_copans_copan_id_foreign` (`copan_id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `notifications_notifiable_type_notifiable_id_index` (`notifiable_type`,`notifiable_id`);

--
-- Indexes for table `online_payments`
--
ALTER TABLE `online_payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `online_payments_user_id_foreign` (`user_id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`),
  ADD KEY `orders_user_id_foreign` (`user_id`),
  ADD KEY `orders_address_id_foreign` (`address_id`),
  ADD KEY `orders_payment_id_foreign` (`payment_id`),
  ADD KEY `orders_copan_id_foreign` (`copan_id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `order_items_order_id_foreign` (`order_id`),
  ADD KEY `order_items_product_id_foreign` (`product_id`),
  ADD KEY `order_items_amazing_sale_id_foreign` (`amazing_sale_id`),
  ADD KEY `order_items_variant_id_foreign` (`variant_id`);

--
-- Indexes for table `otps`
--
ALTER TABLE `otps`
  ADD PRIMARY KEY (`id`),
  ADD KEY `otps_user_id_foreign` (`user_id`);

--
-- Indexes for table `pages`
--
ALTER TABLE `pages`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `pages_slug_unique` (`slug`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payments_user_id_foreign` (`user_id`),
  ADD KEY `payments_type_id_foreign` (`type_id`),
  ADD KEY `payments_paymentable_type_paymentable_id_index` (`paymentable_type`,`paymentable_id`);

--
-- Indexes for table `payment_types`
--
ALTER TABLE `payment_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD PRIMARY KEY (`permission_id`,`role_id`),
  ADD KEY `permission_role_role_id_foreign` (`role_id`);

--
-- Indexes for table `permission_user`
--
ALTER TABLE `permission_user`
  ADD KEY `permission_user_permission_id_foreign` (`permission_id`),
  ADD KEY `permission_user_user_id_foreign` (`user_id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `products_slug_unique` (`slug`),
  ADD KEY `products_weight_id_foreign` (`weight_id`),
  ADD KEY `products_category_id_foreign` (`category_id`),
  ADD KEY `products_sell_type_id_foreign` (`sell_type_id`),
  ADD KEY `products_user_id_foreign` (`user_id`);

--
-- Indexes for table `product_attributes`
--
ALTER TABLE `product_attributes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_attributes_category_id_foreign` (`category_id`);

--
-- Indexes for table `product_attribute_default_values`
--
ALTER TABLE `product_attribute_default_values`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_attribute_default_values_attribute_id_foreign` (`attribute_id`);

--
-- Indexes for table `product_attribute_values`
--
ALTER TABLE `product_attribute_values`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_attribute_values_product_id_foreign` (`product_id`),
  ADD KEY `product_attribute_values_attribute_id_foreign` (`attribute_id`),
  ADD KEY `product_attribute_values_value_id_foreign` (`value_id`);

--
-- Indexes for table `product_categories`
--
ALTER TABLE `product_categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `product_categories_slug_unique` (`slug`),
  ADD KEY `product_categories_parent_id_foreign` (`parent_id`);

--
-- Indexes for table `product_images`
--
ALTER TABLE `product_images`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_images_product_id_foreign` (`product_id`);

--
-- Indexes for table `product_questions`
--
ALTER TABLE `product_questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_questions_user_id_foreign` (`user_id`),
  ADD KEY `product_questions_product_id_foreign` (`product_id`);

--
-- Indexes for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_variants_product_id_foreign` (`product_id`);

--
-- Indexes for table `product_variant_selectable_attributes`
--
ALTER TABLE `product_variant_selectable_attributes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `product_variant_selectable_attributes_variant_id_foreign` (`variant_id`),
  ADD KEY `product_variant_selectable_attributes_attribute_id_foreign` (`attribute_id`),
  ADD KEY `product_variant_selectable_attributes_value_id_foreign` (`value_id`);

--
-- Indexes for table `product_weights`
--
ALTER TABLE `product_weights`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `provinces`
--
ALTER TABLE `provinces`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `public_mail`
--
ALTER TABLE `public_mail`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `public_mail_files`
--
ALTER TABLE `public_mail_files`
  ADD PRIMARY KEY (`id`),
  ADD KEY `public_mail_files_public_mail_id_foreign` (`public_mail_id`);

--
-- Indexes for table `public_sms`
--
ALTER TABLE `public_sms`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `reports`
--
ALTER TABLE `reports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `reports_product_id_foreign` (`product_id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `selectable_attributes`
--
ALTER TABLE `selectable_attributes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `selectable_attribute_values`
--
ALTER TABLE `selectable_attribute_values`
  ADD PRIMARY KEY (`id`),
  ADD KEY `selectable_attribute_values_selectable_attribute_id_foreign` (`selectable_attribute_id`);

--
-- Indexes for table `sell_types`
--
ALTER TABLE `sell_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `supports`
--
ALTER TABLE `supports`
  ADD PRIMARY KEY (`id`),
  ADD KEY `supports_product_id_foreign` (`product_id`),
  ADD KEY `supports_user_id_foreign` (`user_id`),
  ADD KEY `supports_question_id_foreign` (`question_id`);

--
-- Indexes for table `temporary_files`
--
ALTER TABLE `temporary_files`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `used_copans`
--
ALTER TABLE `used_copans`
  ADD PRIMARY KEY (`id`),
  ADD KEY `used_copans_user_id_foreign` (`user_id`),
  ADD KEY `used_copans_copan_id_foreign` (`copan_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`),
  ADD UNIQUE KEY `users_mobile_unique` (`mobile`),
  ADD UNIQUE KEY `users_national_code_unique` (`national_code`),
  ADD UNIQUE KEY `users_slug_unique` (`slug`),
  ADD KEY `users_role_id_foreign` (`role_id`),
  ADD KEY `users_delivery_time_id_foreign` (`delivery_time_id`);

--
-- Indexes for table `user_favorite_products`
--
ALTER TABLE `user_favorite_products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_favorite_products_product_id_foreign` (`product_id`),
  ADD KEY `user_favorite_products_user_id_foreign` (`user_id`);

--
-- Indexes for table `user_favorite_sellers`
--
ALTER TABLE `user_favorite_sellers`
  ADD KEY `user_favorite_sellers_user_id_foreign` (`user_id`),
  ADD KEY `user_favorite_sellers_seller_id_foreign` (`seller_id`);

--
-- Indexes for table `variant_frozen_number`
--
ALTER TABLE `variant_frozen_number`
  ADD PRIMARY KEY (`id`),
  ADD KEY `variant_frozen_number_variant_id_foreign` (`variant_id`),
  ADD KEY `variant_frozen_number_cart_item_id_foreign` (`cart_item_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `addresses`
--
ALTER TABLE `addresses`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `amazing_sales`
--
ALTER TABLE `amazing_sales`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `auctions`
--
ALTER TABLE `auctions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `auction_periods`
--
ALTER TABLE `auction_periods`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `auction_suggestions`
--
ALTER TABLE `auction_suggestions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `banners`
--
ALTER TABLE `banners`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `cart_items`
--
ALTER TABLE `cart_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cash_payments`
--
ALTER TABLE `cash_payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1247;

--
-- AUTO_INCREMENT for table `copans`
--
ALTER TABLE `copans`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `delivery_times`
--
ALTER TABLE `delivery_times`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `discount_requests`
--
ALTER TABLE `discount_requests`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `faqs`
--
ALTER TABLE `faqs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `faq_categories`
--
ALTER TABLE `faq_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `landing_page_copans`
--
ALTER TABLE `landing_page_copans`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `online_payments`
--
ALTER TABLE `online_payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `otps`
--
ALTER TABLE `otps`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `pages`
--
ALTER TABLE `pages`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `payment_types`
--
ALTER TABLE `payment_types`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `product_attributes`
--
ALTER TABLE `product_attributes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;

--
-- AUTO_INCREMENT for table `product_attribute_default_values`
--
ALTER TABLE `product_attribute_default_values`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=112;

--
-- AUTO_INCREMENT for table `product_attribute_values`
--
ALTER TABLE `product_attribute_values`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `product_categories`
--
ALTER TABLE `product_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `product_images`
--
ALTER TABLE `product_images`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `product_questions`
--
ALTER TABLE `product_questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `product_variants`
--
ALTER TABLE `product_variants`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `product_variant_selectable_attributes`
--
ALTER TABLE `product_variant_selectable_attributes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `product_weights`
--
ALTER TABLE `product_weights`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `provinces`
--
ALTER TABLE `provinces`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT for table `public_mail`
--
ALTER TABLE `public_mail`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `public_mail_files`
--
ALTER TABLE `public_mail_files`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `public_sms`
--
ALTER TABLE `public_sms`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `reports`
--
ALTER TABLE `reports`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `selectable_attributes`
--
ALTER TABLE `selectable_attributes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `selectable_attribute_values`
--
ALTER TABLE `selectable_attribute_values`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `sell_types`
--
ALTER TABLE `sell_types`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `settings`
--
ALTER TABLE `settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `supports`
--
ALTER TABLE `supports`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `temporary_files`
--
ALTER TABLE `temporary_files`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `used_copans`
--
ALTER TABLE `used_copans`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_favorite_products`
--
ALTER TABLE `user_favorite_products`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `variant_frozen_number`
--
ALTER TABLE `variant_frozen_number`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `addresses`
--
ALTER TABLE `addresses`
  ADD CONSTRAINT `addresses_city_id_foreign` FOREIGN KEY (`city_id`) REFERENCES `cities` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `addresses_province_id_foreign` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `addresses_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `amazing_sales`
--
ALTER TABLE `amazing_sales`
  ADD CONSTRAINT `amazing_sales_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `auctions`
--
ALTER TABLE `auctions`
  ADD CONSTRAINT `auctions_period_id_foreign` FOREIGN KEY (`period_id`) REFERENCES `auction_periods` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `auctions_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `auction_follower`
--
ALTER TABLE `auction_follower`
  ADD CONSTRAINT `auction_follower_auction_id_foreign` FOREIGN KEY (`auction_id`) REFERENCES `auctions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `auction_follower_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `auction_suggestions`
--
ALTER TABLE `auction_suggestions`
  ADD CONSTRAINT `auction_suggestions_auction_id_foreign` FOREIGN KEY (`auction_id`) REFERENCES `auctions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `auction_suggestions_usre_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `cart_items`
--
ALTER TABLE `cart_items`
  ADD CONSTRAINT `cart_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `cart_items_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `cart_items_variant_id_foreign` FOREIGN KEY (`variant_id`) REFERENCES `product_variants` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `cash_payments`
--
ALTER TABLE `cash_payments`
  ADD CONSTRAINT `cash_payments_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `category_selectable_attribute_value`
--
ALTER TABLE `category_selectable_attribute_value`
  ADD CONSTRAINT `category_selectable_attribute_value_attribute_id_foreign` FOREIGN KEY (`attribute_id`) REFERENCES `selectable_attributes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `category_selectable_attribute_value_attribute_value_id_foreign` FOREIGN KEY (`attribute_value_id`) REFERENCES `selectable_attribute_values` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `category_selectable_attribute_value_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `product_categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `cities`
--
ALTER TABLE `cities`
  ADD CONSTRAINT `cities_province_id_foreign` FOREIGN KEY (`province_id`) REFERENCES `provinces` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `copans`
--
ALTER TABLE `copans`
  ADD CONSTRAINT `copans_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `faqs`
--
ALTER TABLE `faqs`
  ADD CONSTRAINT `faqs_faq_category_id_foreign` FOREIGN KEY (`faq_category_id`) REFERENCES `faq_categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `landing_page_copans`
--
ALTER TABLE `landing_page_copans`
  ADD CONSTRAINT `landing_page_copans_copan_id_foreign` FOREIGN KEY (`copan_id`) REFERENCES `copans` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `online_payments`
--
ALTER TABLE `online_payments`
  ADD CONSTRAINT `online_payments_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `orders`
--
ALTER TABLE `orders`
  ADD CONSTRAINT `orders_address_id_foreign` FOREIGN KEY (`address_id`) REFERENCES `addresses` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `orders_copan_id_foreign` FOREIGN KEY (`copan_id`) REFERENCES `copans` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `orders_payment_id_foreign` FOREIGN KEY (`payment_id`) REFERENCES `payments` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `orders_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `order_items`
--
ALTER TABLE `order_items`
  ADD CONSTRAINT `order_items_amazing_sale_id_foreign` FOREIGN KEY (`amazing_sale_id`) REFERENCES `amazing_sales` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `order_items_order_id_foreign` FOREIGN KEY (`order_id`) REFERENCES `orders` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `order_items_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `order_items_variant_id_foreign` FOREIGN KEY (`variant_id`) REFERENCES `product_variants` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `otps`
--
ALTER TABLE `otps`
  ADD CONSTRAINT `otps_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_type_id_foreign` FOREIGN KEY (`type_id`) REFERENCES `payment_types` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `payments_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD CONSTRAINT `permission_role_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `permission_role_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `permission_user`
--
ALTER TABLE `permission_user`
  ADD CONSTRAINT `permission_user_permission_id_foreign` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `permission_user_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `products_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `product_categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `products_sell_type_id_foreign` FOREIGN KEY (`sell_type_id`) REFERENCES `sell_types` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `products_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `products_weight_id_foreign` FOREIGN KEY (`weight_id`) REFERENCES `product_weights` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_attributes`
--
ALTER TABLE `product_attributes`
  ADD CONSTRAINT `product_attributes_category_id_foreign` FOREIGN KEY (`category_id`) REFERENCES `product_categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_attribute_default_values`
--
ALTER TABLE `product_attribute_default_values`
  ADD CONSTRAINT `product_attribute_default_values_attribute_id_foreign` FOREIGN KEY (`attribute_id`) REFERENCES `product_attributes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_attribute_values`
--
ALTER TABLE `product_attribute_values`
  ADD CONSTRAINT `product_attribute_values_attribute_id_foreign` FOREIGN KEY (`attribute_id`) REFERENCES `product_attributes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `product_attribute_values_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `product_attribute_values_value_id_foreign` FOREIGN KEY (`value_id`) REFERENCES `product_attribute_default_values` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_categories`
--
ALTER TABLE `product_categories`
  ADD CONSTRAINT `product_categories_parent_id_foreign` FOREIGN KEY (`parent_id`) REFERENCES `product_categories` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_images`
--
ALTER TABLE `product_images`
  ADD CONSTRAINT `product_images_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_questions`
--
ALTER TABLE `product_questions`
  ADD CONSTRAINT `product_questions_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `product_questions_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_variants`
--
ALTER TABLE `product_variants`
  ADD CONSTRAINT `product_variants_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `product_variant_selectable_attributes`
--
ALTER TABLE `product_variant_selectable_attributes`
  ADD CONSTRAINT `product_variant_selectable_attributes_attribute_id_foreign` FOREIGN KEY (`attribute_id`) REFERENCES `selectable_attributes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `product_variant_selectable_attributes_value_id_foreign` FOREIGN KEY (`value_id`) REFERENCES `selectable_attribute_values` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `product_variant_selectable_attributes_variant_id_foreign` FOREIGN KEY (`variant_id`) REFERENCES `product_variants` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `public_mail_files`
--
ALTER TABLE `public_mail_files`
  ADD CONSTRAINT `public_mail_files_public_mail_id_foreign` FOREIGN KEY (`public_mail_id`) REFERENCES `public_mail` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `reports`
--
ALTER TABLE `reports`
  ADD CONSTRAINT `reports_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `selectable_attribute_values`
--
ALTER TABLE `selectable_attribute_values`
  ADD CONSTRAINT `selectable_attribute_values_selectable_attribute_id_foreign` FOREIGN KEY (`selectable_attribute_id`) REFERENCES `selectable_attributes` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `supports`
--
ALTER TABLE `supports`
  ADD CONSTRAINT `supports_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `supports_question_id_foreign` FOREIGN KEY (`question_id`) REFERENCES `supports` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `supports_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `used_copans`
--
ALTER TABLE `used_copans`
  ADD CONSTRAINT `used_copans_copan_id_foreign` FOREIGN KEY (`copan_id`) REFERENCES `copans` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `used_copans_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_delivery_time_id_foreign` FOREIGN KEY (`delivery_time_id`) REFERENCES `delivery_times` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `users_role_id_foreign` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE SET NULL;

--
-- Constraints for table `user_favorite_products`
--
ALTER TABLE `user_favorite_products`
  ADD CONSTRAINT `user_favorite_products_product_id_foreign` FOREIGN KEY (`product_id`) REFERENCES `products` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_favorite_products_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `user_favorite_sellers`
--
ALTER TABLE `user_favorite_sellers`
  ADD CONSTRAINT `user_favorite_sellers_seller_id_foreign` FOREIGN KEY (`seller_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `user_favorite_sellers_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `variant_frozen_number`
--
ALTER TABLE `variant_frozen_number`
  ADD CONSTRAINT `variant_frozen_number_cart_item_id_foreign` FOREIGN KEY (`cart_item_id`) REFERENCES `cart_items` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `variant_frozen_number_variant_id_foreign` FOREIGN KEY (`variant_id`) REFERENCES `product_variants` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
